[
{"title": "Visual Builder - Social Share Block", "post": ["Visual Builder - Social Share Block", "The Social Share block contains multiple buttons for different social networks including Facebook, Twitter, WhatsApp, Linkedin, Email and Link to allow easier access for people to share your site or page.", "With the Social Share block, we've added settings to allow you to change copy and imagery unique to each social network.", "Try clicking the social share buttons below to test out the social share block!", "The Social Share Block can be added anywhere on your page, within a Column using the", ".", "1.", "add new Block anywhere in a Column.", "2. Select Social Share block.", "icon that appears on the social share block. This will open the Social Share sidebar.", "Under Social Feed Options you can edit the Source and which social networks to display. Change where the social share content should pull in from, which include, current page, platform homepage, specific page, event or custom url.", "Social Feed Layout let's you style the Social Feed buttons. Change the colours, choose between icons and icons with text, enlarge the buttons and change its shape. You can also add a label to go along side the buttons.", "You can update the title, descipriton and image for your Social Share within the Visual Builder and Funraisin Dashboard. By default we reccomend updating the overall Social Share content within the Dashboard under Platform Settings, this will be used as a fallback if no Social Share content is detected on the page.", "The Social Share content is pulled in from the source location. For example: if you select current page (which is the default source) then it will share the social content from within the page.", "Within the dashboard under page settings, you will find social sharing options. Within an event page the social share tab sits across the top.", "Make sure you check out the", "and"]},
{"title": "Converting a registration fee to a donation", "post": ["Converting a registration fee to a donation", "A ticket/entry is the registration an individual makes in order to be able to participant within your active event.", "Converting entries/tickets to donations is most helpful for users that have signed up but no longer wish to participate within the event, OR a user who has purchased for others that no longer want to participte but still want to be within the event themselves.", "Converting to a donation, gives the entrant the oportunity to have the entry purchased be donations that are visible on their fundraiser page and kickstart their fundraising through donations.", "The main benefit is having the oportunity to still support your charity instead of refunding the entry which helps your cause and give them a fundraising boost if their refunding the entry of other ticketholders they've purchased.", "To swap the existing funds used for one area to another area without refunding.", "Funds used to help support the charities cause.", "The payment required to enter a paid event or paid tickited event in order to be an active participant."]},
{"title": "Visual Builder - Donation Form Block", "post": ["Visual Builder - Donation Form Block", "Traditionally in Funraisin, to create a donation or crowdfunding page, you would select this as a page type when creating a new page. The Donation Form Block allows for more flexibility without losing the capabilities from our existing donation pages. This means we can now create fully customisable donation form layouts without the restriction of a template.", "A traditional donation page can still be created by selecting the Legacy Template when creating a new page, however using the donation form block is the recommeded method for setting up donation pages. Pages utilising the Donation Form Block will still be included in reports, the same as existing donation pages.", "The Donation Form Block can be added anywhere on your page, within a Column using the", ".", "1.", "add a Section.", "2. Add a Block within a Column.", "3. Select Donation Form block.", "Depending on your final layout for the Donation Form Block you can adjust the Column Width, in the containing column, to restrict the width of the Donation Form Block.", "While we have kept our most common settings from our donation pages in our Donation Form Block, we've also added more customisable settings unique to the block.", "The Donation Settings can be accessed on the Donation Form Block by clicking the heart icon on the block toolbar. This will open the right Donation Settings Sidebar.", "Below is a breakdown of all the Donation Form Settings you can access from the Donation Settings Sidebar:", "- Update Donation Amounts and Donation Frequencies. Select single or multiple frequencies from, once, weekly, fortnightly, monthly and/or yearly. Define your pre-selected frequency.", "You can add multiple Donation Amounts and toggle on/off Amounts you wish to use later on. (Note: leaving Donation Amounts blank in other frequencies will pull", ".)", "- You can set a Goal for your Donation Form Block. The Goal will be applied to the Progress Bar which you can toggle on/off in the", "tab.", "- Set your Payment Method, Currency and Tax Reciept for the Donation Form Block.", "- Set the Donation Form Block form fields and headings on each step. Tick the checkboxes to turn specific form fields on or off. Activate required fields by clicking the 'Required' button next to relative form field.", "Personalise the headings for each step by updating the copy in the associated heading field. (Note: Leaving the heading text field blank will default headings to generic copy.) You can toggle individual headings on/off.", "- Customise the default Confirmation Page copy or redirect the confirmation to a new page. Add a unique thank you email for a Donation Form Block. (Note: Keeping this toggled off will default to the generic Thank You email foud in the automated emails in platform set up)", "- If a matched giver has been set up on the platform you can turn on matched giving for the page.", "- Apply Google Analytics, Google Tag Manager, Facebook Pixel and other tracking code.", "- Once your Donation Form Block is all set you can use the Embed Url and Code to apply it anywhere else.", "Adding a Donation Form Block to a page will turn on the Donation Settings tab in the Admin. You can still access all these settings above in the admin under Donation Settings.", "You will still have the ability to edit donation specific settings like dollar handles through the classic admin however only the the visual builder allows complete control over all donation specific settings PLUS design, styling and layout.", "Layout is the most exciting setting for our Donation Form Block. It allows you to style your Donation Form Block to match your branding or designs.", "Here is a breakdown of the Layout options:", "There are 3 types of Donation Amount Layouts, Horizontal, Vertical and Minimal. The three layouts are interchangeable with your Donation Amounts. You can preview each Donation Amount Layout on the page when toggling through each option.", "The Donation Form Block is made up of two components, the Background and Top Section. Changing the Form Background and Form Colour will apply the changes to the whole form. Once you apply a Top Background and Top Text Colour this will override and apply the colour changes to the elements in the top section. Elements in the Top Section include the Progress Bar, Steps and Main Title.", "The donation form can be either 1 or 3 steps.", "You can set how steps display, i.e. Text, Icons, Number or Hidden. Selecting Hidden will keep steps on but not display on the Form. You can customise the Background, Active Colour and Text Colour.", "You can easily add a progress bar within the form by toggling the progress bar on. There are three style settings, Progress Bar, Progress Amount and Progress Amount with Bar. Control the goal from the goal tab.", "Make sure you check out the", "and"]},
{"title": "Adding Offline Donations", "post": ["Adding an Offline Donation", "This article will provide steps on adding an offline donation to:", "Head to the", "Module and click the blue", "button.", "Click image to expand", "To ensure the donation contributes to your total, click", "and then a", "box will appear. Select how you received the donation from the dropdown (this is for your records only, it won’t be publicly visible). We recommend using the payment type", "to make sure that these donations stand out in reporting.", "Click image to expand", "Click image to expand", "Click image to expand", "To ensure the donation contributes to your total, click", "and then a", "box will appear. Select how you received the donation from the dropdown (this is for your records only, it won’t be publicly visible). We recommend using the payment type", "to make sure that these donations stand out in reporting.", "A donation record will be created and a donation assigned to that appeal.", "Click image to expand", "Click image to expand", "Note: remember to keep all of the fields from the template in the import file and in the same order as set in the template. If you want to not include any data for a column, leave the value blank.", "If you’d like these donations to appear on the site as paid donations (for example to be visible on fundraisers profile pages), tick the", "box.", "This does not happen automatically for Offline Donations. Offline Donations can send an email to the Sponsor only.", "After you've saved the donation, edit the donation record and you can", "check the", "and save - this will send the receipt to the sponsor.", "If you’d like further help, please pop in a support ticket from your admin, and our team will assist you."]},
{"title": "Reassigning donations", "post": ["Reassigning donations", "The team managing your appeals or events, so they can ensure donations are assigned to the correct appeal, member or team.", "Quickly reassign donations to appear on different fundraising pages.", "You can easily reassign a donation between members and teams.", "To reassign donations between members and teams head to the", "module and find the specific donation record you'd like to reassign.", "Click the", "next to the donation record in question and you'll land on the", "tab.", "Click to Expand", "In your white middle navigation select the", "option.", "If you're reassigning a donation between members, you do this by typing the members' name in the", "area and then choosing the new member the donation should be assigned to. You do this by selecting their name and ID when it appears during typing.", "If the member is in a team or organisation, you'll be able to also select these from the drop-down. This will ensure the donation contributes to their individual fundraising page, but also their team and/or organisation total.", "A donation can just be assigned to a team as a whole, or an organisation as a whole if no member has been chosen.", "You're also able to reassign donations between events, and pages.", "Once you've chosen who the donation needs to go towards, simply Save.", "Click to Expand"]},
{"title": "Assigning a receipt number to an offline donation", "post": ["Assigning a receipt number to an offline donation", "Offline Donations are considered donations that have been given directly to fundraisers or the charity and not made on a personal fundraising page or donation page. Similar to online donations a tax receipt number should be assigned to offline donations.", "A promise or agreement (from the donor) to make the payment in the future.", "A unique number assigned to each transaction on the platform (such as donations, entry fees, payments made to buy merchandise and etc).", "This support article will explain why an offline donation may not have a receipt number and how to update it. For information on how to add an offline donation, please review this", ".", "Click to expand", "Click to expand", "Click to expand", "Click to expand"]},
{"title": "Visual Builder - Donation Feed Block", "post": ["Visual Builder - Donation Feed Block", "Donation Feed block let's you place a live feed of donations that are made from single or multiple donation forms. The donation feed block comes with multiple layout and styling options to suit your needs.", "The Donation Feed Block can be added anywhere on your page, within a Column using the", ".", "1.", "add new Block anywhere in a Column.", "2. Select Donation Feed block.", "There are a few unique settings specific to the Donation Feed block. To edit Donation Feed Block settings click the Edit", "icon, this will open the Donation Feed Sidebar. There you can change data to display in the donation feed under", ". Pull a live donation feed from a specific page, event or muliple pages and events. You can aslo order live feed by Date, Amount, Name or Random.", "You can customise the look of your live Donation Feed, within the Visual Builder. Under Styles choose between a Floating Cards layout or a Simple list.", "You can change the colours for both layout styles. Apply colour to the tile background, the text colour, the background circle for the amounts and the amount text colour.", "The Donation Feed Elements allow you to further customise the components in the Donation Feed. Toggle on/off the Profile Images, Donation received time, Donor Message, Sort filter dropdown.", "Make sure you check out the", "and"]},
{"title": "Pages & Site Content: Get Started", "post": ["Pages & Site Content", "Become an overnight digital designer watching our", ". Now available on on demand."]},
{"title": "Refunding Donations", "post": ["Refunding Donations", "Note: Donations made via PayPal will need to be refunded in PayPal as well as the platform.", "To process a partial refund you will need to have access to the", "module - if you do not have access please ask a colleague who does have access or pop in a support ticket and the Support team will complete the partial refund for you.", "Head to the", "module and find the specific donation record you’d like to refund.", "Click to Expand", "Click the", "next to the donation record in question and you’ll land on the", "tab.  In your middle navigation select the", "option.", "Click the refund tab and underneath", "tick the", "tick box", "scroll up then Save.", "Click to Expand", "This will automatically connect up to your Stripe account and perform the refund.", "If you are refunding a PayPal transaction, refunding in the Funraisin platform will not transfer any funds, to transfer funds back to the donor you will also need to perform the refund within your PayPal account as well."]},
{"title": "Anonymising donations", "post": ["Anonymising donations", "As an admin, you can update a donor's name to be Anonymous.", "This can be used to either hide a donor's identity, hide the donation, or to edit the donor's message and display name.", "When making a donation, unless a donor has actively chosen to appear anonymous, then their name, amount, and optional message will appear on the fundraisers' page. If a donor or fundraiser contacts you to make a donation anonymous, it's easy and quick to do so.", "First of all, find the donation to make anonymous. This can be done by searching for the donor using their name, email, or more directly, the receipt number in the search bar in the platform. Alternatively, the donation can be found by searching through the", "module from the left-hand navigation. Once you have clicked into a donation, you will land on", ".", "Click to expand", "From here, click on", "in the middle white navigation and scroll down to view", "from the main window.", "Click to expand", "Here you have the option to tick the box saying", ". By ticking this box, and then hitting Save, the donation will update on the fundraiser's page to say it is from Anonymous.", "Click to expand", "If a donor contacts you as they want to update the donation display name or message, then these can also be updated within the admin. For example, they may have put the donation under their name 'John Smith', but would actually like the donation to appear from 'The Smith Family.'", "Click to expand", "If a donor would rather their donation and amount did not appear within a fundraisers list of donations, this can be easily removed. Navigate to", ">", "as above, and untick the box saying '"]},
{"title": "Donation handles", "post": ["Donation handles", "Dollar handles are preset, suggested donation amounts that can be selected by entrants or donors when making a donation.", "They give users a set of easily accessible options to choose from when donating that are relevant to your goals and service values.", "Dollar handles can be changed for all donation types (sponsored donations, personal donations, in memory, one-off, and regular giving).", "are the dollar handles that appear on a fundraisers/team page.", "are the dollar handles that appear within the registration flow for the entrant to donate to themselves.", "To edit your platform default", "and", ", head to:", "Platform Setup > Donation Defaults", "Your view will default to Sponsored Donations and here‘s where you build up your dollar handles specific to a sponsored donation.", "Click the edit icon on the right of each dollar handle to change the amount, image, and description/impact text. If uploading images to be used for each dollar handle, they should be a consistent size, JPG format, and square.", "Once saved, you can drag and drop your list of dollar handles to order as you wish.", "You also have the option to change the suggested amounts to be different on desktop vs mobile.", "Click to expand", "Below is an example of how the Sponsored donation dollar handles look on a fundraising page.", "Click to expand", "If you would like to adjust the donation defaults for an event you can do this by navigating to:", "Edit your event > Donation Defaults (white middle nav) > Tick to enable custom dollar handles", "Once enabled, you can set up dollar handles that will be specific to that event.", "Click to expand", "One-off, in memory, and regular giving donations are handled in your Pages module. You can create as many donation pages as you need for your seasonal appeals, always-on donation pages, and more.", "Head to pages, add a New Page and then select the Donation Template. Continue on as you normally would with setting up your page with all the elements and styling you'd like (the header image, SEO metadata, the content itself which can appear above the donation form, etc). This", "provides a step-by-step guide to setting up a donation page.", "Within", ", you’ll now see the Donation Settings option in your middle navigation. Click this and you’ll see all the options within a donation page. You can turn on One-Off, Recurring Donations, and Paypal by going into the payment settings tab (if you’ve connected up to your Paypal account), or any combination of these.", "Within your Donation Settings section you can customise the dollar handles, form options, confirmation page, thank you email, and choose your preferred layout option.", "If using", ", edit the donation section to display your donation-specific settings.", "Click to expand", "Editing your dollar handles is done the same as through your platform level Sponsored and Personal Donations. Add the amount, description (optional) and image (optional).", "Here’s where you can turn on and off data capture fields for each donation page you create, turn on the default In Memory fields, or even add new fields by inserting a web form you’ve created. If inserting a web form, the fields in your web form will appear as the last fields on the donation form above the submit button. Please note, web forms are not supported on all donation layouts.", "The below images are an example of where to edit within Classic Builder and Visual Builder.", "Click to expand", "Click to expand", "Your Confirmation Page allows you to either redirect a donor to a specific page after they make their donation or you can choose to simply display a specific confirmation page copy on the default donation confirmation page template (in this case the header image and header copy will default to the specific donation page you are using). Edit your confirmation page copy easily using the editor on this tab.", "Click to expand", "Click to expand", "Here’s where you can customise the thank you email that donors will receive specific to the donation page they made their donation on. For example, if you’re creating an end of financial year appeal, you may wish to style the email template and/or use a specific copy relating to the end financial year appeal in the confirmation email the donor receives. Choose the template you’d like to use and then edit the copy through the editor – remembering to use the personalisation tags as needed such as sponsor name and sponsor amount to personalise the email.", "Click to expand", "Click to expand", "If you're running multiple events on your platform with different target audiences, then it's a great idea to ensure your dollar handles are unique to that event. We also suggest adding in images and descriptors so you can explain to your supporters what their money will go towards.", "E.g $25 will provide an animal in the shelter with a new home support kit."]},
{"title": "Gift Aid", "post": ["Gift Aid", "Gift aid is a", "scheme that allows registered charities to claim 25p for every £1 made in donations.", "This means charities can potentially gain an", "in donations if they have the right tools in place to collect the data necessary for Gift Aid.", "Below is an example of the Gift Aid declaration on a donation form.", "This article will cover:", "Click to expand", "For individuals to make a Gift Aid eligible donation, they must tick a box to confirm they are a UK taxpayer and provide their address when donating. If a donor ticks to make their donation Gift Aid eligible but does not provide a valid address, then Gift Aid cannot be claimed.", "Therefore, it’s essential that the address fields on donation forms are mandatory so that donors' addresses are captured.", "UK charities have two options regarding claiming Gift Aid from HMRC.", "Click to expand", "To do this navigate to the donation page and select:", "Donation settings > Form Options.", "Click to expand", "Click to expand", "To edit in Visual Builder, edit your Donation block.", "Edit Donation Settings > Form > Expand Personal Details > Display address and make mandatory > Save and publish", "If you have an optional donation option within your reg form, then you need to ensure you are capturing the entrant's address.", "This can be done in the event:", "Entry Forms > Edit your reg form > Create Account", "Tick to display address and for it to be mandatory.", "Click to expand", "This can be set at Platform level or event level. To update at Platform level, navigate to:", "Platform Settings > Donation Defaults > Sponsored Donations > Form Options", "Ensure the address is ticked as a mandatory field for both Individual Pages and Team Pages, then Save.", "To update at event level (necessary if you have custom donation amounts at event level), navigate to your event:", "Donation Defaults > Form Options > Individual Pages / Team Pages", "Ensure address is ticked as a mandatory field for both individuals and team fundraising pages and Save.", "Click to expand", "You can report on Gift Aid within your Donation reports. This will appear as a Y or N.", "Navigate to your Data Exports module and edit any of your Donation reports. Within Export Fields add a new field, choosing ‘Gift Aid’ from the drop down.", "You can also add a", "filter to a donation report to only pull donations that have opted into Gift Aid. To do this, navigate to:", "Donations module > Search", "site_url/management/donations/search", "Expand", "and tick 'opted into gift aid' > Save. Once done, this will display only donations that have opted into Gift Aid. At the top of the page, name this search, e.g. 'Gift Aid Donations' and save. This will create a smart list, that will keep updating with donations that match that criteria.", "Now navigate over to your Data Exports module and edit your donation report. Within your filter options you can choose your new Gift Aid list and save. If you download the report, it will now only download the donations that have opted into Gift Aid. When using a smart list, you cannot use the event/page filter, on the report, but you can filter by date.", "More information on claiming Gift Aid can be found on the", ".", "Adding the Gift Aid field to a donation report", "Naming and saving your Smart List search", "Adding your Smart List search as a filter to your donation report"]},
{"title": "Facebook Fundraiser", "post": ["Facebook Fundraiser", "Around 2019 Facebook started releasing an update that prompted facebook users to create fundraising pages within Facebook. You may have seen the prompts yourself as it was a common occurance for people in our industry when sharing a public fundraising page on Facebook you would often experience prompts to also create a page within facebook itself.", "Initially this was met with frustration in our industry since charities themselves really had no control over who setup pages and how they were managed and too often a fundraiser didn't really understand what it was that they were doing, they were often merely trying to share a page for an event that they had just signed up to and along came Facebook prompting them to create a second one, which many did, but the catch then was that anyone that donated to their Facebook page didn't get recognised on their \"actual\" fundraising page on the charity's site.", "Additionally, for anyone actually wantingto create a facebook fundraising page it is a very manual process and one that exposes the fundraiser to numerous other charities whilst setting up their page, so it was almost a step backwards to how things were on shared platforms.", "To counteract this Facebook released an API that allowed charities to control certain aspects of this and also get access to basic donation data made on Facebook so at least any donations received on Facebook could be reflected on their public facing page.", "When a fundraiser signs up to an event or creates a DIY page you can offer them the choice to then create a facebook fundraising page which acts like an extension of their online fundraising page.", "This Facebook fundraising page can only be accessed from within Facebook itself, it isn't a public page so it's only visible to the fundraiser's facebook friends.", "Any donation then made to the Facebook fundraising page will also appear on their public fundraising page on your site.", "There are naturally a few limitations to the integration which it is important to know of.", "Firstly, the donation data that we get back from Facebook is only the Amount, we don't get any personal details at all from donors donating to Facebook fundraising pages.", "Secondly, since the transaction takes place in Facebook you wont get access to the transaction data in Funraisin nor will you be able to perform common tasks like refunds or reconciliation. That all must take place within Facebook.", "In order to support Facebook Fundraising on your website you must first be registered for Facebook's Non-profit pages and you can find out more about that at", "If you already support the ability to accept donations on your Facebook page then you are half way there, if not then you will need to signup on the above link first before you can proceed.", "You must also make sure that your Facebook business account is verified. You can read more on how to get verified at", "Please keep in mind that verifying your business can take up to several weeks as you will have to provide specific information to Facebook and wait for their approvals which currently is taking longer than expected due to COVID.", "Once you are verified the next step is to associate your website's Facebook APP with your Facebook page and this is quite straight forward to do.", "Visit", "to login to your business account and then navigate to", "then under", "choose", "To Find your APP ID simply login to Funraisin and go to Platform Setup > Apps Settings and you should see at the very top of the page your FB APP ID", "Paste this ID into the field in Facebook.", "Once you have added your APP to your page this will send an alert to us to approve.", "Once your Organisation has been verified and the app has been added to your Facebook page, we can log a request on your behalf to gain access to the Facebook Fundraiser API.", "This currently takes between 2-4 weeks for Facebook to grant access.", "Once approved we will enable Facebook Fundraising on your platform and you will then see some additional options when setting up online events or DIY fundraising themes.", "For Events navigate to Fundraising Options from the middle nav when editing your event and you will see a Facebook Fundraising tab.", "Every Facebook event must have the following:", "Once these are all in place any fundraiser taking part in your event will see an option on their fundraising dashboard allowing them to optionally create a Facebook Fundraiser.", "Almost immediately after donations are made within Facebook to fundraisers they will appear in Funraisin with a donation type of \"facebook\", we will also create a Transaction record with a payment type of \"facebook\" for the amount that was donated via Facebook.", "The only data we get access to is the amount and to whom the donation was donated to (the fundraiser), we don't get any payment information or personal information of the donor so any reconciliation will need to be handled from within your Facebook business manager account."]},
{"title": "Donation Types", "post": ["Donation Types", "When reporting on donations received on your platform, you’ll notice that each donation has a Donation Type, such as", ",", ", or", ".", "Depending on how the donation was made, we categorise it to assist with your reporting and analysis. Let’s explain how this works:", "Firstly, to find out the type of donation, you can see this within the donation record under the Personal Details section.", "To report on this information, you need to use the field", "within your Donation report or Transaction report.", "Click to expand", "An online donation is a donation made to a fundraiser/team page, donation page, or crowdfunding page by a member of the public. This could be a friend sponsoring a friend, or a supporter of the charity making a donation to an appeal.", "A personal donation is one that a fundraiser makes to themselves. This is either during the registration flow by self donating to their page. Or, when logged in, making a donation on their fundraising page.", "When a donor commits to a recurring donation, e.g. $10 once a month, the first donation and all subsequent associated donations will be set as the type recurring.", "You can set up your platform to receive donations via SMS. More information on how to set this up can be found", ".", "Within your event > Entries & Fees, you can set the registration fee to be treated as a donation. If this setting is selected, when someone registers and pays to enter, their entry fee will be converted into a donation and appears against their fundraising total.", "If using the Shop module, you can treat shop purchases as a donation which will create a donation record for when that particular product is purchased.", "If enabled on an event or appeal page, Matched Giving will create a donation record to match the original donation in a specified multiplier. E.g. x2. This record is essentially an offline donation as no transaction takes place.", "This is a donation that was received on a Facebook fundraising page.", "If an entrant registers and pays an entry fee and makes a contribution towards platform fees, then this is treated as a donation and categorised as a contribution.", "If you have created a", "for an appeal and the donor follows that PURL and donates, this is categorised as an import donation.", "An offline donation can be one of two things. When an entrant is logged in, within their dashboard they have the option to pay in money that has been donated to them offline. Donations paid for in this way are considered offline.", "An offline donation can also be one that the charity has manually added to the platform. For example, a donor may have transferred $1000 directly to the charity but they want this reflected on their fundraising page, so the charity manually adds it to the platform.", "That’s donation types explained. To set up your donation reports, check out our article on", "."]},
{"title": "Donations: Get Started", "post": ["Donations", "Add donations collected in person or offline, so they can contribute to your campaign total.", "Add matched giving to your campaign to double, or even triple your supporters' donations."]},
{"title": "Integrations: Get Started", "post": ["Integrations", "Sync up to Autopilot to create slicker automations with real-time data."]},
{"title": "Header - Image tips", "post": ["Header - Image tips", "You've set up your header, uploaded your background image, only to find your hero image doesn't look so great as it's cropped out half the image. Don't stress, we've got you covered. Let's discuss some ways to select and create your header background images to get them looking their best.", "If you are new to setting up headers and", "read", ", we would highly recommend it before continuing with this tutorial.", "Getting the perfect image for your header is sometimes a little bit of a challenge.", "The last thing you want is to crop out someone or lose an important message in one of the most important parts of your page.", "Let’s look at our browser resolutions. Resolution size is just the width and height of the screen. Different size monitors will have different resolutions. A large monitor might have a large resolution of 2500 pixels wide whilst smaller screens will be around 1200 pixels wide.", "Most headers are set up to use the full width of the page. The", "generally for a home page header is around 600 pixels high. For a content page header, this might be slightly smaller at around 300 pixels.", "If a users browser is 1200 pixels wide and you've set your page header to 600 pixels high, your header will be displayed in a 1200x600 pixel area. Still with me?", "If the user's browser is larger and 2500 pixels wide and the page header is still set to 600 pixels, your header will be displayed in a 2500x600 pixel area.", "These are 2 quite different sizes and our image needs to work well on both. We need to make sure our image has enough width to work on the 2500 widescreen whilst keeping anything important within the middle 1200 pixels as anything outside this width is at risk of being cut off on smaller screens.", "What makes a good image?", "This actually depends on what content is going in your header. The majority of the time you’ll have some text and possibly buttons within your header. Ideally, you don't want your text and buttons to overlay anything important in your image. This is especially important if you feature people in your image. You don’t want a button or text covering someone's face.", "The best images for headers containing text and buttons will;", ": Background image no text overlay. Here's our image we've uploaded. It's 2500x900 pixels.", "If the header were displayed on a 1024 pixel wide resolution screen. You can see the people on the left and right-hand sides have been cropped out.", "Our header on a 2500 pixel wide resolution screen. You can see now because the browser has more width we can see our missing people.", ": This ticks all the boxes for a great header image. Clear space around our hero couple. Buttons and text in clear space. Easily scalable colours left and right of the couple if we need to extend the image for extreme landscape resolutions.", "Uploaded background image:", "Header at 1400 pixel wide resolution:", "Header at 2500 pixel wide resolution:", ": If you aren’t featuring people (faces or hero shots) and it’s more of a textured background then it’s going to be a lot easier to place your text within the header.", ": The uploaded image contains a logo or graphic.", "Because the logo is part of the image it will scale with the header as seen below. This will always be problematic across different resolutions. Try and avoid having flattened images like this example. Separate the logo and the background into 2 separate images. Upload the separated background image as your header background image and insert the logo into the header content area. This will allow the logo to float on top of the background and be responsive.", "You may not always be able to see what this looks like on a larger screen as you have a smaller monitor but knowing you’ve set the width and height to account for all screens will safeguard your header designs. You can always drop us a support ticket and we can double-check them for you!", "So in summary...", "Try and use", "Try and avoid", "All the same rules apply to mobile. However mobile header resolution is generally more portrait in ratio compared to landscape on desktop and the ratio doesn't vary nearly as much. We suggest creating your headers at approx 1000 pixels wide and 1400 pixels high depending on the look you are after for your header. By default your desktop header will work on mobile. You can however upload custom mobile headers.", "And that’s it. I hope this will help you create those beautiful image headers and remember."]},
{"title": "Creating a page header", "post": ["Creating a page header", "Any content that is important to the page should not be at the top of the header image, as the navigation bar will sit over this area of the header. If you have any important copy at the top of your header add blank padding equal to the navigation bar height. this will bump your header down from the navigation bar giving you more room on the header image."]},
{"title": "Header - Slider Carousels", "post": ["Header - Slider Carousels", "With multiple slides that can be set to rotate automatically, it offers you the chance to display multiple header images, copy and CTAs.", "We've created a step by step guide of how to set this up using Classic Builder.", "Everything can also be done using Visual Builder. Scroll down to the bottom to see some screenshots of how this is set up.", "Click to expand", "Once you've selected Slider as your header type, scroll down to", "where you can adjust various settings that will apply to all the slides you add.", "Once you've chosen your settings, click on", "to add your first header.", "Click to expand", "Click to expand", "Name you slide, and then upload the image to be used.", "Images added should be 2500px wide and 600-1000px in-depth. A guide on header images can be found here", "Don't forget to check if your image works on mobile. If not, you can add a mobile suitable image instead.", "Click to expand", "Below the image upload, the content editor allows you to add any text, buttons or additional graphics you would like to appear in the header.", "You can also apply a mask to the image which may help make your text stand out clearer.", "Click to expand", "The slides added to the desktop will automatically pull through to mobile.", "However, depending on the image, they may be a bit busy, and not work. If needed you can toggle to mobile and add a mobile specific image and copy.", "Click to expand", "Once done, hit", ". Save your sliders and then hit", "to see how they will look.", "If happy with how it look, Publish the page and the updated headers will go live.", "The above outlines how to create slider carousels in Classic Builder, but the same can be done using Visual Builder by editing the header section.", "Click to expand", "Click to expand", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Platform navigation", "post": ["Platform navigation", "Navigation can be added to the platform to apply to your whole site, or updated at event or page level to create a more customised navigation.", "Use options on the navigation menu to direct users to specific pages on the site or use custom navigation to help entrants maneuver through an event or a campaign.", "Navigation on your site can be added at platform level, event level, page level or all three.", "The platform level navigation is the default navigation which will show for every page and event unless overridden.", "The event level navigation, if enabled, is used to customise the nav for a specific event. All content pages and fundraisers pages in that event will adopt that navigation.", "The page-level navigation, if enabled is used to customise the nav for a specific page.", "Default site navigation (that applies to every event unless overridden) is under", "Click to expand", "Click to expand", "Primary nav is where the bulk of your nav options will sit and is often used the most by users. It sits above the header, and you can house all your nav items in the Primary nav if you wish.", "Click to expand", "The secondary nav allows you to place nav items to sit above your Primary nav.", "Click to expand", "The Tertiary nav sits above the Primary and Secondary, and is often used for login options, social icons and search bars.", "Click to expand", "The Sticky nav is used to add navigation options which will be visible at the top of the page when the user scrolls down. These often include items in the Primary nav and Secondary.", "Click to expand", "Click to expand", "You can add to any nav type by scrolling to the bottom and filling in the required information.", "Click to expand", "Once you've added a label and page to link to, simply save the option and it will appear in your list.", "Click to expand", "select Manually Created to manually add Subnav options or select Linked to Pages to show pages assigned to the linked page.", "Once saved, you'll have the option to add in the Subnav items.", "Click to expand", "By default, when setting up your navigation, you'll be adding to desktop. When editing the Primary nav, you'll also want to set up a version for mobile which includes your Primary nav items, but also any further options you're displaying with your Secondary or Tertiary.", "Click to expand", "Click to expand", "You can enable custom navigation for", "and", "to override the default navigation.  You can navigate to the Custom Navigation by navigating to:", "Event > Advanced options > Custom navigation > Enable", "Page > Advanced options > Custom navigation > Enable", "The options available in an events custom navigation are just like the options available at the platform level.", "Click to expand"]},
{"title": "Enabling Google Login", "post": ["Enabling Google Login", "The Funraisin platform has a 2-Factor Authentication (2FA) process with different types that you can choose from. One of which is SSO (Single Sign-On), which allows users to securely authenticate multiple applications and websites by using a single set of credentials like Google login.", "This is implemented to better protect both the user's credentials and the resources the user can access.", "This strengthens access security and protects against phishing and password brute-force attacks, so your login and data are secured.", "an additional layer of security to the authentication process, which requires users to provide two different authentication factors to verify their identity; sometimes also referred to as Two-Step Verification or Dual-Factor Authentication.", "an authentication method that allows users to use one set of login credentials to access several related but independent software applications and websites.", "To use Single Sign-on with Google, you will need to first set up some things within your", ".", "These instructions can also be found at", ".", "Log in to your Google Console (", ") and create a new API Project for your website simply by giving it a name. Once the project has been created click into the Oauth Consent Screen section; this is where you can control the settings around what the end user sees when they go to log in with Google, such as your company name, logo, etc.", "When asked to choose your \"scopes,\" simply choose the first 3 options which are email, profile, and openid. For authorised domain, just add in the domain of your website, excluding any www or sub-domain; e.g., for this site you are on now, we would simply use \"funraisin.co\"", "Once you have gone through all the steps, you can then click into \"Credentials\" from the left nav and then create a new credential, making sure to choose \"OAuth Client ID.\" Then choose \"web application\" and then under \"Authorized JavaScript origins\" add the full url for your site, e.g.,", ".", "After you hit save, you will be presented with a screen giving you a Client ID and a Secret, which you can add to your platform under Platform Setup > General Setup > Platform Settings > scroll down to 2-Factor Admin User Security > select SSO as Authentication Type > enter the SSO credentials > hit Save.", "Click to expand"]},
{"title": "Connecting to Zapier", "post": ["Connecting to Zapier", "Zapier enables automation to pull data out of the platform into a range of your web applications so you can spend less time collecting data and more time working with it.", "You can export fundraiser, event, donation or team data and automatically transfer it into Microsoft Office 365, Google Sheets, Airtable, Jira, Google Drive, Dropbox or over 1500 other apps.", "You can also use it to create Webhooks. A webhook is a way to deliver information to other applications as it happens, meaning you get the data straight away. This means you don't need to run exports or create custom APIs to connect the platform to your application of choice, instead you can follow the quick for step process below!", "In Zapier select make a new zap > search for and select Webhooks as the Trigger App", "Click to expand", "Select", "as the Webhook trigger option > click continue >  copy the Webhook URL provided by Zapier", "Click to expand", "In the Platform navigate to Developer under Tools > Browse Webhooks > click the", "button to create a Webhook", "Click to expand", "Configure your data source by:", "Entering the Webhook Name, Data Source, Action > Select Post as the method > enter the Destination URL provided by Zapier > click Save.", "Once data has triggered the webhook the test in Zapier will pass and you can continue adding your steps, alternatively you can skip the test in Zapier and finalise your Zap.", "Click to expand"]},
{"title": "Single Sign On", "post": ["Single Sign On", "Funraisin supports SSO via auth0.com allowing you to set up SSO with most of the major CRMs such as Azure, Salesforce, MS Dynamics, SharePoint, etc as well as all major Social platforms.", "Therefore you will need to create an account at Auth0.com in order to use SSO with Funraisin.", "Simply jump over to", "and signup for an account, then once enabled you will be able to set up an application to allow the 2 platforms to communicate.", "From within your Auth0 dashboard create a new application and where it asks for a Callback URL enter", "For Application Login URI enter", "Leave all other settings as they are then click save.", "Then go back in to retrieve your Domain, Client ID and Secret which you will need to enter into Funraisin.", "Once you have created your application in Auth0 simply log in to Funraisin and navigate to:", "Platform Setup > General Settings > and scroll down to the section on", ".", "Choose SSO from the authentication dropdown options and then enter your Domain, Client ID and Secret from Auth0 into the fields provided.", "Click to expand", "You have the option to", "r you can enable it within individual admin accounts.", "To do so, navigate to:", "Accounts > Browse users > Edit the user > There will be a toggle to enable", "Now if you log out of Funraisin you should see the \"Use Single Sign On\" option on your platform login screen.", "Click to expand"]},
{"title": "Connecting to Stripe", "post": ["Connecting to Stripe", "Once logged into Stripe, navigate back to your Funrasin platform and log in.", "Back in Stripe, navigate to:", "Developers (top right corner) > API Keys (left-hand navigation)", "You have four keys you need to copy and paste into your Funraisin platform.", "In Funraisin, navigate to:", "Platform Setup > Payment Settings", "site_url/management/platformsetup/general/paymentsettings", "Scroll down to", "Paste in the four keys.", "Once done, click Save.", "Click to expand", "Back in the platform, on the same page, scroll to the top and click", ".", "Once clicked, go into Stripe, and you will receive a popup and will need to click", ".", "Click to expand", "Now you have Stripe connected, you can test by making a small donation on your platform, either on a donation/crowdfunding page or fundraisers page.", "If this is successful, then you are all connected up.", "Make sure you check the test donation is also in Stripe."]},
{"title": "Enabling 2 Factor Authentication", "post": ["Enabling 2 Factor Authentication", "Funraisin naturally takes all steps we can to protect your site’s data, however we ourselves aren’t in control of who is given admin access to your site. To help further protect your platform data we support 2-Factor authentication for all admin users which you can enable at any time via your platform.", "You may have already used some methods of 2-factor authentication on other platforms such as your online banking, but essentially 2FA is just adding in a second layer of protection for logged-in users by asking them to complete a second step before they are able to log in.", "There are many different methods such as the use of", "or", "where users are sent an SMS message when logging in with a unique code to enter. There are also", "that online banks sometimes use where you have to carry a physical device around and enter a unique code that it generates into the logging-in process. And then there are", "such as", "and", ".", "Funraisin support both SMS Tokens (via Twilio) and App Tokens (via Google Authenticator) and this article will show you how you can enable either, firstly Google Authenticator.", "Google Authenticator is an App developed by Google that you can install on your smartphone (iOS and Android) which generates unique codes every 30 seconds. The app is linked to the site or service that you wish to log in to so the generated codes provide you with secure access to that site or service. Unlike SMS or Email based tokens, this method of logging in is incredibly difficult to intercept, making it one of the most secure methods of protecting access to a site.", "The app itself can be downloaded for free from the", "or", ".", "Below shows you how to enable this method of protection for your site.", "To enable Google Authenticator just go into Platform Setup and scroll down until you see the 2-Factor section. Choose “Google Authenticator” from the selection and hit save. This will now force all admin accounts to use this additional method of security when logging in.", "When admins next log in, or log in for the first time, they will be presented with a screen like the example below which contains a field for a unique code and a QR code, plus a link to download the Google Authenticator app.", "After downloading and installing the app, you will be prompted to scan a barcode or enter a code manually. Choose the scan method and scan the QR code displayed on your screen.", "Once the barcode has been scanned you will immediately be shown a screen like the example below where you will see a bunch of numbers below the title “Funraisin”.", "To continue simply enter the numbers displayed into the “code” field above the barcode image.", "If the code is correct you will be logged in as usual, if not you will be asked to try again. Keep in mind that the code generated is only valid for 30 seconds so sometimes you may have to repeat the process depending on how long it takes you to enter the code into the field.", "Once the account QR code has been stored and used once, admin users will no longer get access to the QR code. The next time they log in they will simply be asked to enter the unique code generated by the Google Authenticator app.", "If for some reason you need to reset your Google Authenticator app you will need to ask your site admins to delete your security token against your account so you can repeat the above process.", "Although SMS-based authentication isn’t considered to be as secure as app-based methods, it is still far more secure than not having any kind of 2nd level authentication at all!", "To enable SMS-based authentication simply go into Platform Setup and scroll down until you see the 2-factor authentication section and choose “SMS” from the options. Note that this requires an account with Twilio and needs to be configured within your platform so we can send SMS messages.", "If SMS is enabled, each time your admin users attempt to login to your site they will be sent a unique code via SMS to the mobile number that is listed against their account. They will need to enter this into the “code” field provided to gain access to the admin.", "If for some reason they don’t receive the message you may need to check that their mobile number has been entered into their account correctly, complete with the international country code e.g. +61 404 123 456", "A less secure option of email 2-Factor authentication is also available which works exactly the same as the above SMS-based method, except that the code is emailed to the admin."]},
{"title": "Gmail and Yahoo Email Authentication Changes", "post": ["Gmail and Yahoo Email Authentication Changes", "In an ongoing effort to secure inboxes, both Gmail and Yahoo have recently said that they will be enforcing new protection standards for bulk email senders. Authentication is the biggest email deliverability rule Google and Yahoo seem to emphasize, and for good reason. Email authentication helps ensure that an email sent from your domain is legitimate and not a spoofing attack.", "Both Gmail and Yahoo have outlined specific email authentication requirements that all email senders must have in place otherwise emails will potentially get junked. Gmail have only outlined 2 whereas Yahoo are requiring a 3rd.", "Here are the authentication protocols you need to implement by February 2024:", "The good news is that all Funraisin sites already support SPF and DKIM records for sending emails, those are the DNS records we ask you to set before going live with your site. DMARC however is an additional DNS record that you will want to add in order to cater for Yahoo email addresses and adding a DMARC is very easy to do.", "DMARC is a policy framework intended to prevent phishers, spammers, and other illegitimate actors from forging a sending domain and posing as someone else. This kind of impersonation is known as spoofing.", "So long as a receiving email server supports it, DMARC gives the owner of a sending domain some control over what happens when that server receives a spoofed email — either do nothing", ", block it", ", or send it to spam/junk", ".", "An email passes DMARC if:", "Adding a DMARC record is quite straight forward to do and like SPF and DKIM it is simply an entry that is added via your DNS provider. A good article on how to add a DMARC record can be found at", "but essentially all you need to do is follow the steps below.", "1. Login to wherever you manage your domain name's DNS (e.g. godaddy) and add a new TXT record for your sending domain. To find out your sending domain simplly login to Funraisin and navigate to Platform Setup > General Setup > Email and SMS Settings and take note of the field labelled \"Email from address\".", "Your From address will most likely be from the same domain as your platform uses but not always and it will generally use the format of", "so it's the yourdomain.com that you want to login and add a DNS entry to.", "2. Add a new TXT record with a name of", "or whatever the domain is after the @ in your FROM email address.", "For the Value field you will want to choose an option for your DMARC policy but at a minimum you can just paste in v=DMARC1; p=none;", "3. Publish the change and you are done."]},
{"title": "Admin Alerts", "post": ["Admin Alerts", "Offline Events:", "Platform Setup > Triggers > New Trigger / Edit existing trigger", "Events > Event (Edit) > Advanced Options > New Trigger / Edit existing trigger"]},
{"title": "Visual Builder - Background Images, Colours & Videos", "post": ["Visual Builder - Background Images, Colours & Videos", "Applying a Background Image, Colour or Video to a Section or Header Section on your site can make your pages more appealing and capture fundraisers' attention.", "Change your site's look and feel by applying a background colour, image or video. You can upload your own imagery, use stock photos/videos from free sources like", "or", ", or purchase professional imagery from", "You can apply a Background Colour in a Section, Column or individual Blocks. Applying a colour is easy. To apply a Background Colour within the Visual Builder:", "You can apply your brands hex colour or use the colour picker to find a colour you would like to apply.", "You can upload an image in your site's Header Section or in the background behind content. To add an image to the background within the Visual Builder:", "You can use any image already saved in the media library or upload a new image to the media library. To upload a new image:", "You can also apply a video as a background on your site pages. The video in the section background will autoplay and repeat, it won't display video controllers. This makes video graphics in your header look great and creates movement instead of using still graphics.", "To add a video as a background within a header section or content section:", "Video only applies to the desktop background. We recommend using a fallback image for desktop and mobile and applying it to the Image Background field.", "You can also apply to the Background Video:", "Videos for backgrounds should be an mp4, no bigger than 40MB, trimmed to no more than 30 seconds for best performance and 16:9 in ratio."]},
{"title": "e-Commerce and Event Tracking", "post": ["e-Commerce and Event Tracking", "In addition to having advanced tracking capabilities via our own", ", each Funraisin powered site supports the ability to send through event and e-commerce data to platforms like Google Analytics and Facebook without requiring the need for developers to add bespoke code to individual pages. Currently we support the following e-commerce tracking methods:", "It is also possible to implement custom tracking on most of your site’s pages however this article only covers our standard tracking feature.", "Pixel and Event Based Tracking", "This covers Google Analytics, Google Tag Manager, GA4 and Facebook Pixel.", "Before we can send data to your other platforms you will need to upload your tracking tags to your platform. These can be uploaded via", "as the illustration below shows. Simply select which tracking tags you wish to add and paste in the code provided by each platform.", "You can also add in other custom tracking tags using the “other tracking code” option and specifying where on the page you wish for the code to appear, e.g.,etc.", "For Google tracking we support GA, GTAG, GA4 and GTM tags, so in order for us to send through the correct data you will need to tell us which method to use. Note that as of April 2017 Google will provide you with GTAG tracking tags by default however we do support the older GA tracking.", "If you aren’t sure which method is best for your site please feel free to ask us for assistance.", "Defining your tracking method can be done from", "as shown below.", "Once your tracking tags have been added to your site we will start to send through the following e-commerce and event data to the tracking method chosen for Google and to the Facebook Pixel. This data will be sent if the tag has been set up in", "Sponsored donations are ones made from someone’s fundraising page.", "Non-Sponsored donations are donations made to a generic donation / crowdfunding page.", "On the registration completion lightbox:", "In addition to the event and e-commerce data that we send through, you can also setup your own funnels and goals for various activity types on your site. The urls for each “journey” can be found within your platform when editing events, however below is a list of confirmation page urls that can be used.", "https://yoursite.com/fundraiser/", "https://yoursite.com/sponsor/processpayment", "https://yoursite.com/sponsor/confirmation/ (Pseudo pageview)", "https://yoursite.com/", "https://yoursite.com/processdonation", "https://yoursite.com/processdonation/confirmation/ or", "custom url", "https://yoursite.com/register//", "https://yoursite.com/register/fundraising/", "https://yoursite.com/register/merchandise/", "https://yoursite.com/register/teamdetails/", "https://yoursite.com/register/entries/", "https://yoursite.com/register/waves/", "https://yoursite.com/register/pay/", "https://yoursite.com/register/eventconfirmation// or", "custom url", "https://yoursite.com/event/register/ or", "https://yoursite.com/event/tickets/ or", "https://yoursite.com/event/rsvp/", "In addition to supporting Facebook pixel and  Facebook events you can also choose to use the Conversions API which is a slightly more robust method of tracking events since as of June 2021 Facebook pixel events won't be fully supported on all IOS devices.", "When we say IOS devices what that really means though is that for some users that might be interacting with your website via the built in Facebook App on their iPhone, you might not be able to accurately track conversions e.g. CompleteRegistrations etc so using the conversions API is a way to get around this."]},
{"title": "Tracking & Analytics: Get Started", "post": ["Tracking & Analytics"]},
{"title": "Security Health Check", "post": ["Security Health Check", "The Funraisin platform has several measures designed to help you keep your supporters' data safe. Here's a few that your team can action if not in place already by your organisation.", "Email addresses and passwords can be compromised so we recommend you enable this feature within your Funraisin site and have all your team use 2FA to login.", "Reducing access can help keep threats at bay. Funraisin allows you to manage access and security for your admin users by giving your team an all-access pass as an admin user, or giving them access to specific modules they need for their role.", "Do you have a process for regularly checking on access to your site? If not, we recommend checking the Data Exports log for suspicious activity monthly.", "Go to:", "(middle white nav)", "When it comes to data security there is no substitute for a robust process that is routinely carried out. We recommend that at a minimum you regularly carry out checks on your entrant and donation data and user access for suspicious activity.", "The most common perpetrators of data breaches are ex-employees - so it's important to make sure you have some general housekeeping in place for admin users to protect your data and reputation.", "For further information on cyber security you can access"]},
{"title": "Admin user types and access", "post": ["Admin user types and access", "An", "is assigned to every admin on your platform and determines their access rights.", "Your team leader who will be setting up team members on the platform.", "Create unlimited admin user types to control who has access to what on your Funraisin platform.", "Ensure admins users only have access to content and data relevant to them.", "A customised selection of modules that a user can access on the platform.", "A team member who has access to manage your Funraisin platform.", "An admin user who has full access to all modules to manage on your platform.", "We recommend creating different user types to ensure admins only have access to the information that is relevant to them and that they will be using. For example, a member of the Finance team may only need access to Data Exports, Donations and Payments. By limiting admins access to what’s required, it helps mitigate any errors being made with your data, events and content."]},
{"title": "Visual Builder - Adjusting widths of Sections and Columns", "post": ["Visual Builder - Adjusting widths of Sections and Columns", "You can adjust the width of Sections and Columns easily using Visual Builder. By default your site's pages are set to a max width of 1200px. We've set this to 1200px to accomodate the smallest desktop screen devices.", "Columns sit within your Section and are made up of percentages to equal the max width of a Section. You can create multiple layouts using Column Widths.", "When adding a new Section to a page you can choose to add a Section with pre-defined Column Layouts. If you want to adjust and change a width of a Column:", "Full page stretches the section to be wider then the platform default width. This will make Columns and Blocks within the Section stretch to the edges of a device's screen.", "Custom Width let's you overide the platform default for that Section. You can restrict the max width to be smaller or make the particular section a little wider then the default. This will restrict the Column or multiple Columns within the Section to equal that new custom width.", "You can set a Section to stretch larger then the default platform width or apply a custom width to shrink Sections down.", "To change the width of a Section:", "The widths of Columns are set to a percentage to equal 100% of the Section width. E.g Setting 4 Columns to 25% will make them align in a row within the Section.", "You can also manage multiple Columns in a single Section by editing them within the Section sidebar settings. To edit multiple Columns:", "You can also add additional Columns to the Section by clicking the 'Add Column' button.", "If you'd like further help please pop in a support ticket from your Funraisin admin and our team will assist you."]},
{"title": "Introduction to your new Funraisin site", "post": ["Welcome to Funraisin, it's great to have you with us!", "Welcome to your Funraisin platform! We're so excited to have you on board, and see what you'll create. We've created two videos to help you login to your platform and begin navigating around.", "The Knowledge Base is packed full of helpful Support articles, but if your questions is not answered, then follow the link below for instructions on how to lodge a support ticket."]},
{"title": "Global Tracking Codes", "post": ["Global Tracking Codes", "Within Platform Setup –> Tracking & Analytics –> Global Tracking Codes you’re able to add your tracking code from any number of sources.", "By default, Funraisin has areas for you to add in your tracking codes for:", "In addition to these options, you’re able to add in other tracking code into the Other section.", "To be used if Google Tag Manager isn't being used - we have instructions if you are using Google Tag Manager (", ").", "Expand the Google Analytics option and paste in the code into the area highlighted and select Save. Data typically takes 12-24 hours to begin showing in your Google Analytics dashboard.", "Expand the Google Tag Manager option and paste in the code and select Save. We have an article on how to set up Google Tag Manager (", "). Data typically takes 12-24 hours to begin showing in your Google Analytics dashboard.", "To insert your Facebook Pixel tracking site-wide, you’ll first have to log in to your Facebook Ads Manager account and create your pixel. Here’s the", "from Facebook.", "When done, open the Facebook Pixel option and paste in the code.", "If you’re conducting marketing automation and using Autopilot, we have a dedicated tracking tab for you to use. To find your website tracking code within Autopilot", ".", "Expand the Autopilot option and paste in the snippet taken from your Autopilot account, and select Save. You’ll now be able to watch how visitors go from", ".", "If you’re using any other bespoke tools that you would like site-wide data sent to, use the Other Tracking Options tab and paste your code in there. You have the option of having your code appear within the Header tag, after the opening Body tag or in the footer. If in doubt, we’d suggest using the ‘after the opening body’ tag.", "If you’re using e-commerce tracking, we have a few methods to choose from: Google Analytics, Google Tag Manager and GTag.", "By default, Tag Manager uses the data layer method, which pushes the e-commerce data onto the data layer code of your site. If your organisation would prefer to use the Google Tag Manager Custom JavaScript method, please submit a support ticket from within your admin and we’ll get this set up for you.", "You can insert page specific tracking code in Pages module –> [the page you want to track] –> Advanced Options –> Tracking Code."]},
{"title": "Adding a New Admin", "post": ["Adding a New Admin", "An", "is someone who has access to your Funraisin platform admin. Depending on their access rights, they can manage your entrants, events and donations.", "Your team leader who will be setting up team members on the platform.", "A customised selection of modules that a user can access on the platform.", "A team member who has access to manage your Funraisin platform.", "An admin user who has full access to all modules to manage on your platform.", "To add a new admin to your platform, head to the", "module.", "Here you’ll see a list of all the admins that have been set up. Click the", "blue button to begin entering the details of your new site admin.", "Click to expand", "You'll land on the settings tab where you can enter the name and email address of your new admin.", "To give full access to all modules within your platform, make sure the", "dropdown is set to Administrator. More information on managing administrator access and user types can be found", ".", "Change the Results per page to 35 so your new admin will see 35 records per table listing – that's a recommended number of records to be displayed.", "Then below, set their password. When they first log in they'll be prompted to update this.", "Click to expand", "By default, when you add a new user, their admin user type will be set to Administrator which grants access to all modules on your platform. If you’d like your new admin to only have access to certain modules, then you can select their user type from the right-hand dropdown.", "Admin user types allow you to create customised access rights depending on your team members' needs, limiting the number of modules they can access and edit.", "We have a support article on how to create custom admin user types", ".", "Make sure to allow 'Publish Pages' and 'Access to Support' so that the user can save their changes and contact us through the support system within the platform."]},
{"title": "Login and get support", "post": ["Login: Your Funraisin journey begins here...", "By now you should have the link to your site's admin to log in.", "eg:", "You should have been sent your login details by a member of the Funraisin team, or a member of your team. Admins can add new users within the Accounts mode, which is explained in this", ".", "When visiting the site's admin you will be presented with just the email address field. Enter your email address and select next in order to bring up the password field.", "Click to expand", "Take a look around the Funraisin Knowledge base to start your journey. There are videos, how-to articles, and much more!", "We have an awesome Support team on hand during the week to answer your questions or give you a helping hand. If you cannot find the answer to your question in the Knowledge base, then you can pop a Support ticket in. This can be done whilst logged into your platform and navigating to", "in the top right hand corner.", "Choose the option", "Click to expand", "When you create a support ticket you can select the area you need help with, add in a subject line, and then ask your question.", "Please include links to the entrant or donor record, or content page you are enquiring about.", "The more descriptive you can be, the better, as it helps our support crew answer your question in the shortest timeframe.", "The team should respond in a few hours, and the response will come directly to your email.", "Click to expand", "We hope you enjoy using your new Funraisin platform!"]},
{"title": "Social Sharing Copy and Images", "post": ["Social Sharing Copy and Images", "Set up custom social share copy and images for when your entrants and donors share your campaign pages, or fundraising pages, to ensure the key messages are highlighted.", "Copy can be added at platform level to apply to all pages and fundraising pages, but can then be overridden and customised further at event level or page level.", "Social copy related to fundraising can be customised at various levels:", "It’s always best to add default social sharing copy and images at platform level. This will be the default copy and imagery which is shared across social channels by your users if you haven’t added any on an event. If you’re using Funraisin for a single flagship event, then it is only necessary to customise the social copy on a platform level (as the event will default to use platform level content).", "Navigate to:", "Platform Setup > General Setup > Social Settings", "Here you an update the Default Social Sharing, which is what will be used when a supporter shares a page from the platform. E.g. pasting the homepage URL on Facebook.", "Further down the page you can update Individual, Team and Organisation social share, which is the copy that will pre-populate when a supporter goes to share a fundraising page.", "You'll see options to customise copy for the below social apps.", "Each option also has a tick box to disable the option from appearing, with the exception of WhatsApp which has a tickbox to enable it.", "Note that teams and organisations will have an additional option for the Team invite email, which can be sent by Team/Org captains from their logged in dashboard.", "Enter the share copy, an optional title (this will default to the members first name last name if you don’t enter anything in the title field) and an optional image. Don’t enter a URL to the member or teams page as Facebook will automatically pick this up from the share. We default the URL Facebook picks up to use our Funraisin’s short URL tracking specific to Facebook.", "Click to Expand", "Enter the share copy for Twitter. Note that Twitter has a 280 character limit to copy (this includes the URL being shared – so work to about 240 characters if possible). And just like Facebook, don’t enter a URL as Twitter will automatically pick this up from the share. We default the URL Twitter picks up to use our Funraisin’s short URL tracking specific to Twitter.", "Click to Expand", "Enter the share copy for SMS.  Members who are logged in on their mobiles will see an SMS share icon on their dashboard – this generates a new SMS containing the copy you enter here. This personalisation tag if you'd like tracking is", ".", "SMS is such a personal medium and we see great conversion rates to donations from SMS shares, so try and be as personal as possible with your copy (and that’s where the personalisation tags become handy).", "Click to Expand", "Email sharing allows you to enter a subject line and body copy which will be used when shared via email. The personalisation tag to use for emails if you’d like tracking to conversion is", ".", "Click to Expand", "Enter the share copy for LinkedIn. We default the URL LinkedIn picks up to use our Funraisin’s short URL tracking specific to LinkedIn.", "Click to Expand", "Enable sharing on Whatsapp then enter the share copy for Whatsapp.", "Members who are logged in on their mobiles will see a Whatsapp share icon on their dashboard. We default the URL Whatsapp picks up to use our Funraisin’s short URL tracking specific to Whatsapp.", "Click to Expand", "The Team Invite is sent by team captains from their login area to invite people to join their team. Enter the subject line and body copy which will be used when shared by captains. The personalisation tag to use for the team invite email is .", "Click to Expand", "Event Level share copy will override what's setup at platform level. This means you can customise the social copy specific to your events.", "For example, simple things such as including the event name, copy relating to what the funds raised for that specific event will go to, and much more. Be as creative and relevant as you can.", "The copy will be editable if the specific app is enabled at platform level. Whatsapp is disabled by default.", "Navigate to:", "Events > Edit the event > Social sharing > Individals/Teams/Organisations (tabs)", "This module also lets you add", "copy which will be used if an event page URL is pasted to be shared. This will override what you'd set at platform level.", "Click to Expand", "Theme share copy will override what's setup at platform level. This means you can customise the social copy specific to your theme.", "Navigate to:", "DIY Fundraising > Edit the theme > Theme Settings > Fundraising Page (tab along the top) > Social Sharing (tab)", "Click to Expand", "We'd suggest setting up share copy at platform level which will apply to all pages. This can then be updated for specific pages if needed.", "Navigate to:", "Platform Setup > Social Sharing > Default Social Sharing", "Add copy and image to be used globally across your site.", "Page-level social sharing copy only relates to the copy which social channels will use when a user copies and pastes a specific page URL into, for example, Facebook. This will be the copy that Facebook scrapes and displays on the share.", "Page level social copy can be edited using both Classic Builder and Visual Builder.", "If using", ", edit the page you want to update, and head to Social Sharing within the white middle navigation.", "If using", ", open the page in Visual Builder and click on the screw icon in the top menu. This will open Page Settings to the right, and one of the options will be Social Sharing.", "Here’s an example from our friends at", ".", "Click to Expand", "And that's it. You’re up and running with customised social sharing copy specific to your events and pages!", "If you’d like further help please pop in a support ticket from your Funraisin admin and our team will assist you."]},
{"title": "Activating Gamification Badges", "post": ["Activating Gamification Badges", "Gamification badges can be triggered manually through the admin for team and individual fundraising pages.", "You can manually trigger badges for entrants who may have achieved the badge using a different route. E.g. an entrant may have copy and pasted their fundraising page URL to share on Facebook, which will not trigger the badge automatically.", "Navigate to the entrants dashboard in admin.", "Click to expand", "Select", "from the left navigation.", "Click to expand", "Navigate to the", ":", "Select the relevant activity to be triggered > select the event the badge is to be activated for > then click add.", "Click to expand", "The same process can be actioned for Team pages by navigating and editing the team profile in the admin.", "Once done, the relevant gamification badge will light up on the individual or team fundraising page."]},
{"title": "Adding Gamification Badges", "post": ["Adding Gamification Badges", "Gamification badges are customised icons/badges that are triggered by milestones or achievements that are reached by teams or individuals and appear on fundraising pages.", "Gamification on fundraising pages can help facilitate healthy fundraising and act as an incentive for teams and individuals", "The use of gamification badges can be enabled on both individual and team fundraising pages. To enable gamification go to:", "Platform Setup > Fundraising Options > select either Individuals or Teams > scroll down to the Gamification tab.", "Tick the checkbox to enable gamification, rename the section if you wish and define the layout. The default number is 6 for desktop and 2 for mobile.", "Click to expand", "Badges can be added at Platform level, Event level and within a DIY theme.", "Navigate to:", "Platform Setup > Fundraising options >  Individuals > Add New Badge", "If you'd like to add for a team page, toggle to the", "tab.", "Click to expand", "Clicking on the", "button will load up a screen like below where you can define your reward settings with the following options.", "Click to expand", "Just for your own reference", "Choose from displaying the badge on an Individual or Team fundraising page", "This is what we are actually rewarding on e.g. Reached a certain amount, created a team, etc.", "Some actions support a value e.g. $100 for having raised a certain amount or reaching 4 team members", "Upload an image that appears when the above criteria haven't yet been met", "Upload an image when the reward has been given", "An optional link for logged in users if they click on the badge it can take them to a specific page. Used for showing them how to actually obtain the badge.", "The optional message that sits below the image", "You can optionally assign the badge to either an event or a DIY theme.", "Click", "and your badge will be created, allowing you to create another. You can have as many badges as you like though we'd suggest keeping them to a minimum for display purposes, especially on mobile devices.", "To add badges to a specific event go to:", "Event >  Advanced Options > Gamification.", "Click to epxand", "Navigate to DIY Fundraising > edit the theme > Advanced Options > Gamification.", "Click to expand", "Once your badges have been created and enabled your fundraising pages should look something similar to the example below.", "Click to expand", "Having gamification badges on fundraising pages are a great way to promote healthy fundraising, however, you might also want to consider matching up your reward badges with", "so you can let the fundraiser know when they have earned a badge."]},
{"title": "Automated Emails", "post": ["Automated Emails", "Below we have listed out the emails found in Automated emails, and also when expanded, the default copy. This copy is our suggestion, but you can update to whatever sounds most appropriate for your charity.", "The emails are split into:", "These emails are related to event registrations, which include registering for a team, organisation, DIY events or as individuals", "{member_firstname}, your first step is complete", "Hi {member_firstname},", "Welcome! Your registration is nearly complete. This email contains your username and password. When you complete your registration you will receive a registration receipt and final instructions.", "Here's your username (email address) and password to access the login area of the website:", "URL: {siteurl}login", "Email: {member_email}", "Password: {member_password}", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Come and join your team", "Hi {member_firstname},", "I've registered us for {event_name} and now it's time for you to come and complete your personal fundraising page.", "{member_invite_url}", "I'd love it if you could do two quick things to become an awesome fundraiser for {event_company_name}!", "1. Add a photo and update your story to share why you're taking part in {event_name}. This shows our potential donors how serious we are about fundraising and why we're wanting to make a difference.", "2. Get sharing: After you have sponsored yourself and set up your page it's time to start fundraising. Share your page on Facebook and email everyone you know to ask them for their support.", "I'm looking forward to doing the {event_name} with you!", "Thanks", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Looking good {team_name}", "Dear {member_firstname},", "Your team, {team_url}, has been successfully created.", "[Describe what you would like the team captain to do next]", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Your team has a new member", "Good news! A new member, has joined your team, {team_name}. Log in to see who it is.", "As team captain don't forget to check that they have finished setting up their fundraising page and ask them to share your team page on their Facebook to kickstart your fundraising.", "Make sure all of your team has sponsored themselves. It sets a great example for sponsors and shows how much your team cares.", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "{member_firstname}, you’re in!", "Hi {member_firstname},", "Congratulations on registering for {event_name}.", "A unique fundraising page has been created for you here: {member_url} and we would love it if you could take the two simple steps below to become an awesome fundraiser!", "We’ll be in touch in the coming weeks with exciting updates on what you can expect from {event_name}!", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "{member_firstname}, you did it. Whats next?", "Dear {member_firstname},", "Thank you for joining the growing community - you're now a part of {team_name}.", "A unique fundraising page has been created for you at:", "{member_url}", "You can check out your team page here:", "{team_url}", "Please log in to sponsor yourself (By doing this you set a great example to others), customise your fundraising page and ensure your profile is updated.", "Regards,", "- No default copy -", "{member_firstname}, your ticket purchase has been completed.", "Dear {member_firstname},", "Your ticket purchase has been successful. Please find attached a receipt for your additional purchases.", "Regards,", "These emails are related to donations made to a fundraisers page, team page, donation or crowdfunding page.", "Your", "donor login", "Dear {d_fname},", "This is an automated email containing your link to log in to see your donation history. If you did not request this link please contact us", "and let us know.", "Your past donations and tax receipt(s) can be found here. Alternatively, you can copy and paste the link below into your web browser:", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Great job! You've received a donation.", "Hi {member_firstname},", "of {sponsor_amount} from {sponsor_name}. Nicely done.", "Jump on Facebook and tag them in a thank you post to show them how much you appreciate it!", "It makes your sponsors feel appreciated and shows them how much their donation means to you. You can also view your donations and thank your awesome sponsors via email on your fundraising page by logging in:", "Name: {sponsor_name}", "Email: {sponsor_email}", "For a complete list of your sponsors, check out your fundraising web page here {member_url}", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "{member_firstname}, your team has received a donation", "Hi {member_firstname},", "Your Team has received a new donation!", "Brilliant work. Your team has received a donation of {sponsor_amount} from {sponsor_name}.", "You can view your donations and thank your awesome sponsors by logging into {siteurl}login .", "For a complete list of your sponsors, check out your fundraising web page.", "Alternatively you can copy and paste the link below into your web browser:", "Name: {sponsor_name}", "Email: {sponsor_email}", "Cheers,", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Your personal donation receipt", "Hi {member_firstname},", "Great work on making a personal donation.", "Your involvement and fundraising for us enables us to", "Please find attached your tax receipt for your records.", "Thank you again!", "Cheers,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "{d_fname}, thank you for your kind donation", "Dear {d_fname},", "Thanks so much for your donation.", "Your generous donation will help", "A receipt for your donation is attached to this email.", "Thank you again,", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "- No default copy -", "Thank you for your donation", "Dear {d_fname},", "Thanks so much for latest donation! You are ensuring we're able to continue our work in", "A receipt for your donation is attached to this email.", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Your tax-deductible donation receipt", "Dear {d_fname}", "Thanks so much for supporting {donated_to_name}!", "A receipt for your donation is attached to this email.", "Thank you again,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "Dear {sponsor_name_actual}", "Please find the below remittance details for making payment for your donation.", "Thank you again,", "- No default copy -", "These emails are related to registrations for offline or DIY events.", "- No default copy -", "{member_firstname}, your first step is complete", "Welcome to the {event_company} website! Your registration is nearly complete. This email contains your username and password. When you complete your registration you will receive a registration receipt and final instructions.", "Logging in", "Here's your username (email address) and password to access the login area of the {event_company} event website:", "{siteurl}login", "{member_email}", "{member_password}", "Regards,", "Please do not reply as this address is not monitored. This is an automated message as you have provided your email address to {event_company} ({event_company_abn}) {event_company_address}", "DIY Fundraising > Advanced Options > Config", "- No default copy -", "- No default copy -"]},
{"title": "Fundraising dashboards", "post": ["Fundraising dashboards", "The dashboard is the logged-in area of your fundraising pages that your fundraisers, team captains and organisation captains can access. From the dashboard, fundraisers can update their details, manage donations, log their fitness and more.", "Events where you'd like to provide more information or assets for fundraisers to interact with, but behind a logged-in area.", "Below is an example of how the dashboard looks, with the individual pages defined along the top. Home, Get Support, My Donations and Edit my Page are default, but more pages can be added for a more personalised experience.", "Click to Expand", "Click to expand", "Click to Expand", "These are the pages that require the fundraiser to be logged in to see and are accessible from the fundraiser's", ". These will be set to a certain login type (Member or Team), these determine if they appear in the individual's dashboard or the team dashboard respectively.", "Click to Expand", "Click to Expand", "To view a non-public page/dashbaord page you will need to log in as an entrant. Head to any fundraisers account currently active in your event and click the", "button.", "Click to Expand", "Now logged in, you can view the pages accessible via the dashboard. In order for a non-public page to appear in the dashboard, it has to have a navigation setting enabled,", ". Edit the page and navigate to:", "Settings (tab along the top) > Navigation & Display Options (second section in the page) > Tick", "> Save > Publish.", "If the page does not appear within the dashboard, then you can still view it before making it available in the dashboard.", "Click to Expand", "Click to Expand", "Click to expand", "Click to Expand", "When you create a new page, you will need to define the below settings -", "Set to live", "Give your new page a name", "Set a URL for this page", ": Non-Public Page (login area only)", "Choose whether it appears for individuals, teams or organisations", "Scroll down to the navigation section and ensure you tick:", "Yes, display on Sub-nav", "Click to Expand", "Click to Expand", "Click to Expand", "You should be able to log in as an entrant and view the page on a URL like {site url}/login/view/{page url}", "Click to Expand"]},
{"title": "Creating a raffle", "post": ["Creating a raffle", "A raffle is a great way to raise additional funds for your cause and can often be combined with a gala or other big event.", "Running a raffle ticket on your platform is simple to set up but gives you advanced editing control.", "This article will cover:", "Below is an example raffle page.", "Click to expand", "Navigate to your Raffles module in the left-hand black navigation. Here, you'll see all your live raffles, and have the option to create a new raffle.", "Click to expand", "Once you've hit", ", you'll be taken to a page to define all your settings.", "Define the name of your raffle, URL and unique code for reporting.", "Click to expand", "Update the settings for how the raffle will be described on the tax receipt. You can also define the prefix for the PO number created.", "If you'd like your raffle to close at a specific time and date, this can be defined, along with a message that will appear once closed.", "Within", "on the left-hand navigation, you can create ticket packages. This offers you the chance to create ticket packages which can be more appealing than buying individual tickets.", "Click to expand", "Just like any other content page, you're in full control of how it looks. Add in content blocks and images, choose your header, and define the details you capture about the purchaser under", ".", "Don't forget, if you're planning on contacting the entrants in the future, add in marketing consent.", "Click to expand", "Once a purchaser has bought their tickets, you can define the confirmation copy or choose whether they are redirected to a new page.", "You'll also need to populate the confirmation email that is sent out. Attached to the email will be their tax receipt and tickets.", "Click to expand", "You can see a list of all the individual purchases for your raffle within the", "area.", "When in your main Raffles dashboard, /management/raffles, you can also download two reports.", "Select the raffle you want and then choose:", "Within your", "module, you can also create more customised Raffle reports. Choose Raffles as your data source and then populate with the required fields. More information on creating reports can be found", ".", "Click to expand", "The raffle draw will need to take place off your platform. This could either be a physical draw or an online raffle draw provider.", "Every state and country has its own rules around raffle draws so it's important you check your local rules before running your draw and selecting your winners. Funraisin cannot provide advice on the regulations governing raffles.", "Within General Setup you can add in a time and date for the raffle to automatically close.", "Alternatively, you can simply set to raffle to closed to step any further sales.", "Click to expand", "Once your raffle is all set up, ensure you run some test purchases so you can test the user flow from start to finish. This will give you the opportunity to view the confirmation page, confirmation email and the tickets received."]},
{"title": "Merchandise, Raffles & Shop: Get Started", "post": ["Merchandise, Raffles & Shop", "Discover how to create exchange fundraising options with", ". Learn more about the key features and benefits and see it in action from the Funraisin community.", "Learn how to create a shop, sell merchandise and manage sales."]},
{"title": "Setting Up Triggered Emails and SMS", "post": ["Setting Up Triggered Emails and SMS", "Funraisin comes with the ability to send out simple triggered messages based on things like amounts raised or distances logged. You can create as many triggers as you like and they are a great way to reward your fundraisers for getting to various stages of their fundraising.", "This article will show you how to set up a few of the more commonly used triggers.", "Currently, there are 2 types of triggers which are Email or SMS.", "If you want to use SMS triggers you will need to create an account with Twilio or Burst SMS (", "). Costs are pretty small. For messages to Australian numbers via Twilio, it’s currently around 6 cents per message.", "Several different actions can set off a trigger. These include:", "Navigate to Funraisin > Platform Setup > Triggers", "or if you are wanting to add them to a specific event or theme then just edit the event or theme and choose \"Advanced Options > Triggers\" from the left navigation.", "If you click on the \"+ New Trigger\" button in the Platform Setup > Triggers then you will see a screen like the one below.", "As you create triggers they will be listed letting you know what triggers you have set up and how many emails have been sent.", "Give your trigger a meaningful name so you know what it is and choose whether you want to send an Email or SMS.", "In the below screenshot we have the configuration for a common trigger which is for when a fundraiser raises over a certain amount. In the trigger value field put in the amount, you want this trigger to check for. In this case, 50% of the fundraising target (note that we did not include the unit of measurement [$, KM, % etc.] in the trigger value).", "The next step is to add in the message that you want the fundraiser to receive. Since we have chosen an Email as the trigger type, we are asked to enter in an email subject line and our email body content. We can also choose to use one of your HTML email templates.", "You can add in any personalisation into both the subject field and body copy field and a list of personalisation codes is displayed to the right in case you are new to them.", "And that’s it! You’ve just created your first email trigger. Now as soon as any fundraiser taking part in this event hits 50% of their fundraising target or more, they will receive a message of thanks!"]},
{"title": "Convert a registration fee to a donation (for event cancellations)", "post": ["Convert a registration fee to a donation (for event cancellations)", "For both entrant and the charity in case of an event cancellation.", "Convert the registration fee to a donation. A new donation record will get created with the same amount as the registration fee.", "Increase the total donation amount.", "A payment made by an entrant when registering for an event. It is also known as entry fee.", "If an event that contains an entry fee is ever cancelled, the entry fee can be converted into a donation, which is as easy as ticking a single checkbox. First off go to the entrant record in question by searching for their email address or name in the main search bar on the platform and selecting the", "icon next to their name. From here select", "from the middle white menu, select the", "icon next to the event with the entry fee and then select the", "tab from the menu on the left-hand side.", "Click to expand", "Here you will see the payment information related to the entrant during registration. In the main window next to the", "field, select the", "checkbox. This should bring up a prompt describing what this action will do, select", ". You will now notice that under the Convert to Donation checkbox that the", "is automatically selected, untick this box if you do not wish to send the entrant a Donation Receipt, then select the", "button.", "Please allow 15 minutes for the donation amount to appear on the fundraiser's page on the front end."]},
{"title": "Fitness - 101", "post": ["Fitness - 101", "Many events and challenges are fitness-based, allowing participants to either connect up their fitness apps or manually enter fitness themselves.", "This article runs through all things fitness, including", "We also have another", "on how to assist your supporters with connecting to their Fitbit, Strava, MapMyFitness or Garmin.", "Not all participants will have a fitness app to connect to their fundraising page, so instead they can manually add fitness.", "From with their logged in dashboard, there will be a My Fitness Activity Tab. On this page, participants can connect up their fitness apps, or manually add activities. They simply need to fill in the details within", "and then save. Their added activities will appear above listed out with the details they’ve inputted.", "Click to expand", "If the entrant has made a mistake on the activity they’ve added, they can either use the bin icon to", "it, or use the pen and pad icon to", "it and then save.", "Admin users also have the ability to add and amend activity. Find the entrant on the platform by searching their email address and then edit their member record. On the left hand side is", ".", "This screen will list out their current activity.", "If you need to add an activity for them, you can select the", "tab. This will allow you to manually input activity and save. Important to note, when adding in distance, this is in metres. E.g", "1km = 1000m", "1miles = 1609m", "You can amend an activity by selecting the pen and pad icon next to the activity.", "You can also delete an activity by selecting the checkbox next to it and then hitting", ".", "Click to expand", "When an entrant has connected up their fitness app, each day, the platform will sync to find any activities from the previous 24 hours. Once an activity has synced over, the entrant does not have the option to delete this.", "An admin, however, can remove a synced activity, by following the same steps as removing a manually added activity. Navigate to:", "Entrants' member record > Fitness Activity > Select the activity > Remove Selected", "Click to expand", "When an entrant connects their fitness app to their fundraising profile, the platform syncs once a day and pulls over that information. There is the option within an event to limit the activity that is synced over, so for example, for a running challenge, your entrant's bike rides do not also sync over. To implement this, navigate to:", "You event > Fundraising Options > Fitness Settings", "Click to expand", "On this screen you can add key words that you want to include. Walk would include walk and walking, run would include running etc.", "How it filters activity is different depending on the app.", "Strava sends over the activity type which is what is used for this filtering. When an entrant starts an activity on Strava they have to choose the activity type, and this appears at the top of the screen when they begin their activity.", "Click to expand", "Click to expand", "For these apps, it is looking for the name of the activity, which usually defaults to include the word run, walk or ride depending on the activity chosen by the entrant.", "If your entrants", "log an activity but clock up 10,000 steps during the day, these cumulative steps will sync over at the end of the day regardless of the filters applied.", "For Garmin, it is looking for the name of the activity, which usually defaults to include words such as RUNNING, WALKING or CYCLING depending on the activity chosen by the entrant.", "You can find a more extensive list of Garmin activities", ".", "If you are using the District app for your event, then once an entrant has registered, they can download the app from the App store and login using the details they used to register.", "The app allows entrants to log their fitness which will sync over to their fundraising page within an hour.", "Click to expand", "If you’d like further help please pop in a support ticket from your Funraisin admin and our team will assist you."]},
{"title": "What are Organisations?", "post": ["What are Organisations?", "All platforms have the ability to accommodate organisations within Online events. If enabled on an event, they will sit one level above Teams in the hierarchy, so multiple teams can be grouped together. If enabled, organisations can be created within the registration flow or via the logged in dashboard by entrants. Alternatively, they can be manually created by admins.", "This article will cover what an organisation is, but we have further support articles on:", "a super-team that can be created that consists of both individuals and teams for a given event.", "a group that can be created that consists of individuals for a given event.", "Organisations in the Funraisin platform are essentially just another level of teams.", "Some admins even call them super teams to easily convey what they are.", "They work in a similar way to teams, but also have their own set of rules and settings to consider.", "Most events focus entrants on having to be in a team.", "Organisations operate in a similar way to teams, but have that next level of hierarchy; an individual can be in an organisation, but teams, too, can be in an organisation.", "As this creates a third tier in the hierarchy, there is the possibility that an individual is not in an organisation, but is a part of a team that is in an organisation, and vice versa.", "While this is not a regular occurrence, it does have the ability to happen.", "This also means that an entrant can join an organisation that is separate from their own team's organisation.", "Click to expand", "You can view if an entrant is in an Organisation by editing their member record. Edit their event and it will appear in the popup like the image above.", "Like the teams, there has to be an active entrant managing an organisation that is set as the organisation captain.", "If the organisation is created via a registration flow, the creator will be set as the organisations captain by default.", "Some charities, however, perform a more manual process, which allows them to manage the creation of organisation records.", "In this process, the charity will use a", "for recording the organisation requests, which they then reference to manually create the organisations themselves.", "When an entrant has to create a team and organisation, the advice around the process has been difficult for some charities to write in a way that makes sense for those entrants who are unfamiliar with the structure, which is why some charities choose to manage the organisation creation themselves.", "Click to expand", "Just like individual and team pages, organisation pages have donation forms.", "Similar to the team donation functionality, if someone donates to an organisation, the donation won't sponsor any individual or team in the organisation, only the organisation itself.", "Click to expand", "Currently, the organisation functionality is still in beta, so there are elements that require custom development work to get organisation pages to behave exactly like team pages.", "Before considering using the organisation functionality, please consider how adding another tier could affect your external data structure (such as your CRM), marketing, general communications with users, and even financial reconciliation.", "From there we would suggest testing this on a dummy event, and thoroughly working through every possible scenario for the registration, until you are confident with it.", "If you’d like further help please pop in a support ticket from your Funraisin admin and our team will assist you."]},
{"title": "Fitness - Connecting Fitness Apps", "post": ["Fitness - Connecting Fitness Apps", "A guide for admins to explain to your fundraisers how to connect their apps to their profiles.", "Your supporters will often ask questions about how to connect their fitness apps, so the below guide provides information to add to your FAQs.", "If your event is fitness based and your supporters will be tracking their activity, you can include the option for them to link up their FitBit, Strava, MapMyFitness, and Garmin.", "We need to add a few API keys in order to connect fitness apps to your platform, so please pop a support ticket in and the team will be able to begin the process of setting up the apps. Please allow a few days for this to be updated. Once done, they will be available for all your events if you wish.", "After you’ve enabled fitness apps for your event, you’ll likely want to tell your fundraisers how to connect up their preferred app to start tracking their data. We’ve put together some copy you can use to help them get started! Feel free to edit as you need to.", "- please create a page on your own site if linking from an EDM or add as an FAQ.", "To accurately track their steps, users need to start and stop an activity and then save it. This will then sync to the platform, usually within 24 hours.", "There is one exception to this with", ", depending on the settings you have in place on the platform.", "Fitbit will count your cumulative steps taken throughout the day. So even if you didn't go on a run, you may have clocked up 10,000 steps during the day.", "Fitbit will not sync a logged activity AND cumulative activity.", "To check your settings, navigate to:", "Platform setup > General Setup > App Settings> Scroll down to Fitbit", "There is a tickbox:", "If this is ticked, then the cumulative activity will", "sync at the end of the day, and the app will work just like Strava, MapMyFitness and Garmin.", "Click to expand", "Your profile page includes your personal distance tally so you can track your distance towards your target. This is a great way to keep your friends updated on your workouts!", "If you track your workouts with Fitbit, Strava, MapMyFitness or Garmin your distances will automatically add to your tally.", "Follow these steps to", ":", "1. Download the", ",", "or", "app and set up your account", "2. Log in to your [charity or event name] account.", "3. Under the heading", ", click your chosen app.", "4. Follow the prompts to connect your account", "5. When you next work out, select", "in the app on your phone. Once you end your workout,", "and your distance will be published to the tally on your page", ".", "Remember, you can manually add your exercise to the tally in the", "tab within your logged in dashboard. This is a great option if you’re using a pedometer or a different method of tracking your distances.", "Follow these steps to manually add your activity:", "1. Log in to your account and select", "2. Under", ", enter the required fields. Depending on the challenge this may be steps, distance and/duration.", "3. The logged activity will now appear on your fundraising page!", "These examples walk through the quick process of connecting an app on a laptop. When connecting, the user will only be asked for their app username and password if they're not already logged into it on their laptop/mobile.", "These are for admin use. Please do not share with your supporters.", "If you'd like further help, please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Entrants - Reassigning Team Captains", "post": ["Entrants - Reassigning Team Captains", "A team is a group of fundraisers that come together to centralise their fundraising and display their total funds raised through a group fundraising settings, it's also a more streamline way to be able to share your fundraiser page and have more community based fundraising.", "Teams are most useful for a group of friends or individuals that would like to bring members of their workplace or social groups etc into the fold of fundraising, and watch eachother progress while supporting your cause.", "Teams allow custom targets different from an individual where you may be able to raise more in a group and make a larger impact to the cause you're sponsoring, this is also a way to track the progress of team members in an easier way as compared to searching for different individuals.", "The leader of the team which can control the team name, goal and fundraising target all from the teams dashboard.", "This is the group of fundraisers that can raise fund collectively throguh a single page.", "This is the act of swapping or moving around data to assign something else in it's place, most commonly used when moving members between teams or updating captains.", "Click to expand", "Click to expand", "Click to expand", "Click to expand"]},
{"title": "Entrants - Managing Teams", "post": ["Entrants - Managing Teams", "Through your site admin, you can add, remove or replace team members within a team.", "It allows flexibility when entrants join the wrong team or request to move to another.", "Every now and again an entrant will contact you as they want to be moved from one team to another, which needs to be done via the admin.", "When an entrant is moved from one team to another, you can also tick a box,", ", to ensure the money they've raised on their fundraising page contributes to their new team total. In doing so, the donations won't contribute to their old teams fundraising total.", "Click to expand", "Click to expand", "Your entrant will now be in the new team!", "Click to expand", "Follow the steps below to remove and entrant from a team, and also unassign individual donations from the team.", "Following the steps in the previous example, but when choosing a new team, select the top option from the team dropdown:", "and save.", "Once done, to update their donations, from within the entrant's profile, select", "in the white navigation.", "Click to expand", "Click to expand", "An entrant can join a team in a few ways.", "Screenshots of Steps 1-3 are within the section on r", ".", "Click to expand", "Once you've selected the team, ensure you tick", "before saving.", "This will ensure any of their donations they already have will also contribute to the team they have just joined.", "And that's it. They're now in the team!"]},
{"title": "Donor login", "post": ["Donor Login", "Every donor that donates to your platform will have a donor account created for them which is associated with their email address. This allows them to log in and view previous donations associated with that email address and download past receipts. If a regular donor, they can also update their card details.", "As a donor does not set up a password when they donate, in order to login they need to trigger an email with a unique link to login.", "This article will cover:", "For donors to log in, ensure you have the", "option within your navigation. To add this, edit your navigation at platform or event level and when adding a new navigation item, choose the option for", ". This will look like the below image and provide the option to choose", "or", ". Login Options will provide the option for entrants and donors to log in when selected, whereas Donor Login Options can be used if the site is just being used for appeals. Select the correct options and save.", "will then appear within the navigation.", "For more information about setting up navigation, please see this", ".", "Click to expand", "In order to allow donors to login, since they don't have accounts with passwords we need to get them to login using a secure 2 factor authentication method. The 2 methods we support are a One Time Link or a One Time Passcode.", "Oone Time Links are where the donor enters their email address into the login page and we send them a unique link which is only available to be used once, as soon as it has been clicked on it will be no longer valid. Note that some mail servers have security scanning in place which pre-click each link in an email and when this happens it can disable the ability for some donors to use the one time link method. For this we also support a one Time passcode method whereby instead of sending the donor a unique link we send them a unique code.", "You can choose which method you want to use under Platform Setup > Donation Defaults > Donor Login.", "To receive their one-time-use link by email, a donor should enter their email address on the donor login form which can be found by using the Login navigation button, or directly at {", "}donorlogin", "Click to expand", "Click to expand", "Once their email is added, the donor will receive the Donor Login automated email. The login URL will be included with personalisation tags: {", "}donorlogin/history/{", "}. An admin can edit the copy in the Donor Login email by going to:", "Platform Setup > Automated Emails > Donor Login email", "If the donor clicks on the link or copy and pastes the link into their browser, they will be redirected to the dashboard for donors. The donation hash changes after the URL is opened, so this URL in the email can only be used once.", "As each link is one-time use, if links are scanned and opened by the email client as a security measure then it might be necessary to share the URL directly with the entrant.", "You can right-click on the", "button and click on the", "option. If you try to log in as a donor after they have received the Donor Login email, it will invalidate the link in their email.", "Click to expand", "Donors can download receipts for donations (including scheduled donations) in the", "tab", "Click to expand", "They can edit their personal details like name and address in the", "tab.", "Click to expand", "Once saved, changes a donor makes to their", "section will update in the donation record within the platform."]},
{"title": "Entrants - Merging Account Records", "post": ["Entrants - Merging Account Records", "combining two or more similar records into a single one.", "recorded", "details of a person taking part in the fundraising campaign", "This is the record that you will be deleting and merging into the other record. So this is the email address you do not want to keep. The event history and donations will merge into the record you are keeping.", "This is the record you will be keeping. Event records and donations from the merged entrant will be added to this.", "Once you have chosen your email address to merge, and email address to keep, click", "at the top of you screen.", "Please note some information like donations may take 15 mins to appear on the fundraising page of the account that is being kept."]},
{"title": "Updating Fundraiser Details", "post": ["Updating Fundraiser Details", "This video will walk you through updating fundraisers details both via the admin and also by logging in as them."]},
{"title": "Password Reset Quicklink", "post": ["Password Reset Quicklink", "Provide entrants with a unique link to reset their password.", "A unique link that can be generated from each members profile within the admin, allowing them to reset their password.", "Quickly generate a unique password reset link for entrants' to use.", "To allow participants to reset their password without receiving a system-generated email we have enabled a", "in the Admin.", "Click to Expand", "The forgotten password link can also be downloaded in a", "from the platform if you require a bulk list of reset links for multiple entrants.", "To access this information for an entrant, search using the entrant's name or email address, click on the edit icon for the entrant, t", "Interactions", "Click to Expand", "Click to Expand", "Click to Expand"]},
{"title": "Supporter Care: Get Started", "post": ["Supporter Care", "Become a relationship management expert in no time after attending our Supporter Care training session.", "or", "Watch our quick tutorial to help supporters update their page and contact details.", "Trigger badges for supporters who hit their fundraising milestones offline."]},
{"title": "Adding 3rd Party JavaScript Libraries", "post": ["Adding 3rd Party JavaScript Libraries", "You will need to have access to the Developer module in your Funraisin platform for this, where you will be able to", "Often when you are setting up a new site you might want to use a 3rd party JavaScript library.", "Once you get access to the Developer module, simply go into Developer > Upload Assets and you will see a screen such as below that will allow you to upload your external files. Note all files must be zipped prior to uploading.", "Click to Expand", "Once you have uploaded your zip file you should see it listed like the screenshot above.", "Once you have uploaded all of your assets you can now add them to your site’s view files. Note that this is best performed by a web developer as if you make any changes to your site’s views you can detrimentally affect your site if not careful.", "Within the Developer module, Select", "from the middle white menu.", "On the right-hand side, you should see a list of all the site’s desktop and mobile views and selecting any view file will load up that file in the code editor.", "The view called", "is a global file that is loaded within each page. If your external library is required to be loaded in the head of the page then you should use this view. Otherwise, you can also use the", "view and provided that you check that the files are loaded, this would be the best location for loading any 3rd party library.", "Click to Expand", "Back on the list of Assets, you will notice that each asset is given a directory such as", ". You can use this path to load up your library, though we strongly recommend that you lose the", "and just use", "to make sure that it will be compatible with the site when viewed over https."]},
{"title": "Configuring SMS Donations", "post": ["Configuring SMS Donations", "In addition to sending our SMS messages you can also setup unique SMS codes to be used for SMS donations.", "When someone sends one of the SMS codes to the number that you purchased from their mobile phone, they will be immediately returned a unique link allowing them to make a quick donation straight from their mobile.", "To setup SMS Donations you will need to configure your Twilio Phone Number to forward any messages on to your Funraisin platform. This is really easy to do.", "Just jump in to your Twilio account and go onto the “Phone Numbers” section and then click on the phone number that you purchased in the step above.", "Scrolling down the page you will see an area that let’s you setup Webhooks for your number.", "In the field labelled “A message comes in” enter your Funraisin platform url followed by “/sms/receive” just as I have in the screenshot above. Leave all the other settings as they are and hit Save.", "That’s it! Now everytime someone sends a message to your number, it will be forwarded to your Funraisin platform; and if we find a matching code as setup in Funraisin > SMS Codes, we will send back the message that you have defined allowing the sender to click on their unique link and make a donation.", "To use SMS with your platform you will need to open an account with Twilio or Burst SMS. You can read more on how to do this"]},
{"title": "Google API Keys", "post": ["Google API Keys", "A recent update from Google has meant that any platform using Google address lookup will now require its own Google API Key.", "The Google API key ensures that when entrants/donors are searching for their address, it begins to auto-populate. This makes the process quicker for them, and the data more accurate for the charity.", "Click to expand", "If you see the below error when searching, then you will need to follow the below steps to get a new key.", "Click to expand", "You can check if you’re using Google lookup by navigating to:", "Platform Setup > Platform Settings", "Depending on your location, you may not be using Google lookup.", "Click to expand", "Navigate to:", "Click on the blue Get Started button and login to your Google account.", "Complete the form, change Account Type to Business (don’t worry if this won’t let you change it), and add in the company address.", "You’ll also need to add in a payment method. Don’t worry, you won’t be charged. Due to the nature of traffic on non-profit sites, combined with the free credit that Google provides each month, charity sites are unlikely to use more than 20% of the free quota and will not be charged anything by Google.", "More information on billing can be found here -", "Click to expand", "Once done, hit", ".", "If you’ve added or changed your payment method, then it will likely open a popup for 2-factor authentication.", "There will now be a popup with some questions to answer :", "How can Google Maps Platform help you?", "What industry best matches what you will build for?", "What are you looking to learn about or build?", "What would help you most to get started?", "What is your company size?", "Click to expand", "Once done, a popup will appear with your key. Make a copy of the key as you’ll need that later.", "On the popup, untick", ".", "And then click", ".", "Click to expand", "You’ll now be within your Google Cloud Console.", "Click on", "in the left-hand navigation. This will show a list of APIs, three of which need enabling. Click on each of the below. A screen will appear with an option to", ".", "Once done, you can return to the platform and add the API Key.", "Click to expand", "Navigate to:", "Platform Setup > Platform Settings > App Settings > Google Maps API", "Click to expand", "Paste in your API key and save.", "Your key has now been added to your platform!", "You can now test it on your registration or donation forms which should prepopulate with the address!", "If you’d like further help, please pop in a support ticket from your Funraisin admin, and our team will assist you."]},
{"title": "Syncing Data to Burst SMS", "post": ["Syncing Data to Burst SMS", "is an online SMS service that integrates with Funraisin to send campaign data. Using the integration, you can send out personalised SMS messages to your supporters to compliment your supporter journey.", "The following data is able to be sent to your Burst SMS account with our free out-of-box integration:", "Data sent every hour:", "The below article will walk you through setting up your lists to send data to Burst SMS for supporter journeys. If you'd like to add SMS to your platform for Triggers, please follow", "for connecting to your platform. Once connected, you can find further information on setting up your triggers", ".", "To send data you first need to grab your account’s", "Paste them into the", "of the Burst SMS module in Funraisin.", "/management/burstsms/config", "Click to expand", "Once you have connected to your account with your", ", any lists that you have will automatically sync over.", "Either edit a list you already have, or hit", "to create one.", "Once you have your list, click to edit it to define the source, such as fundraisers.", "You have 5 data sources to choose from:", "You can also choose from any of your event types or specific events that you want to pull data from. If you don't choose an event, or event type, then for Donations, Fundraisers, and Ticket holders, data will be sent from your whole platform.", "Click to expand", "By default, only name and mobile numbers are sent to Burst SMS. To send any more information to your list you can set up custom fields in your lists and specify what data you want us to send.", "To do this just edit the list you want to sync data to and click on the", "tab. If you have any fields already in your list then you should see them here.", "Each field can then be mapped to any data that we hold such as", "as well as more dynamic information such as \"has this person uploaded a photo\" or their personal fundraising page URL, etc.", "Once you're happy with your list, you can set it to", ". The sync will happen every hour, and if you want to pause it at any point, just set the list to", "."]},
{"title": "Configuring SMS", "post": ["Configuring SMS", "Adding SMS to your platform allows you to use SMS for Triggers in addition to emails. Triggers can be sent on an action by a supporter, such as reaching their fundraising target. You can use Twilio or Burst SMS to send out your triggers.", "If you'd like to use Burst SMS for your supporter journeys, more information can be found", ".", "This article will explain how to configure:", "The first thing you need to do is jump over to", "and signup.", "When signing up you will be asked a few questions like what product you are going to be using and what language. Just choose SMS from the product list, then choose PHP from the language list and choose SMS marketing from the “what are you building” list. To be honest it doesn’t actually matter what you choose from any of the questions.", "Click to expand", "Once you have signed up at Twilio you will need to purchase an SMS number. From the left-hand menu in Twilio choose", "from the", "Then click on the red circle to", "Click to expand", "When buying a number, make sure you choose the right country in the drop-down list and also make sure you choose the", "option.", "Click to expand", "Once you have purchased your number you will need to find your API details. If you go to your dashboard you should see your Account Summary which will contain your", "and", ".", "Click to expand", "To add this to your platform navigate to:", "Platform Setup > General Setup > Email & SMS Settings (white central nav)", "Scroll down to the SMS section > paste your Account SID and Auth Token into the fields provided > hit Save.", "Click to expand", "To signup for Burst SMS simply go to", "or", "and create an account. Once you have created an account you will need to select", "from the top nav and create your API secret and copy your API key, both of which need to be added to the platform by going to:", "Platform Setup > General Setup> Email and SMS (white central nav)", "See the above screenshot.", "Within Burst, against the field labeled", "you will need to enter the url to our SMS listener which is", "Click to expand", "From the main navigation in Burst SMS choose", "and then you will be able to purchase a phone number.", "Click to expand", "Now you've added your SMS details to the platform, you can set up your triggers.", "."]},
{"title": "Raiser's Edge Default Mapping", "post": ["Raiser's Edge Default Mapping", "Data mapping is essential in any integration; the feeding and storing of data from one system to another need to be defined. Below are the standard mappings that have been defined between Funraisin and Raiser's Edge NXT integration. If you require additional fields or further customisations on how the data are fed from Funraisin to Raiser's Edge NXT, please raise a ticket with Funraisin Support. Customisations in this integration are implemented within a 3-week timeline.", "This article will cover:", "We have another support article on", ".", "The following  list shows how Funraisin objects are mapped to Raisers Edge NXT objects:", "map to", "marketing opin selections map to", "map to", "marketing opin selections map to", "who donate to Members map to", "map to", "events map to", "purchasers map to", "sales map to", "purchasers map to", "sales map to", "The below tables show the standard field mapping from Funraisin to Raisers Edge NXT.", "All donors, fundraisers, raffle and shop customers sync to the Constituent object using the following mapping.", "All donors and fundraisers sync to the Constituent consent object using the following mapping when marketing optin data is provided.", "All donors who donate to a member have a relationship created which links the two.", "Registrations, event ticket sales, donations, raffles sales and merchandise sales sync to the gift object with the following mapping", "For all Raisers Edge related support enquiries, please pop in a support ticket in your Funraisin admin."]},
{"title": "Connecting to Raiser's Edge NXT", "post": ["Connecting to Raiser's Edge NXT", "The Funraisin Raisers Edge integration comprises of a one-way sync from Funraisin to Raisers Edge NXT CRM that operates on a schedule. This schedule can be altered to accommodate different volumes, with common schedules being anywhere from daily, bi-daily to every 30 minutes.", "As part of the standard integration you will be required to install a Raisers Edge application (See below), we can provide links for the package installation or you can provide us with access to your Raisers Edge account and we can install it on your behalf.", "This article will cover:", "We have another support article on", ".", "To create a Raisers Edge application you must go to the apps section of your Blackbaud developer account:", ". This guide assumes that you have the appropriate credentials to access this section.", "Once inside the application section, click the \"", "\" button under the", "heading.", "Click to expand", "Fill all of the mandatory fields as shown in the form. Your Funraisin platform will require specific settings for the", "= the base URL of your Funraisin site. E.g. https://your-funraisin-site.com", "Note that both of this value must be https and not http.", "Click to expand", "When you save the application you will be redirected to the Raisers Edge application settings page.", "The first step on this page is to update the", "The correct Redirect URI is your platform's Raisers Edge callback URL. E.g https://your-charity.org.au/management/raisersedge/savetoken", "Click to expand", "Click to expand", "Click to expand", "The second step on this page is to update the", "The application will need full data access, so this option should be selected.", "Click to expand", "Click to expand", "Click to expand", "For th next portion of this process, you will need to note down the values for the", "and the", ":", "Click to expand", "Now that you have created your application, log in to your Raisers Edge database (this is typically within the domain", ") and Click on the hamburger menu icon in the top left.", "Then select Marketplace from the dropdown that appears.", "Click to expand", "Once the page has loaded, select Manage from the top menu", "Click to expand", "Once the page has loaded, select Manage from the top menu", "Click to expand", "Enter your Application ID from the previous step and select save.", "Next, log in to your Funraisn platform and navigate to", "Configuration", "Once you have created and application within Raiser's Edge and have associated it to your database, you can now configure your application within the Funraisin platform.", "the Raiser's Edge module is not activated by default in most Funrasin platforms. If you cannot see the Raiser's Edge module under Integrations in your administration menu (as shown below) please contact Funraisin support and we can activate it for you.", "Click to expand", "Once your Raiser's Edge module is installed navigate within your platform to:", "Integrations > Raiser's Edge (NXT)", "Here you will be asked to configure your account.", "Add the application ID and secret key for your application configured above.", "Click to expand", "Add Raiser's Edge specific information", "When sending records to Raiser's Edge NXT we are required to include some values which are customised to each user's installation. Some of these values do not exist by default in the Raiser's Edge system and will need to be manually created before data can start being synched.", "The custom fields required are to be entered on the configuration page of your Funraisin administration account for Raiser's Edge and required the following values.", "Used when setting", "channels in the Raiser's Edge platform", "Used for the description field when setting", "Each financial transaction with Funraisin will be recorded within Raiser's Edge NXT as a Gift (", "). When a new gift is recorded it contains a gift splits object, within which a fund ID is required. Funraisin set's the following different fund ids:", "A donation to a cause", "Please note: The above fund ID's in the configuration section of the Raiser's Edge NXT module are globally used values for the various supported fund types on a platform wide level.", "Some clients require different funds to be used for different events or donation drives, in these cases funds ID's can be overwritten in the event administration section of your Funraisin platform.", "To view our default mapping to Raiser's edge, head to this", ".", "When you have your Raiser's Edge application created and associated to your database and your Funraisin platform configured above you are ready to start sending data to your Raiser's Edge NXT account.", "To send data to your account you will need to have a scheduled event active on your platform to have your data start submitting. In some cases where your platform has a large amount of historical data to be synced you may need to have an initial load of data to your Raiser's Edge account to have your new data appear in a timely fashion.", "When you reach this point please contact us with a support ticket and we will work with you to load your initial data and set new records to be integrated to your Raiser's Edge database on a set schedule.", "As records sync, de-duping will occur for all Contacts and Accounts to try to avoid duplicate records. De-duping on Contacts will check for an existing match on First name, Last name and Email address. De-duping on Accounts will check on Account name.", "All Funraisin objects support a field known as “CRM ID” which is used to store the IDs from external data sources. As data syncs to Raisers Edge, the CRM ID for each object is stored in our own CRM ID for that object so that you are at any time able to edit an ID within your Funraisin platform.", "The Funraisin > Raisers Edge sync uses the Blackbaud Sky API so each record that is synced will use at least 1 API call but often a single record will require 2-3 API calls depending on the data being synced.", "A site catering for example 10,000 transactions per day could typically require up to 30,000 API calls per day.", "Should an API limit be hit when syncing, the sync will retry later which depending on the schedule this could be with an hour or the next day.", "For all Raisers Edge related support enquiries please pop in a support ticket in your Funraisin admin."]},
{"title": "Syncing data to Campaign Monitor or MailChimp", "post": ["Syncing data to Campaign Monitor or MailChimp", "Funraisin supports the ability to send data to any", "or", "account easily without any need for a developer. Data on your supporters is sent to either eCRM without the need for a custom integration.", "Data is sent every hour, except for webforms which is sent on each submission.", "unique user identifier used to authenticate the site", "email marketing automation platform", "This article will cover:", "To send data you first need to grab your account’s", "and paste them into the Config area of either the Campaign Monitor or MailChimp module in Funraisin, depending on which platform you are wanting to sync data to.", "The Config sits within your Campaign Monitor or MailChimp module. An example image is below.", "You will find information on where to find your API keys in the “help” section in Campaign Monitor or MailChimp.", "To send data to your Campaign Monitor or MailChimp accounts you also need to define which platform you want to use. This can be done within Platform Setup:", "Platform Setup > General Setup > Platform Settings > External ECRM dropdown", "Click to expand", "Once you have connected to your account with your API keys, any lists that you have will automatically be loaded into Funraisin to allow you to then sync data to those lists.", "If you don’t already have any lists in your Campaign Monitor or MailChimp account you can create one now straight from within Funraisin.", "Either edit a list you already have, or hit", "to create one.", "Once you have your list, click to edit it to define the source, such as fundraisers.", "You can also choose from any of your event types or specific events that you want to pull data from. If you don't choose an event, or event type, then for Donations, Fundraisers, and Ticket holders, data will be sent from your whole platform.", "Once data has synced over, you cannot delete it in Funraisin. Data would need to be manually deleted within Campaign Monitor or MailChimp itself.", "By default, only names and email addresses are sent to MailChimp or Campaign Monitor. To send any more information to your list you can set up custom fields in your lists and specify what data you want us to send.", "To do this just edit the list you want to sync data to and click on the", "tab. If you have any fields already in your list (that you set up directly in Campaign Monitor or MailChimp) then you should see them here.", "Each field can then be mapped to any data that we hold such as", "as well as more dynamic information such as \"has this person uploaded a photo\" or their personal fundraising page URL.", "Using the drop-down field, select from the available data fields to decide what you want to be sent to which field. For information such as “has uploaded a photo” etc, you can also define a default value which we will send across if there is nothing for us to send. If you leave this field blank and we have no data to send then nothing will be sent to that field.", "Ensure every field has been mapped to prevent any errors in your data being sent across.", "Click to expand", "Once you're happy with your list, you can set it to", ". The sync will happen every hour, and if you want to pause it at any point, just set the list to", ".", "Webforms that sit within a registration flow or donations form can be mapped across when using fundraisers or donations as the source. However, if you have a webform on a static page, e.g. Contact Us form, then this syncs across slightly differently.", "Firstly, jump into whichever webform you want to send data from, and navigate to:", "Form Details > ECRM Options.", "Here, choose the Campaign Monitor or MailChimp list you want to send data to and save.", "Click to expand", "Once you have specified which list you want to send data to, you'll need to map each of the webform fields.", "Within", ", edit the individual questions and you'll have the option to choose a field that is in the list you are sending data to. If a field is not there, then edit the list within your Campaign Monitor or MailChimp module to create that field that can then be mapped to.", "The value of the webform field with the 'email address' data type will be synced as the email address of the contact.", "Click to expand", "Within your Campaign Monitor or MailChimp list, you do not need to specify the data source, event or event type as the webform is not linked to any of those. All the mapping takes place in the webform itself. More information on webforms can be found", "."]},
{"title": "Connecting to Salesforce", "post": ["Connecting to Salesforce", "Every Funraisin site comes with the ability to sync it's data directly to Salesforce, right out of the box with no additional charges or development needed.", "This article aims to show you the steps required for setting up your Salesforce sync.", "Overview", "The Funraisin Salesforce integration comprises of a one-way sync from Funraisin to Salesforce that operates on a schedule. This schedule is generally set at hourly however we are able to alter this on request for a less frequent sync.", "As part of the standard integration you will be required to install a managed package (See below), we can provide links for the package installation.", "For custom integrations this might not be needed.", "The Funraisin integration is compatible with the Salesforce Not for Profit pack using household accounts and also NFP Cloud as well as just standard Salesforce. The current version is 2.2", "As records sync, de-duping will occur for all Contacts and Accounts to try to avoid duplicate records. De-duping on Contacts will check for an existing match on First name, Last name and Email address. De-duping on Accounts will check on Account name.", "If you have your own additional matching rules in place this may affect our ability to create contacts.", "All Funraisin objects support a field known as “External CRM ID” which is used to store the IDs from external data sources. As data syncs to Salesforce, the Salesforce ID for each object is stored in our own External CRM ID for that object so that you are at any time able to edit an ID within your Funraisin platform.", "It is vital that when you merge or delete any record in Salesforce, that you also then update the related record in Funraisin otherwise you will see errors in your error log around \"insufficient access to ID xxxxxxx\" etc", "The Funraisin > Salesforce sync uses the Salesforce SOAP API so each record that is synced will use at least 1 API call but often a single record will require 2-3 API calls depending on the data being synced.", "A site catering for example 10,000 transactions per day could typically require up to 30,000 API calls per day.", "Should an API limit be hit when syncing, the sync will retry later which depending on the schedule this could be with an hour or the next day.", "For all Salesforce related support enquiries please pop in a support ticket in your Funraisin admin.", "To setup your integration you will need to create a user account with a non-expiring password. Login to your Funraisin platform and navigate to the Salesforce module and within the configuration option you will need to enter your account email address, account password, account security token and also upload your enterprise WSDL.", "Syncing to a sandbox prior to launch can be catered for, simply by providing your Sandbox details in the above step.", "Then once the site is ready to sync to a production environment we would simply clean all data from Funraisin by removing any existing Salesforce IDs so that data can be re-synced.", "Navigate to Funraisin > Salesforce when logged in to your platform and you will be asked to configure your account. Enter the username, password and security token of the account you want to connect as, as well as specify what Funraisin objects you want to have synced to Salesforce.", "Click to expand", "Next, upload your Enterprise WSDL into Funraisin", "Click to expand", "That is all that is needed on the platform side, you now need to install our managed package.", "Data from your Funraisin platform will map to most standard Salesforce objects as detailed further below, however, some data captured requires additional Fields and Objects be created on your Salesforce account.", "Before syncing data from your Funraisin platform you will be required to install our Managed Package.", "This will install the following:", "The following Salesforce objects have these additional fields applied", "Record types can be defined within Funraisin simply navigate to Funraisin > Salesforce > Recordtypes. This will allow you to control record types for various transaction types on Opportunities. For other objects e.g. Campaigns, these can be controlled from within the modules that sync to Campaigns which are Funraisin > Events and Funraisin > Pages", "Click to expand", "Once connected, Funraisin will only sync new data to your Salesforce account. We will not import or alter your existing data in any way.", "Funraisin uses “Funraisin” as its namespace prefix. All custom field names referenced below should include ‘Funraisin__’ as the prefix if they are referenced via an API.", "The following  list shows how Funraisin objects are mapped to Salesforce objects", "Standard Salessforce and NPSP", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "NFP Cloud", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "map to", "The below tables show the standard field mapping from Funraisin to Salesforce.", "All donors, fundraisers, shop customers sync to the Contacts object using the following mapping.", "All donors, fundraisers, shop customers sync to the Accounts object using the following mapping when organisation data is provided. Note that if no organisation data is provided then household accounts will be used.", "For NFP Cloud users, personal accounts will be created for every individual.", "All events, donation pages and teams sync to the Campaigns object using the following mapping.", "All participants in an event including offline event guests sync to the Campaign Members object.", "All financial transactions sync to the Opportunities object.", "AccountId", "Funraisin__Primary_Contact__c", "npsp__Primary_Contact__c", "CloseDate", "Funraisin__Payment_Date__c", "For NFP Cloud all financial transactions sync to the Gift Transaction or Gift Refund objects.", "A note on Soft credits when donating to a fundraiser. When a donation is related to a fundraiser,  we create an Opportunity Contact Role for the Fundraiser with a role of Soft Credit.", "For those using NFP Cloud, Soft Crediting is sent to the", "Object", "All merchandise sync to the Products object.", "A note on price books. A Standard price book called Funraisin Pricebook will be created for use with all products.", "All merchandise sales sync to the Order and OrderItems objects as well as the Opportunity object.", "As part of the NPSP and NFP Cloud syncs, you can optionally choose to have regular givers synced to the NPSP RG object or the NFP Cloud Gift Commitment Schedule.", "Below is the mapping for the Gift Commitment Schedule", "TransactionAmount", "StartDate", "TransactionPeriod", "TransactionDay", "For mapping non-standard data such as custom questions that might be asked during registration, or fundraising / fitness related data that doesn't fit into the standard Salesforce data model you are able to add additional custom fields to your standard objects and map them via your Funraisin login.", "Simply choose the data source e.g. donor, fundraiser, team, registration which each maps to a specific object e.g. contact, campaign, campaign member. Add in your API field name and select the data you want us to send to that field and we will do the rest.", "Webforms are forms that are created by admins via the Funraisin interface therefore their structure is unknown. Each webform is able to be synced to any Salesforce object with each field within the form having its own mapping to individual Salesforce fields.", "Edit your webform and specify which Salesforce Object you want it to sync to by adding in the Object API name.", "If this form is part of an event registration flow you can specify which field in your object relates to the ContactID of the fundraiser / donor", "Also if this form is part of a registration entry flow you can set the object behaviour to Update, whereas for standard in-page forms that aren't linked to any donor or fundraiser leave it set to insert", "Click to expand", "After specifying the object we sync to and it's the behaviour you will need to map each field in your form to the fields in your object. Simply choose \"Form fields\" from your webform and then edit each field that you want to be mapped to Salesforce. Under the \"CRM Options\" field enter your field's API name.", "Click to expand", "For webforms used within event registration or donation journeys, the submission will be linked to the relevant Contact ID however for standard page based forms e.g. contact us forms the submissions can only be linked to a single object.", "Any error encountered whilst we are trying to sync data to Salesforce will be logged in your platform, along with the actual payload of data we were attempting to send. You can monitor these errors in Funraisin > Salesforce > Error Log.", "Please note that we will continue trying to sync your data for as long as there is data needing to be synced, so any errors encountered will simply repeat every hour until they are corrected. This can sometimes make your errors seem more than what they actually are, often it is only a few records that need correcting but due to all the connected records it might appear to be a lot more in your error log.", "Our advice is to monitor your error log every few days and then also clear out all errors every few days so you can be assured to be only dealing with the latest ones.", "Where possible we will also display Salesforce errors in other parts of the admin where they might relate to. For example if you are viewing a donation record or a transaction record in the admin you will notice a Salesforce errors tab, any errors we encountered related to the record you are looking at will also be displayed here.", "Below are some of the more common errors you may encounter.", "This generally means that the account you are using to connect with has an expired password. You will need to reset the password in Salesforce and then enter this password, PLUS the new security token into the fields provided in Funraisin > Salesforce > Account", "This is the most common error and is Salesforce's way of telling you that one of the IDs we are using is no longer valid. Usually this means that the ID we have on file is old and the most  common cause is that a record has been merged or deleted in Salesforce and not updated in Funraisin. To clear this error you will need to check all related IDs and make sure they do in fact exist in Salesforce and if they don't, update them in Funraisin.", "This is an error from Funraisin not Salesforce and this is telling you that we are not able to sync the record in question as we don't yet have an Account ID on file for the connected record. This will only ever appear wyen trying to create Opportunities and as mentioned, this is usually a temporary error since we generally get the Account ID for any contact on the second sync. The first sync is when we create a contact and then the second snc is usually when we retrieve the household account so usually this error can be ignored. If however you notice this same error appear repeatedly for the same transaction, that then means that we have not yet been able to create the Contact so that would then mean you would need to look into why and look for any other errors related to the donor or fundraiser etc", "This is from Salesforce and it is telling you that when we tried to create a Contact there were multiple matches found that fall outside of our standard de-dupe rules and it is asking us which contact we'd like to use. This means that you have additional matching rules in place in your Salesforce account and this is most likely going to stop us from syncing some contacts so our advice is to remove these rules and allow us to use our standard re-dupe matching rules whcih is first name + last name + email address.", "Within Funraisin you can manage various Record Types and the Heirachy of some of your Campaigns allowing you to control to some extent the parenting of your Campaigns.", "To administer recordtypes for different opportunities or transactions simply navigate to Funraisin > Salesforce > Record Types and here you will be able to add in the RecordType IDs for each transaction type e.g. donation vs entry fee vs merchandise etc", "For managing recordtypes for Campaigns such as Teams and Organisation Pages and Fundraising pages etc these can be set within the event, simply navigate to Funraisin > Events and edit the event you wish to set the recordtype for and then under General Settings you will see a Salesforce tab which contains fields allowing you to enter in the Recordtype IDs for team and individual based entries (Campaigns and Campaign members)", "For DIY fundraising these same settings are managed from within the DIY theme itself.", "Campaign Heirachy", "For managing campaign parenting, most of it is already covered via the sync, for example if you were to register for an event and be part of a fundraising team then your own fundraising page campaign would be automatically parented to your team campaign which itself would be parented to the event campaign. However with DIY fundraising it works differently, since the event doesn't exist until someone signs up and creates one you can control what campaign all DIY events are parented to simply but editing the DIY theme and in theme settings scrolling down to the Salesforce section where you can add in your Parent IDs"]},
{"title": "How to Send Data to Autopilot", "post": ["How to Send Data to Autopilot", "Funraisin supports the ability to send data to Autopilot without any need for a developer.", "Data sent every hour:", "Data sent as submissions are made:", "To send any web form data to your Autopilot account you first need to define which platform you want to use in Funraisin. Jump into your Platform Settings and choose which eCRM platform you wish to use from the drop-down menu.", "To send data you first need to grab your account’s API key and paste the API Key field in Autopilot > Config.", "In Autopilot > Config, you can enable whether it should send data for donors and fundraisers. You should select an event to filter fundraiser data in case there are fundraisers taking part in multiple events. These settings will determine which contacts (and details) are synced to Autopilot.", "You can select a data source for a list and activate it to move contacts (that have already synced) to the list.", "By default, name and email addresses are sent to Autopilot. To send additional information to your list you can create custom fields in Autopilot and then map to values in Funraisin.", "Each field can then be mapped to data that we hold in the Map Fields area of the Autopilot module such as gender as well as event-specific information such as fundraising target, etc.", "Once you've got everything ready to go - submit a support ticket and we'll start the sync for you on the server. This only needs to be done the first time.", "The sync takes place every hour so you should start seeing data in Autopilot after the sync has been kicked off.", "Jump into the web form you want to send data from and under the eCRM settings choose from your available lists", "Once you have specified which list you want to send data to, you can go ahead and create or edit your fields and you will be able to choose from your list of available fields in your list to send data to.", "You should set “email address” as the data type of the web form field that should be synced as the email address of the contact.", "And that’s it for syncing webforms. Go ahead and submit your web form from any of your pages and you should start seeing data in your list straight away."]},
{"title": "Connecting to your CRM API", "post": ["Connecting to your CRM API", "Each Funraisin platform comes with its own API allowing you to access your data from other 3rd party applications. Using the API you can tap directly into your data in real-time to store your data in other CRM systems or to simply display content such as leaderboards on other websites.", "Please note that this API is intended to be used for CRM integrations, it is not designed to be used for mobile apps since the credentials would become accessible for malicious use. For mobile apps you will need to read our article on the", "Please pop in a support ticket for assistance along the way and so we can assist you.", "The Funraisin API is designed to allow sites access to their own data via RESTful requests and to also allow some limited ability for updating and creating records. This API will not allow for more triggered requests such as processing payments or sending out tax receipts.", "API query requests are not limited since you will be querying your own data on your own instance, therefore we leave the responsibility of limiting the number and frequency of requests up to each client.", "Datasets though will always be limited to no more than 1000 records per request.", "Your API will provide you with access to almost ALL of your data with the exception of information such as encrypted passwords. The data is provided to you completely unfiltered therefore we suggest applying your own validation and formatting rules.", "A typical Funraisin platform can be broken down into the following key data areas.", "Below is a more detailed description of each object.", "All event attendees/fundraisers are stored as members and are then linked to an event via the", "object. A single member can have unlimited", "records, depending on how many events they are participating in, however in most P2P cases they will only have a single", "record.", "All donations are linked to either an event or a page (if not a sponsored donation). Any sponsored donation will be linked to an event and will also be linked to a member and/or a team if they are sponsoring a team.", "Note: Donations will contain duplicate records since a donor is never asked to log in to make a donation. If you donate 10 times then you will have 10 donor records all with their own unique ID.", "A transaction contains just the monetary information and will either be linked to a donation or an event registration fee (if applicable) and in many cases is not needed since the same information will also be contained in either the donation or members_history objects.", "Teams are optional for any event and if enabled will contain information such as team names, URLs, etc. Members within a team are linked from within their", "record.", "The diagram below shows a visual understanding of how the objects are connected.", "Ticketholders/guests are used for ticketed events are for all events these are people that are added by the purchaser for those attending the event", "-", "All objects within Funraisin have an external CRM ID field that can be used to store your own unique IDs against any record.", "To connect to your API first you need to create a user and allow that user access to the API. This can be done in Funraisin > User Admin. Jump in and create a new user and make sure you tick the “API Access” checkbox and then keep these credentials handy. You will also be able to retrieve the user's API key at this stage for use later on.", "To access your API you can use https://www.yourdomain.com/api/[endpoint]", "When connecting to your API you need to send through an API key for the user that you created in the step above. This can be done either using an Authentication header or via simple GET variable \"apikey\", when retrieving records or POST variables when updating or creating new records. We recommend that the APi Key is only sent via GET for testing purposes, for a production site using the Authentication header is preferred", "For example", "curl -H \"Authorization: Bearer [APIKey]\" \"https://yourdomain.como/api/[endpoint]\"", "or", "When accessing each endpoint you can send a GET variable “format” to specify whether you want us to return the data in CSV of JSON format. If you don’t specify the format then you we will use CSV.", "Each endpoint also has additional GET variables for filtering the data date ranges. When using dates please use the form “yyyy-mm-dd”.", "Using “date_from” will return any record created or modified since that date. Using “date_to” will return any record created or modified prior to that date. Both “date_from” and “date_to” can be used together or on their own.", "e.g. The below example will grab all donations made in 2016", "https://yourdomain.com/api/donations?username=apiuser@yourdomain.com&password=apipassword&date_from=2016-01-01&date_to=2016-12-31", "For large datasets you can use the GET parameter “limit” to restrict the number of rows returned. Additionally, you can use the “offset” parameter to then handle paging.", "e.g.", "By default all endpoints are limited to 1000 records unless specified otherwise via the limit querystring.", "To find out how many records are available we will provide you with a record count.", "Note that you cannot increase the results to greater than 1000", "Some endpoints will allow you to update or create new records by posting an array called “data” to the endpoint.", "Example: POST to https://yourdomain.com/api/donations/123", "data[d_email] = joeblogs@gmail.com;", "data[d_phone_mobile] = 0404 123 456;", "Will update donation record 123 with the above details.", "Curl example", "curl -d \"data[crm_donor_id]=123\"  \"https://domain.com/api/donations/1?apikey=abcdefghij\"", "Some endpoints will allow you to delete records by making a DELETE request to the endpoint.", "Curl example", "curl -x DELETE -d \"data[donation_id]=1\"  \"https://domain.com/api/donations/1?apikey=abcdefghij\"", "Some data sources support custom fields e.g. donations, teams, events, organisation pages, fundraisers. If a data source does support custom fields then these will automatically be available on the relevant endpoiint when specifying the format in JSON only.", "To update or create new custom fields, you can simply post the field using the following format:", "curl -d \"data[customfield][field_name]=Value\" \"https://domain.com/api/donations/1?apikey=abcdefghij\"", "Each endpoint contains specific filtering which is described below on each endpoint, but in some cases, you may need to filter data on a column which hasn't been catered for. In this instance, you are also able to add in additional filtering for any endpoint when using GET.", "For additional filtering you can provide a \"filter\" array specifying the field name and value you want to filter on, as shown below", "filter[field-name1]=value&filter[field-name2]=value", "Example curl \"https://yourdomain.com/api/donations?filter[d_email]=joe@blogs.com\"", "This will filter results pulling out records where donor's email addres is \"joe@blogs.com\"", "Similary for searching, you can also specify a \"search\" array which we will use to perform a LIKE based search on whatever field you specify.", "Example curl \"https://yourdomain.com/api/donations?search[d_email]=blogs.com\"", "This will search for anything containing \"blogs.com\" on the email field in donations.", "There are 2 types of endpoints for accessing your data, we have static endpoints and dynamic endpoints.", "are simply direct access to your data tables, they return every column, un-formatted by us, making it ideal for accessing data for the purposes of storing in an external CRM.", "are the exact opposite. They consist of data that has been manipulated by us to produce more meaningful information, making these ideal for the use of displaying things like leaderboards on external websites.", "The following static endpoints allow you to access your data tables.", "Url: https://yourdomain.com/api/donations", "Formats: CSV (default) or JSON", "Filter Options: date_from, date_to, member_id, event_id, team_id. history_id", "Primary key: donation_id", "Foreign Keys: member_id,event_id,history_id,team_id,page_id", "External ID: crm_donor_id", "To access your donation data you can use the below methods.", "GET", "If you want to get a specific donation record you can specify the id of the donation in the url", "GET", "If you want to get donations from specific events you can apply the following GET parameter", "GET", "To create a new donation record you can send a POST request with the fields sent via the $_POST[“data”] array.", "POST", "This will produce a result of Success or Failure.", "To update an existing donation you can send a POST request specifying the donation_id in the url, with any field that you want updated sent via the $_POST[“data”] array.", "POST", "This will produce a result of Success or Failure.", "The following 2 endpoints relate specifically to regular donors. A regular donor exists in 2 parts, firstly the schedule and secondly the recurring donations themselves.", "Url: https://yourdomain.com/api/scheduleddonations", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: id", "To access your donation data you can use the below methods.", "GET", "To update an existing donation you can send a POST request specifying the donation_id in the URL, with any field that you want to be updated sent via the $_POST[“data”] array.", "POST", "Url: https://yourdomain.com/api/recurringdonations", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: id", "Read only", "To access your donation data you can use the below methods.", "GET", "If you want to get a specific donation record you can specify the id of the donation in the URL", "GET", "Url: https://yourdomain.com/api/participants/", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: member_id", "External ID: crm_member_id", "To access your fundraisers/participants you can use the below methods. Note that this data will NOT contain any information relating to their event, it will only give you the main contact details for each participant such as names, email, phone numbers, address data etc. To get information relating to their event, use the below method Participants Events.", "GET", "GET", "POST", "POST", "Url: https://yourdomain.com/api/participantsevents", "Formats: CSV (default) or JSON", "Options: date_from, date_to, member_id, event_id", "Primary key: history_id", "External ID: crm_history_id", "Foreign keys: member_id,event_id,team_id", "The participants' events endpoint produces information relating to each participant’s event that they are taking part in, whether it be an online event, an offline event or a DIY event. Information such as their fundraising target, payment information is held in this table.", "Use this to return ALL participant events", "To return a specific record you can send through the history_id", "GET", "To get any events for a specific person you can send through the optional “member_id” in the querystring.", "GET", "To retrieve a list of entries for a specific event you can send through the optional “event_id” in the querystring", "GET", "Url: https://yourdomain.com/api/participantsoptions/[id]", "Formats: CSV (default) or JSON", "Options: date_from, date_to, member_id, history_id, event_id", "The participants options endpoint produces information relating to any options that were selected during the entry process such as Merchandise or Waves.", "To retrieve all participant’s products use", "To retrieve product information during a specific registration you can send through the history_id of the registration (from the participants events table)", "Url: https://yourdomain.com/api/participantsfitness/[id]", "Formats: CSV (default) or JSON", "Options: date_from, date_to, member_id, history_id, event_id", "The participants fitness endpoint produces information relating to any connected fitnesss devices eg. FitBit or Strava.", "To retrieve all participant’s products use", "To retrieve product information during a specific registration you can send through the history_id of the registration (from the participants events table)", "Url: https://yourdomain.com/api/participantsfitnessactivity/[activity_id]", "Formats: CSV (default) or JSON", "Options: date_from, date_to, member_id, history_id, event_id", "The participants fitness endpoint produces information relating to any fitness data that has been added or recorded.", "To retrieve all participant’s products use", "To retrieve product information during a specific registration you can send through the history_id of the registration (from the participants events table)", "Url: https://yourdomain.com/api/teams", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: team_id", "External ID: crm_team_id", "Foreign Keys: event_id, history_id, captain_id", "To access your team data you can use the below methods.", "If you want to get a specific team record you can specify the team_id of the team in the url", "To create a new team record you can send a POST request with the fields sent via the $_POST[“data”] array.", "This will produce a result of Success or Failure.", "To update an existing team you can send a POST request specifying the team_id in the url, with any field that you want updated sent via the $_POST[“data”] array.", "This will product a result of Success or Failure.", "Url: https://yourdomain.com/api/events", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: event_id", "External ID: crm_event_id", "To access your event data you can use the below methods.", "If you want to get a specific event record you can specify the id of the event in the url", "To create a new event record you can send a POST request with the fields sent via the $_POST[“data”] array.", "This will produce a result of Success or Failure.", "To update an existing event you can send a POST request specifying the event_id in the url, with any field that you want updated sent via the $_POST[“data”] array.", "POST", "This will product a result of Success or Failure.", "Url: https://yourdomain.com/api/eventproducts", "Formats: CSV (default) or JSON", "Options: date_from, date_to,event_id", "Primary key: product_id", "eventproducts", "eventproducts/", "Url: https://yourdomain.com/api/waves", "Formats: CSV (default) or JSON", "Options: date_from, date_to, event_id", "Primary key: wave_id", "Foreign Keys: event_id, parent_id", "https://yourdomain.com/api/waves", "}", "}", "To create a new event record you can send a POST request with the fields sent via the $_POST[“data”] array.", "This will produce a result of Success or Failure.", "To update an existing event you can send a POST request specifying the event_id in the url, with any field that you want updated sent via the $_POST[“data”] array.", "POST", "}", "This will product a result of Success or Failure.", "Url: https://yourdomain.com/api/themes/", "Formats: CSV (default) or JSON", "Options: date_from, date_to, category_id", "Primary key: category_id", "Foreign Keys: none", "https://yourdomain.com/api/themes", "}", "Url: https://yourdomain.com/api/products", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: product_id", "}", "Url: https://yourdomain.com/api/productoptions", "Formats: CSV (default) or JSON", "Options: date_from, date_to,product_id", "Primary key: option_id", "ctoptions", "options/", "Url: https://yourdomain.com/api/sales", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: sale_id", "External CRM ID: crm_sale_id", "}", "Url: https://yourdomain.com/api/salesitems", "Formats: CSV (default) or JSON", "Options: date_from, date_to, sale_id, product_id", "Primary key: id", "items", "items/", "Url: https://yourdomain.com/api/transactions", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: transaction_id", "External ID: crm_transaction_id", "Foreign Keys: member_id, history_id, donation_id, schedule_id", "The transactions table, as the name suggests, stores information on all monetary transactions, from donations to registrations and merchandise purchases.", "}", "To create a new transaction record you can send a POST request with the fields sent via the $_POST[“data”] array.", "This will produce a result of Success or Failure.", "To update an existing transaction you can send a POST request specifying the transaction_id in the url, with any field that you want updated sent via the $_POST[“data”] array.", "}", "This will produce a result of Success or Failure.", "To refund a transaction you can send a POST request specifying the transaction_id in the url, and a refund command and the amount to refund and the refund reason via the $_POST[\"data\"] array.", "POST -d \"data[refund]&data[refund_value]=100.00&data[transaction_notes]=fraud\"", "}", "This will produce a result of Success or Failure.", "Url: https://yourdomain.com/api/raffles", "Formats: CSV (default) or JSON", "Options: date_from, date_to", "Primary key: raffle_id", "External CRM ID: crm_raffle_id", "Url: https://yourdomain.com/api/raffletickets", "Formats: CSV (default) or JSON", "Options: date_from, date_to,raffle_id", "Primary key: option_id", "Url: https://yourdomain.com/api/rafflesales", "Formats: CSV (default) or JSON", "Options: date_from, date_to,raffle_id", "Primary key: sale_id", "External CRM ID: crm_sale_id", "Url: https://yourdomain.com/api/tickets", "Formats: CSV (default) or JSON", "Options: date_from, date_to, event_id", "Primary key: ticket_id", "External CRM ID: N/A", "}", "}", "Url: https://yourdomain.com/api/ticketholders", "Formats: CSV (default) or JSON", "Options: date_from, date_to,ticket_id,event_id", "Primary key: guest_id", "Url: https://yourdomain.com/api/webforms/[form_id]", "Formats: CSV (default) or JSON", "Webforms are forms that are built from within Funraisin itself and therefore these typically have no set structure since you are in complete control of what fields are captured.", "Url: https://yourdomain.com/api/pages/[page_id]", "Formats: CSV (default) or JSON", "Pages will provide you access to the static pages created within the CMS module.", "The below endpoints provide you access to information that would otherwise require querying multiple data tables to determine the result such as leaderboards. The data produced from these endpoints are created on the fly based on the data in the database and as a result they are cached for a period of 10 minutes to protect the integrity of the live database.", "Url: https://yourdomain.com/api/topfundraisers/{optional limit}/{optional event_id}", "Formats: CSV (default) or JSON", "Returns an unformatted list of your top fundraisers in order of total amount raised, restricted to the optional limit. If no limit provided then it defaults to 100.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "member_id, name, page url, raised, target, photo, event", "Url: https://yourdomain.com/api/topteams/{optional limit}/{optional event_id}", "Formats: CSV (default) or JSON", "Returns an unformatted list of your top teams in order of total amount raised, restricted to the optional limit. If no limit provided then it defaults to 100.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "team_id_id, name, page url, raised, target, photo, event", "Url: https://yourdomain.com/api/topdonations/{optional limit}/{optional event_id}", "Formats: CSV (default) or JSON", "Returns an unformatted list of your top donations in order of total amount raised, restricted to the optional limit. If no limit provided then it defaults to 100.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "donation_id_id, display name, comments, amount donated, photo, page url of person or team sponsored", "Url: https://yourdomain.com/api/totaldonations/{optional event_id}", "Formats: CSV (default) or JSON", "Options: member_id, team_id, history_id", "Returns a dollar amount of total donations based on the parameters sent. If no parameters then it returns the sum of all donations.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "amount", "Url: https://yourdomain.com/api/totalmembers/{optional event_id}", "Formats: CSV (default) or JSON", "Returns an integer for the number of fundraisers.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "total", "Url: https://yourdomain.com/api/totalteams/{optional event_id}", "Formats: CSV (default) or JSON", "Returns an integer for the number of teams.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "total", "Url: https://yourdomain.com/api/totalsteps/{optional event_id}", "Formats: CSV (default) or JSON", "Options: member_id, team_id, history_id", "Returns an integer of total steps based on the parameters sent. If no parameters then it returns the sum of all steps.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "steps", "Url: https://yourdomain.com/api/totalkms/{optional event_id}", "Formats: CSV (default) or JSON", "Options: member_id, team_id, history_id", "Returns an integer of total kilometres based on the parameters sent. If no parameters then it returns the sum of all kilometres.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "kilometres", "Url: https://yourdomain.com/api/totalmiles/{optional event_id}", "Formats: CSV (default) or JSON", "Options: member_id, team_id, history_id", "Returns an integer of total miles based on the parameters sent. If no parameters then it returns the sum of all miles.", "If you wish to restrict the results to a certain event you can pass through the optional event_id paramater in the url.", "miles", "Custom Endpoints", "In addition to the above endpoints which are fixed in terms of what data you can access, you are able to create your very own custom endpoints and choose what data you want to receive.", "Using the", "feature which is the ability to create customisable data files that can be downloaded, emailed or dropped onto a sFTP server, you are able to access these same data exports programmatically via the API.", "This allows you to essentually pick and choose exactly what you want to receive data wise and it also allows you to access data across multiple tables, for example you can access both donor and fundraiser data in a single call, you can even apply custom SQL queries to get exactly the right data that you need.", "To access a data export via the API you will need the Export url which can be obtained by viewing the data export from within the admin and clickin into the API Access tab. This will provide you with the endpoint for the specific data export.", "Don't forget the same rules apply as per all the other endpoints, you will still need to pass across your API key and you can also still set the data format to csv or Json using the ?format=json attribute"]},
{"title": "Social Wall Integration", "post": ["Social Wall Integration", "It's important to note that the layout, any styling, and what is and is not included within your social feed is all controlled within your aggregator settings. Funraisin is not able to make any edits to what is displayed and how."]},
{"title": "Fundraiser API", "post": ["Fundraiser API", "The Fundraiser API allows you to access data on behalf of your fundraisers, essentially mimicking what they can see and do on the website. This is designed to be used for things like Mobile App development.", "The Fundraiser API is designed to allow sites access to fundraiser-specific data via RESTful requests and to also allow some limited ability for updating records. This API will not allow for more triggered requests such as processing payments or sending out tax receipts.", "All endpoints will return JSON.", "stands for application programming interface, which is a software intermediary that allows two applications to talk to each other using a set of definitions and protocols.", "stands for stands for customer relationship management, which, as the name suggests, is used for managing your relationships with customers.", "stands for JavaScript Object Notation, which is a format used for storing and transporting data.", "Limits", "API query requests are not limited since you will be querying your own data on your own instance. Therefore, we leave the responsibility of limiting the number and frequency of requests up to each client; however, data returned via this API will be cached for a period of up to 15 minutes, depending on what data is being requested.", "Accessing the API", "Accessing the Fundraiser API is done via standard http calls using the language of your choice. Any connection must be made by an authenticated admin user which can be administered via the standard admin console.", "To connect to your API first, you need to create a user and allow that user access to the API. This can be done in Funraisin platform by going to Accounts > New User. Jump in and create a new user and make sure you tick the “API Access” checkbox and then keep these credentials handy. You will also be able to retrieve the user's API key at this stage for use later on.", "Make sure when creating a user that you allow access to the Fundraiser API only.", "Click to expand", "To access your API, you can use https://yourdomain.com/api/.", "When connecting to your API, you need to send through an API key for the user that you created in the step above. This can be done either using an Authentication header or via simple GET variable \"apikey\"; however, given that the use of this API is considered to be more open to the public (e.g., a mobile app), we strongly suggest using the header authentication method once your application is live.", "For example:", "curl -H \"Authorization: Bearer [APIKey]\" \"https://yourdomain.como/api/\"", "Or for testing:", "Some endpoints will allow you to update or create new records by posting an array called “data” to the endpoint.", "Example: POST to https://yourdomain.com/api/fundraiser_login", "data[login_email] = joeblogs@gmail.com;", "data[login_password] = mypassword;", "Will attempt to login as the fundraiser Joe Blogs.", "Curl example", "curl -H \"Authentication: bearer MYAPIKEY\" -d \"data[login_email]=joeblogs@gmail.com&data[login_password]=mypassword\" \"https://domain.com/api/fundraiser_login\"", "Some endpoints will allow for filtering and ordering of data; this can be done via standard GET variables, and these will be listed against the endpoints that support it.", "Valid responses will return an http status of 200 along with the JSON payload. Each response will have a \"results\" parameter indicating how many records are available, and the actual data returned will also be encapsulated in an object called \"data.\"", "Any errors encountered will return an http status of 403 along with a description of the error encountered.", "Some endpoints cater to many records, so when this is the case, you will be able to paginate through the data using a GET variable \"offset.\" By default, the records will be limited to 50 records at a time, and when pagination is available, you will see the attributes \"nextpage\" and \"prevpage\" in the response payload, which will automatically calculate the correct offset for you.", "Endpoints", "Allows you to login as a fundraiser to retrieve a token that can then be used for any future call.", "Url: https://yourdomain.com/api/fundraiser_login", "POST variables: login_email and login_password", "Request", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\" -d \"data[login_email]=joeblogs@gmail.com&data[login_password]=mypassword\" \"https://domain.com/api/fundraiser_login\"", "Response", "Of the data returned the 2 most important fields are \"token\" and \"recent_event_id\" as these 2 values will be required to access other endpoints such as this person's profile.", "The \"recent_event_id\" is the ID of the participant's most recent Active event and in most cases the participant will only have a single event unless they are on a platform that is running DIY events as well as P2P events.", "If the participant has more than 1 \"events\" then you can make a call to", "below to loop through the current events that thay are in.", "Allows you to access a specific fundraiser's profile. If you pass through the Event ID from the previous Login call then this will allow you to access their fundraising profile for the specific event, otherwise a more generic response will be returned similar to the Login endpoint.", "Url:", "(opt)", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_profile/1234-5678-9012/123\"", "Response", "Allows you to access a specific team's profile", "Url:", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_team_profile/1234\"", "Response", "Returns a list of current events (fundraising pages) for a specific fundraiser", "Url: https://yourdomain.com/api/fundraiser_events/", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_events/1234-5678-9012\"", "Response", "Returns a list of fundraisers within a specific event.", "Url:", "Cache Time: 5mins", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_individuals/1234\"", "Response", "Responses are limited to 50 records per call", "Returns a list of teams within a specific event", "Url: https://yourdomain.com/api/fundraiser_teams/{EventID}/", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_teams/1234\"", "Response", "Returns a list of fundraisers within a specific team", "Url: https://yourdomain.com/api/fundraiser_team_members/{TeamID}/", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_team_members/53436\"", "Response", "Returns a list of organisations within a specific event", "Url: https://yourdomain.com/api/fundraiser_organisations/{EventID}/", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_organisations/1234\"", "Response", "Returns a list of fundraisers within a specific organisation", "Url: https://yourdomain.com/api/fundraiser_organisations_members/{TeamID}/", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_organisations_members/53436\"", "Response", "Returns a leaderboard of fundraisers within a specific event", "Url:", "{LeaderboardType} Options: fundraising, steps, distance, duration", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_leaderboard/123/fundraising\"", "Response", "Note that the fields returned will depend on the leaderboard type. For example for a fundraising leaderboard no fitness data will be returned.", "Returns a leaderboard of teams within a specific event", "Url:", "{LeaderboardType} Options: fundraising, steps, distance, duration", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_team_leaderboard/123/fundraising\"", "Response", "Returns a list of fitness activities for an individual", "Url:", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\"  \"https://domain.com/api/fundraiser_activities/1234-5678-9876-6543/123\"", "Response", "Adds a fitness activity record against an individual", "Url:", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\" -d \"data[name]=Morning Run&data[type]=Run&data[date]=2021-04-01&data[distance]=10000\"  \"https://domain.com/api/fundraiser_activities/1234-5678-9876-6543/123\"", "POST Data", "Returns", "Updates a specific fitness activity record against an individual", "Url:", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\" -d \"data[id]=1234&data[name]=Morning Run&data[type]=Run&data[date]=2021-04-01&data[distance]=10000\"  \"https://domain.com/api/fundraiser_activities/1234-5678-9876-6543/123\"", "POST Data", "Returns", "Removes a specific fitness activity record against an individual", "Url:", "Curl example", "curl -X DELETE -H \"Authorization: bearer MYAPIKEY\" -d \"data[id]=1234&data[name]=Morning Run&data[type]=Run&data[date]=2021-04-01&data[distance]=10000\"  \"https://domain.com/api/fundraiser_activities/1234-5678-9876-6543/123\"", "POST Data", "Returns", "Creates a new participant record and registers them against an event", "Url:", "Curl example", "curl -H \"Authorization: bearer MYAPIKEY\" -d \"data[external_id]=1234&data[first_name]=Jim&data[last_name]=Henson&data[email]=jim@henson.com\"  \"https://domain.com/api/fundraiser_register/123\"", "POST Data", "Returns"]},
{"title": "Facebook One-Click Acquisition", "post": ["Facebook One-Click Acquisition", "In the article learn about:", "Designed to work within facebook itself, when someone sees a facebook ad or post inviting them to take part in your event or setup a fundraising page, usually they would be directed to your site to either a landing page or through to a registration journey where they are asked to signup by creating an account and then completing all the steps you have created for them to be able to register in to your event.", "With One-Click Aquisition they will still click through to your site from an ad or social post, however what they see will be a page that looks like it is part of the facebook ecosystem itself and with a single click of the continue button they will be registered in your event with an active fundraising page.", "Once the fundraiser has clicked through and accepted the facebook permissions and created a page you can then choose what they can do next by controlling the destination of where they land.", "You might choose to just send them straight to their fundraising page (either in Facebook or Funraisin) or you might choose to send them to a custom thank you page where you can ask them for more information.", "Either way, with a single click they will have been signed up to your event and will have recieved a confirmation email with all the details they need to carry on fundraising.", "As with everything there are some limitations to consider when using this feature, the main one being around data capture.", "For many online events there are often many steps to registering depending on what information you are wanting to capture, for example your event might be team based where it is mandatory to be part of a team, or you might have an entry fee, so naturally this type of acquisition isn't ideal for every scenario.", "Having said that, it is always possible to make up for the initial lack of data later on, after they have registered.", "This new feature is of course like all Funraisin features, free to use at any time however there are a couple of things that need to be in place first before you can make use of it.", "We will need to configure your site's Facebook app to be compatible with Facebook Login so the best thing to do is to just log a ticket from within your platform and ask us to take care of this for you.", "Once that is all done you can start to enable One-Click for specific online events or DIY themes using the guide below.", "To use One-Click Acquisition for an existing online event simply login to Funraisin and navigate to Events from the left nav and then find and edit the event you want to enable it on.", "Choose \"Facebook Fundraising\" from the middle nav. Once you enable the option for Facebook Fundraising you will see all the options available for managing One-Click for this event.", "The first screen will show you settings relating to how you want the one-click acquisition to work. In this area you can decide whether the person will get a Funraisin fundraising page or not and (if enabled) whether they will get a Facebook fundraising page or not. Both are optional.", "You can then choose the destination for the end user, do you want them to land on their fundraising page on your site like you do often for traditional registrations? Or you might want to send them to a custom thank you page that has some information on what to do next, or you might want to send then through an actual registration journey so they can complete other steps such as creating a team or making a personal donation.", "If you have been approved to access the Facebook Fundraising API then you will also be able to control settings. These are the settings that control what appears in Facebook itself when someone creates a Facebook Fundraising page.", "For online events you will want to control the fundraiser name, fundraising target, description but also more importantly when it expires so it co-incides with your actual event.", "Anyone that signs up via the one-click link will automatically have a member type of \"facebook\" so you can easily segment them from other fundraisers.", "Additionally, when viewing a fundraisers record in the admin, if they have a connected Facebook page then you will see a link to this allowing you to click through to view their page in Facebook."]},
{"title": "Triggers - Email & SMS", "post": ["Triggers - Email & SMS", "Event triggers are automated emails or SMS that will send based on a user's achievement. For example, if they've reached 100% of their fundraising goal.", "Allows for a more engaging experience and offers incentives to entrants which in turn can increase the life cycle for the campaign.", "Fundraising triggers can be created at the platform level so they apply to all events, or you can have specific triggers for certain events or even specific DIY themes.", "To create at", ", navigate to:", "Platform Setup > Triggers", "Click to expand", "To create for a specific event, navigate to the event:", "Advanced Options > Triggers", "Click to expand", "Hit", "and the below screen will be presented.", "Click to expand", "Let's run through the settings:", "Choose from active or in-active. When in-active, it will not trigger.", "For your own reference only.", "Used for multi-lingual sites only", "Several different actions can set off a trigger. These include:", "Linked to the above option, allowing you to define a value. E.g. Member raises amount = 100. This would trigger when the fundraiser reaches $100 of fundraising on their page. (Note that the unit of measurement [$, KM, % etc.] is not needed in the trigger value.)", "Choose from Email or SMS", "Choose to assign the trigger to a specific event or DIY theme or you can choose to make it global to the entire site.", "After saving your trigger you will see a screen with all of your triggers listed, like below. This screen will give you a brief overview of each trigger so you can quickly see it's status and how many have been sent out.", "Click to expand", "Once your trigger has been created and is", "it will be sent as soon as someone next conducts an action that meets the criteria of your trigger.", "To stop or pause a trigger simply edit it and change its status to", "and that will stop any more being sent for that trigger.", "Click to expand", "You can see how has received which trigger at any time easily simply by going back into the Triggers section, selecting the trigger and then hitting", "at the bottom of the page.", "You can also get this information by editing the trigger and then choosing", "along the top. A list of those who have received it will appear, and you can hit", "at the bottom of the page.", "Click to expand", "You can check whether an entrant has received a trigger by:", "Going to the entrant record > Interactions > Triggers", "Any Triggers that have been received, will appear in a list.", "Click to expand", "If you want to make use of SMS triggers you will need to configure your site to be able to send SMS messages. You can use", "to set up your site's SMS."]},
{"title": "Facebook Fundraiser+ Set Up", "post": ["Facebook Fundraiser+ Set Up", "In order to support Facebook Fundraising on your website you must first be registered for Facebook's Non-profit pages.", "You can find out more about that here:", "If you already support the ability to accept donations on your Facebook page then you are halfway there, if not then you will need to signup on the above link first before you can proceed.", "You must also make sure that your Facebook business account is verified.", "You can read more on how to get verified here:", "Please keep in mind that verifying your business can take up to several weeks as you will have to provide specific information to Facebook and wait for their approvals.", "Once you are verified the next step is to associate your website's Facebook APP with your Facebook page.", "Pop in a support ticket and the team will be able to take care of this. Before doing so, ensure you add Scott and Luka to your Facebook business account giving them full access so they can set this up.", "Alternatively, the steps are listed out below.", "Visit", "to login to your business account and then navigate to:", "Settings > More Business Settings > then under Accounts > Apps > choose to Connect an APP ID.", "To Find your APP ID simply log in to Funraisin and navigate to:", "Platform Setup > Apps Settings > and you should see at the very top of the page your", ".", "Paste this ID into the field in Facebook.", "Once your Organisation has been verified and the app has been added to your Facebook page, we can log a request on your behalf to gain access to the Facebook Fundraiser API.", "This currently takes between 2-4 weeks for Facebook to grant access.", "Almost immediately after donations are made within Facebook to fundraisers they will appear in Funraisin with a donation type of \"facebook\", we will also create a Transaction record with a payment type of \"facebook\" for the amount that was donated via Facebook.", "The only data we get access to is the amount and to whom the donation was donated to (the fundraiser), we don't get any payment information or personal information of the donor so any reconciliation will need to be handled from within your Facebook business manager account."]},
{"title": "Registration - Confirmation Email", "post": ["Registration - Confirmation Email"]},
{"title": "Terms & Conditions", "post": ["Terms & Conditions", "You can either add terms and conditions for the whole event or add different terms and conditions for each reg flow within that event.", "When adding Terms and Conditions to your event, you have the option to add it in two places:", "If you have multiple registration flows for your event and they're all using the same T&C's, then it's easiest to add at event level. However, if you have a set of T&C's for one specific registration flow, then you can add for that, and it will only be applied to that one flow.", "The below steps detail out how to add T&C's at", ", and at", ". Once added to one or both, it guides you through enabling to", ".", "Note, once added to a registration flow, they are automatically mandatory to agree to, in order to proceed through that step.", "To add Terms & Conditions at event level, select", "from the left white nav and then the", "tab.", "What is added here will apply to all registration flows in the event, unless overridden at registration flow level.", "Click to expand", "Select entry forms from the left white nav and then click into the registration form.", "Click to expand", "Click into edit Create account", "Click to expand", "Select optional waiver and then enter T&C's in the text box. The content you add here will only display for that specific registration flow.", "Navigate to your registration flow, and edit the Create account step. Click", "and save", "Click to expand", "This will then appear within the first step of registration", "Click to expand", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "QR Codes for registration and check-in", "post": ["QR Codes for registration and check-in", "A unique check-in QR code is generated when an enters an event on your site.", "These QR codes can be included in the registration receipt emails, for the entrant to present at an event, to then be scanned by a staff member with any smart device with a camera or a QR code scanning application. Making onsite checks-in easier and more efficient.", "Below are examples of how the QR code will look when embedded in the email and also how it looks to the recipient.", "Click to expand", "Click to expand", "When an entrant presents their QR code at an event, a member of the team can scan the code using simply their mobile phone camera. This will bring up a screen showing the entrant's name and the option to check them in. Once done, a time and date will be recorded. At the end of the event, their QR can be scanned again to add a check-out time and date.", "This information is recorded against the member and can be viewed and reported on.", "To view an entrant's check-in and check-out status, navigate to their member record:", "Events (left-hand white nav) > Edit their event record > a popup will appear > Event Checkin (left-hand nav)", "Click to expand", "Within a", ", you can also add in the below fields."]},
{"title": "Registration - Entry Forms", "post": ["Registration - Entry Forms", "When managing online events you are able to create unlimited registration forms allowing you to create customised registration flows for your entrants.", "This allows you to manage registrations on your site by creating journeys for different entrant types. For example, create a registration flow for individuals and then a different flow for team captains. Or you may want to create a registration flow for schools or businesses, adding in things like merchandise that you might not want for other entrants. For each of these flows you can assign a", "which can be reported on to identify which flow the entrant went through.", "You’ll need to already have your", "Online Event already set up. Head to the Events module and then into Online Events. Click the edit icon of the event you wish to add the entry forms to.", "Click to expand", "Once into the event, in your middle navigation choose Entry Forms. When you first create an online event, by default we generate one entry form called", ". You can edit this entry form to change the name, URL, and all the registration options within that form. The default form can not be deleted.", "Click to expand", "Click the edit icon of the form you wish to make changes to, or click the blue", "button to create a new entry form for this event. You will get the following screen after selecting", "Click to expand", "From here you can give the form a name, assign an entrant type and select the steps that you want to be displayed for this registration form.", "Give the entry form a name and enter the", "– a quick reference for you to know which form is which.  Here you’ll also see the URL. You can copy this URL and paste it anywhere on your site (in text, on a button, etc) that you want people to click through to in order to begin their registration using this entry form flow.", "You’ll see multiple steps below the", "section. These steps (with the exception of the first step) can be enabled or disabled.  Steps shown in white are auto-enabled and steps greyed out are disabled by default.", "The first step is required in order to capture the personal details of the member registering and can not be disabled.", "Click to expand", "Clicking on each step will open a lightbox window with 3 tabs for navigation:", ": This is where you can turn on or off form fields, make fields mandatory, customise your opt-in text and much more.  You’re also able to edit the Tab Title (the name of the step which appears within the registration flow).", ":  Here you can add additional copy, imagery, video, and more to the top of that step in the registration flow. For example, you could add something along the lines of “Tell us a little about yourself by completing the details below. All entries received by DD/MM/YYYY will go into the draw to win!”. You get the idea.", ": If you would like to capture any data in addition to the preset fields for this (and each further) step of the entry form, you can choose to pull in a web form to that step. Learn how to create a web form in our", ".", "Click to expand", "We'd advise testing all of the registration forms you set up, and also ensure the data you're capturing is pulling through to your fundraiser reports."]},
{"title": "Registration - Next Steps", "post": ["Registration - Next Steps", "Next steps allows you to capture aditional data that would previously be only available during the main registration/entry form. This essentially allows the registration process to be split into 2 stages. The first stage being within a standard registration form, and the second as a lightbox over the top of the fundraiser's donation page or dashboard. The fundraiser's registration is tagged as active and complete once they land on their fundraising page or dashboard.", "Please note not all registration functionality is available within the next steps lightbox and is currently available to online events.", "Next Steps can be added to any individual entry form. This gives you the ability to set up different Next Steps journeys on different forms within the same event.", "Simply navigate to the Next Steps within the entry form and toggle it on.", "1. Click the", "2. Select the steps you require and", "3. You can also easily re order, turn off or delete steps.", "Customise individual steps by clicking", "icon.", "Toggle the header setting to enable a header across all of the steps or just the first step. Particularly useful for registration complete messaging and to encourage further profile customisation.", "Customise the header content and style.", "Lodge a support ticket or feature suggestion within the support section of your platform."]},
{"title": "Registration - Overview", "post": ["Registration - Overview", "Funraisin enables you to completely control the user journey of a fundraiser when signing up to an online event.", "Funraisin is a true multi-event platform in that you are able to create as many online or offline events as you wish, but within each event, you are also able to create as many registration journeys as you like. This allows you to manage and test unlimited entry flows to ensure you have the best flow for each event and device.", "We all know that registration forms can often be made too complex, often going over multiple different steps so trying to fit all scenarios into a single entry flow can easily increase frustration levels resulting in lower completion rates.", "We generally find that it is smarter to let the entrant choose upfront on what type of entry best fits their needs. By creating multiple registration journeys, you are able to manage different entry flows for different types of users in a simple and elegant way.", "Creating unique registration flows for different entry types such as individuals vs Teams vs Businesses / Schools vs Family Entries etc. can often then also help setup up a fundraiser’s expectations around the steps involved in their registering rather than making them think on the fly.", "Below shows an online event that has several different registration flows. You’ll notice:", "Within each Entry form are multiple steps you are able to enable or disable. And within each steps you’re then able to turn on or off data capture fields to best suit your needs.", "If you would like to know more about setting up entry forms read this support article", ".", "Usually, with standard registration systems, there is very little configuration as to what fields are able to be enabled / disabled but on top of this, it’s then very difficult to get feedback as to what parts of an entry flow are causing roadblocks with your fundraisers.", "Being able to track step-by-step progress as a fundraiser steps through the entry flow is vital to being able to understand what they are and aren’t liking when it comes to registering for your event.", "Funraisin not only allows you to customize what fields and steps are available within each of your entry flows, but we also track the progress of each fundraiser within each flow so at any time you are able to access any incomplete entries and analyse drop off points to then be able to go back and adjust your signup forms.", "Below shows the steps of the Default Registration Form. Steps in white are enabled and steps greyed out have been disabled.", "Most sites cater for mobile users by shrinking down forms using CSS styling to help make them more palatable on a smaller device. This one size fits all approach gets by but you are still often left with heavy registration flows that are still clunky for mobile users even though the fields are being modified.", "Since Funraisin has completely separate templates for Mobile vs Desktop you are also able to create different entry flows for different devices, disabling form elements or even entire steps for Mobile users that would otherwise create a negative experience for a smaller screen.", "The diagram below shows an entry flow used just for mobiles where only 2 of the steps are in use.", "Being able to access data on where users are getting stuck is one thing, but imagine being able to setup multiple journeys to track completion rates across different journeys to further help you understand what works best for your fundraisers and events?", "Because Funraisin is able to support unlimited entry flows, and track progress of all users within each journey, you can easily direct your traffic through different journeys using an A/B link to determine entry flow is delivering the best results.", "Below shows the entry flow progress for a Fundraisers record.", "Lightbox entry flows can often increase completion rates by providing a cut-down version of an entry form, allowing the user to skip quickly through a signup process to then provide additional information later on if and when it’s needed.", "Funraisin supports both lightbox and non-lightboxed entry flows allowing you to create unlimited options for any event to then track completion rates.", "This easily allows you to discover when a quick lightbox style entry form is best suited vs a more traditional entry flow."]},
{"title": "Setting up Bibs for your online event", "post": ["Setting up Bibs for your online event", "You now have learnt all there is to bibs within Funraisin to enhance your online events."]},
{"title": "Registration - Adding waves", "post": ["Registration - Adding waves", "If you're running an event that has set distances or specific time slots that entrants need to choose, you can set up waves. Each wave can have a capacity cap and will automatically close once it's been reached.", "You can add waves to a registration event, or to a ticketed event.", "This article will take you through:", "To set up your waves, navigate to:", "Your event > Advanced Options (white central nav) > Waves", "Click to expand", "Once you have navigated to", "you will be presented with the following options:", ": Determines whether the wave is open or closed.", ": The name of the wave that will be used when reporting. Ensure this is descriptive and unique, e.g. 5KM Walk", ": A code for the wave used for reporting", ": Categories can be added so that options are grouped together.", ": Wave start time", ": Wave start date", ": The maximum amount of entrants allowed in the wave.", "(opt): An optional bib start number. If defined, it will be automatically be assigned to the entrant", "(opt): An optional bib colour. If defined, that will automatically be assigned to the entrant", "You can add an image to appear next to each wave.", "This is the information entrants will see. This could just be the name of the wave, but could also contain more information.", "Click to Expand", "Once you've set up your waves, you can add them to your registration flow. They can either be added to the Create Account step or have their own Waves step.", "To add as their own step, edit your entry flow and enable the Waves step. Ensure you set the step to", "to prevent entrants from skipping.", "Click to Expand", "The below example shows waves that have a category. This automatically groups them together.", "Click to expand", "If adding waves to the", "step, edit the step and tick to display waves.", "Important to note, if adding to this step, you cannot use categories on the waves. If the waves are grouped into categories, they will not display on this step.", "Within your Fundraisers report, you can pull in the details you defined within each wave.", "Click to Expand", "You can also see what wave an entrant has chosen within their member record. Navigate to:", "Their member record > Events (central white nav) > Edit the event (popup will appear) > Choose Waves on the left hand side", "Click to expand", "If your event is ticketed, then you can remove Waves as a stand alone step from the registration flow. Instead, edit your Entry Types and select for Waves to show.", "When the ticket purchaser reaches the multi-entry step, they will have to choose a wave for ticket holder.", "Note, they will see a simple drop-down of wave options, they will not be split out into categories.", "Click to Expand", "The chosen wave will then appear in the ticket holder record along with their ticket.", "For reporting, within a ticket holder report, you can pull in the field 'Wave'.", "Click to expand"]},
{"title": "Creating Promo Codes", "post": ["Creating Promo Codes", "You can create discount codes for certain user groups or for promotional purposes. Or, close an event and restrict entries to only those with a promotional code.", "Funraisin enables you to create unlimited promo codes for discounts for entry into events, donations, and merchandise/shop sales.", "Head to the", "to get started and hit the blue", "button.", "Click to Expand", "An auto-generated code will be created, however you can overwrite the auto-generated code with anything you would like. We see many charities using easily remembered codes such as RUN25 for say 25% off the entry price to their fun run.", "Click to Expand", "There are a few settings to update to ensure the code works how you require.", "This can limit the use of the code to a certain number of entries. If no number is entered, then use is unlimited.", "You can select one or many events to lock the promo code off to. If no event is chosen, then the code can be used on all events.", "There is a tab for notes should you want to leave details about the code for future reference.", "If Free", "is selected  as the Type, then a few more settings appear:", "Choose what the promo code deducts from.", "Choose the value of the promo code, and if that value is a", "or an", ".", "E.g. A value of 20, as a percentage would provide a 20% discount. A value of 20, as an amount would provide a $20 discount.", "Once created, you can set to", "or", "If set to Closed, it will immediately stop working.", "In your Promo Code module you can", "or", "to get data on all your promo codes and their use.", "When you click into a promo code, within the left hand menu you will see", ", this will say how many times that paticular code has been used. Clicking on this will open a list of entrants that can be downloaded.", "Within a fundraisers report from your Data Exports module, you can add in the field", "to pull in the promo code used by participants when registering.", ". Let’s say the Bank of New Zealand, wishes to sign up and pay for their interested staff of 20 people. In this example, we’d suggest you create a promo code with the corporate's name in it to personalise the code, such as TEAM-BNZ. Set the value to", "and select", "from the drop-down. Then choose", "from the # Entries drop-down to limit the code's use to 20 times. You could then lock the code off to the specific event the BNZ team are registering for.", "(people who’ve started registering but didn’t finish) with a $25 discount, and limit to the first 50 people who return and complete their entry. In this case, you would create a promo code with a value of", "and select", "from the drop-down. From the", "drop-down, select 50."]},
{"title": "Event navigation", "post": ["Event navigation", "You can override Platform navigation by adding a cusotm nav at event level.", "Guide entrants through event-specific pages. Through the use of event-specific navigation, you avoid congesting the main navigation and can have streamlined navigation options for entrants to shuffle through.", "Click to expand", "Click to expand", "In custom navigation, you can also add a custom event logo and link this to the homepage of your event. By doing this, people will not be able to use the logo to navigate back to the landing page of your site.", "You can do this by ticking the box Override Platform Logo, this will also bring up a selection of mobile and desktop logos to update.", "Click to expand", "You may want to add a custom logo if:"]},
{"title": "Designing your Offline Event", "post": ["Designing your Offline Event", "They could be a gala night, ball, trivia event and more. Anything that relates to a physical event you would like supporters to register for without needing to have a fundraising page.", "Here's a simple and very achievable layout using the platform default styling for the header, a few images and a video, and a couple of links to buy tickets. It's a proven and effective formula for converting visitors to attendees. The landing page is as flexible as all of the other areas of the Funraisin admin, so your design options are only really limited by your imagination.", "Click to expand", "Click to expand", "Click to expand", "Click to expand", "Here's a few little tips and tricks we've learned from building thousands of event landing pages."]},
{"title": "Adding a DIY Fundraising Theme", "post": ["Adding a DIY Fundraising Theme", "A DIY theme is your 'always-on' fundraising option. Supporters can create their own fundraising page within a set theme, where they can collect donations and have friends and family join them in their challenge or activity.", "DIY themes allow your supporters to raise money for your cause, whilst also providing flexibility. They can choose their challenge or activity, and also a time that suits them.", "Click to expand", "You can create as many DIY fundraising themes as needed. These options make the decision making a little easier for your supporters by prompting them to fundraise however best suits them.", "When creating a new DIY fundraising theme you can control the look and feel of the registration flow, customise the default copy and imagery which fundraisers can share to their social networks, enable goals and teams, and much more.  Let's take an example of a birthday fundraiser – so fundraisers can choose to collect donations for you instead of birthday gifts.", "Head to", "to view all the themes you currently have setup.", "Click to expand", "Hit the blue", "button to create a new theme or click the edit icon next to each theme to edit.", "You’ll now see tabs when editing the theme settings.", "Click to expand", "In the", "tab you need to specify the theme name and also set the theme URL.", "Scroll down to", "where you can set up payment prefixes specific to this DIY theme that will override anything set at platform level.", "At the bottom of the page is", "By default, a fundraiser will land on their fundraising page once they have completed registration, however, you can override this so they land on a specific page. Alternatively, you can choose from the dropdowns another area of their profile to land.", "Click into the", "tab to customise how the fundraising page will look. You can edit the copy that will appear above the donation form on the page, set a suggested fundraising target and blog and provide default headers and profile pictures.", "The first step of registration is where you collect the personal details of the entrant. Choose the details you want them to provide and whether or not they are mandatory. Each of the registration steps can be renamed to suit your theme.", "Click to expand", "This step is where your supporters will customise their page, either adopting the defaults you have set or updating to personalise.", "You can choose to display fields related to the event (In Memory Of, Location, Date/Time...) or entrant's page (Blog Post, Profile Pic..) on the", "tab, and choose to include a web form to collect additional information on the", "tab.", "By enabling fitness options on the Form Fields tab, fundraisers will be able to set a fitness target during registration, connect to fitness apps, and manually enter fitness activities.", "If this is enabled, and your fundraiser makes their event", ", then they're essentially creating their own event that others can join. A", "button will display on the DIY event page and if followed will direct entrants to the", ", (detailed further down). The fundraisers page will act as the homepage, and their fundraising total will reflect their donations, but also the donations of any others who have joined their event.", "Click to expand", "You can enable the ability for fundraisers to create a team as part of their registration flow or from within their login area after registering. If enabled, supporters can click", "on the team page and sign up to the team, whilst also creating their own page.", "Click to expand", "You can disable the optional donation step or make it mandatory. The dollar handles can be set within Advanced Options (Left-hand white nav) > Custom Dollar Handles.", "Click to expand", "These can be set within the left-hand white navigation. Any emails set here will override what is set at platform level. More information can be found in this", ".", "Just like an Online event, you can create Public content pages. Within", "you can update the header for", "which will carry through the registration steps.", "You can create fundraiser emails to be displayed within the", "area within the logged in dashboard. More information on how to set these up can be found in this", ".", "More information on how to set up triggers for your DIY theme can be found in this", ".", "More information on how to set up Gamification for your DIY theme can be found in this", ".", "You can create a custom navigation that will be visible from your DIY fundraising pages. More information on how to set up a custom nav can be found in this", ".", "If you'd like an optional donation to appear on the last step of registration, then this will pull from what has been set at platform level, unless custom dollar handles are set here within the event.", "For Public Events where people are joining the event to fundraise", "If an event is set to", "by the fundraiser, then others can join their event. These entrants will be directed down a different entry form which is set up within the left-hand white navigation. The entry form here works in the same way as they do for online events - you select the fields you want to capture in each step.", "Click to expand", "If you’d like further help please pop in a support ticket from your Funraisin admin and our team will assist you."]},
{"title": "Setting Up an Offline Event", "post": ["Setting Up an Offline Event", "Offline events are events you create as an administrator to sell tickets, RSVP, or register for.", "You can set up offline events a gala night, ball, trivia event, and more. Anything that relates to a physical event you would like supporters to register for, without needing to have a fundraising page. If you would like your supporters to have fundraising pages to collect donations, these are managed through Online Events, and you can read about setting up an online event", ").", "An in-person event that individuals or a group of people can sign up or purchase tickets for", "Head to the", "module, the default view here is", ". In your middle navigation under", ", select \"Create New.\" Clicking this will open a lightbox window and take you through a simple event wizard, which will ask a number of questions and set you up with a default offline event.", "Click to expand", "After stepping through the wizard, your default offline event will be set up as Draft. You will be on the", "tab of your event, and here you can edit the event URL, add a code for unique reporting, apply a category, and much more... If you’d like your event landing page to display the location and start/end time for your event, be sure to specify these details under the", "and", "and", "sections located further down the page.", "Click to expand", "Clicking on the Entries & Fees tab will take you to where you can open or close entries, set a date/time for entries to automatically close and specify the closed message that will appear when your event is closed.", "From the", "section, choose the type of entry you would like your supporters to go through for this event, Options include", "This will allow supporters to simply complete the form without having to make a transaction.", "This allows you to enable tables and have supporters purchase individual tickets or whole tables. You’re able to set the price of single tickets and whole tables. Set the number of tickets available along with the maximum and minimum buy limit for individual ticket purchases. For tables you can specify the number of tables available to purchase too.", "This allows a user to fill out a basic entry form where the event may have an entry fee.", "Click to expand", "When setting up an offline event, if you chose the ticketed event entry type, you will need to set up one or more ticket packages to go along with the event. You do this by going to Tickets area in the white middle navigation area > Click the blue \"Add Package\" button on the right side. Then fill out all the necessary information regarding your offline events, such as limits for ticket quantity and limits per person, etc. Once all information is correctly filled out, make sure to mark the ticketed package as open so that the tickets will appear selectable in the ticket selection.", "Click to expand", "By choosing the", "you will be able to enter the set registration fee amount.", "The", "option allows you to generate a unique code that requires users to enter prior to beginning their registration. You can leave this blank to auto-generate or you can add your own unique code. This is handy if you’re ever running a corporate event where you don’t want members of the general public to join and instead only staff of a particular company. For example, you could enter a unique code", "if you’re running an Easter event for the staff of Macquarie Group. Users will need to enter this code before they can proceed with their registration or purchase of tickets.", "Click to expand", "You can also specify receipt prefixes to this specific event for your own reporting purposes. These prefixes will be applied to the relevant transactions and can be searched on from within your Stripe payment gateway too.", "If you have applied an entry limit, you can also enter an", ". This will be displayed on the first page of the registration flow if the limit has been reached.", "An", "can have as many pages as you wish. The fundraiser accesses these pages via a sub navigation that appears on the event Homepage. In this example, we have disabled any additional pages so no sub navigation is appearing below the event page header. This is the default layout of an", "An", "has a background image, foreground image, and right-hand panel that displays the date, location, and pricing options you have entered in the setup.", "Click to expand", "Building up your event page content is exactly the same as you would normally do within the", "module. All content is built up using rows where you can specify the elements to use in each row and style it according to your brand and the best layout aimed to convert people to register for your online event.", "Here’s where you can turn on and off fields to appear during the signup flow for your event such as phone, gender, organisation, mobile, address fields, DOB, and emergency contact information.", "The", "allows you to show or hide the", "step of the signup. We’d recommend leaving this enabled as it’s a great opportunity to solicit donations as part of the event signup by your supporters.  And finally, you can enter a Waiver to appear during the specific event signup too if you need to.", "Click to expand", "This is where you’ll add the copy you wish to be displayed on the confirmation page after a supporter signs up for your offline event. Alternatively, you can choose to redirect users to a specific page you have set up in the Pages module if you prefer.", "The Confirmation section also allows you to send a confirmation email to supporters after they complete the signup. You can choose the design email templates you have already set up on the Platform Level (you may even wish to create a unique email template just for this event to carry through the event look and feel), enter the Subject line and then the body copy, as needed. Remember to use the Personalisation Tags to personalise your email copy for a more polished look.", "Click to expand", "If you chose the Ticketed entry type and enabled tables, this is where you can manage table hosts and guests of each table. For example if one of your hosts calls to advise that their guest can’t make it after all – they could either update these defaults from their login area or this is where you could do this for them. Click into the specific table and then edit the hosts details or the guests details as needed.", "Click to expand", "Here’s where you can customise the social sharing options for the specific offline event. This will override the Platform Level social sharing. Customise the copy you’d like people to share through Facebook, Twitter, and Email.  You can choose to enable or disable social sharing from appearing on the default confirmation page after supporters have completed their signup. In the earlier example of running a Macquarie event, you may not wish to add social sharing copy as the event is essentially closed to the public.", "You can find the custom navigation under Advanced Options. This allows you to turn off the platform-wide primary nav and add your own offline event-level navigation. This means you can essentially create microsites within your platform. Go nuts! But please be kind to the user experience.", "Click to expand", "Also under Advanced Options, you'll find Custom Dollar Handles, where you can add your own offline event-level personal donation amounts.", "Click to expand", "When you’ve got an event up and running and are happy with the style, rather than having to set it up all over again for your next offline event, you can simply clone the event. Head back to General Setup tab when editing your Event, and from the little More Options in the top right, choose the Clone Event option. This will take a copy of the event excluding any donations and members associated to that event.", "Click to expand", "Here’s how an offline event will appear to someone who has completed the signup.", "They are able to manage their event and edit the guests' names if the event is ticketed.", "Click to expand"]},
{"title": "Creating and Customising Donation Nudges", "post": ["Creating and Customising Donation Nudges", "The percentage Donation Nudge applies to the total fundraiser goal amount, not to the remaining amount needed to reach the goal.", "Donation Nudges will show for the amount you have set and any amount that is over until the next Nudge. E.g. If you have set up two Nudges for $50 and $100, then when a donor enters the amount for $75 the $50 nudge will show."]},
{"title": "Ticketing - Pricing Periods", "post": ["Ticketing - Pricing Periods", "This article provides an overview of the following:", "We have additional ticketing support articles on the following:"]},
{"title": "Ticketing - Managing tickets in the dashboard", "post": ["Ticketing - Managing tickets in the dashboard", "This article provides an overview of the following:", "We have additional ticketing support articles on the following:", "If you decide to let users purchase tickets without entering details of each ticket holder, you’ll need to switch on ‘allow users to edit and reallocate tickets’ in order for them to assign the tickets at a later date.", "When", "is enabled, within My Tickets, the entrant will have the option to ‘buy tickets’ and follow three steps to complete the purchase.", "Unassigned tickets", "If a ticket needs to be reassigned to a new person at any point this can be done by the ticket purchaser by editing the ticket within their dashboard. Once the changes are saved an email will be sent to the new ticket holder letting them know a ticket has been purchased for them. This email is the Mutli Entry Invite.", "You can control whether users are able to upgrade or downgrade their ticket type by selecting this option in the ticket settings -", "When turned on tickets can be changed by the ticket purchaser in the dashboard by selecting ‘edit’ and then clicking ‘change ticket’.", "Once selected the user can then decide which ticket they want to change and what they would like to change it to. If the ticket they select is more expensive then the difference payable will appear and the user will be able to process the payment to complete the upgrade.", "A refund on a downgraded ticket is not currently available.", "For more information on ticketing, check out our other support articles linked above.", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Setting Up Online Events", "post": ["Setting Up Online Events", "Online events are events that registrants can sign up and fundraise for. They can be in person, or virtual events.", "You can set up online events to create virtual or in person challenges, sell tickets, manage third-party event places or bring your community together. For events where you don't need fundraising pages, check out our", ".", "Online events are a great way to drive sign ups and fundraising in one simple registration flow.", "An in person or virtual event that individuals and/or teams can register and fundraise for.", "Online events are events you create as an administrator and which supporters can register and fundraise for.", "Online events will take supporters through the", "you setup and ultimately end up with a fundraising page of their own, specific to the event they’re registering for.  Online events are fundamentally different to a DIY event – an event which the fundraiser creates themselves.", "Click to expand", "After stepping through the wizard your default online event will be setup as Draft. You will be on the", "tab of your event and here can set the event fundraising goal, add a code for unique reporting, apply a category and much more.", "Clicking on the", "tab will take you to where you can set an event level entry fee when selecting the Registration", "(note: this entry fee can be overridden on an", "level – allowing you to create multiple entry prices for the single event).", "The other Entry Type which you can select is Ticketed which you can learn more about in our article", ".", "You can also specify prefixes for registrations, donations and shop sales attributed to this specific event for your own reporting purposes. These prefixes will be applied to the relevant transactions and can be searched on from within your Stripe payment gateway too.", "The other Entry Type which you can select is Ticketed which you can learn more about in our article", ".", "You can also specify prefixes for registrations, donations and shop sales attributed to this specific event for your own reporting purposes. These prefixes will be applied to the relevant transactions and can be searched on from within your Stripe payment gateway too.", "Enabling", "will automatically generate bib numbers for you if your event is a race. Learn more about bibs", ".", "There are also", "which can be adjusted here that are specific to your event.", "If you have applied an entry limit, you can also enter an", ". This will be displayed on the first page of the registration flow if the limit has been reached or if a", "has been set.", "You can set", "for each time someone registers for your event, as well as setting approval, confirmation, and logout settings.", "An", "can have as many pages as you wish. The fundraiser accesses these pages via a sub nav that appears on the event Homepage.", "Click to expand", "Building up your event page content is exactly the same as you would normally do within the", "module. All content is built up using rows where you can specify the elements to use in each row and style it according to your brand and the best layout aimed to convert people to register for your online event.", "Here’s where you can set the fundraising defaults, specific to the event, and override the platform level", ". Enter an individuals target and minimum fundraising amount, and team target and team minimum fundraising amount.", "Add a default fundraising page masthead – this will be the default cover image that appears behind members fundraising pages. Depending on your sites design, we’d recommend using a relatively simply image in landscape format. You can also choose to resize the image if you wish to from the options in the Auto Resize drop down.", "And below that you can enter the default fundraising message and profile pics for individuals and teams.  Here’s an example of how this would look on a fundraisers public facing profile page.", "Click to expand", "If your event is a physical one and you’d like fundraisers to be able to", "from fitness apps including Fitbit, Strava, Garmin or Mapmyfitness, here’s where you can enable this. Tick the Enable Fitness box and then enter a Distance Target, minimum distances for individuals and teams. This will allow you to then setup triggered emails and/or SMS to fundraisers based on milestones they hit. We love a good trigger!", "Check out our", ", we go into a lot more detail about the options you have with Entry Forms there. Entry Forms are where you can turn on and off different registration steps, hide or show certain fields, and much more. The aim is to convert your member to register quickly and easily by taking them through the most relevant entry flow to their event registration needs.", "Our", "also goes into detail about setting up Merchandise. Here’s where you can add a product that you’ve setup within your", "module, to appear within the optional merchandise step of the entry form. The default product pricing will apply which has been setup on your Shop product level, however you can override this by applying a Special Price and even make the product free.", "Click to expand", "You can also make the purchase of a product mandatory as part of the event registration by ticking the", "option.", "Click to expand", "You can add assets and lock them off to specific events or make them global (to appear across all your online events). Simply upload the PDF, Word Doc, map, or whatever asset you need and that will appear to the logged in fundraiser who is part of that event, within their Dashboard.", "A guide can contain a description, tags, and a thumbnail image.", "Click to expand", "Click to expand", "You’re able to override", "for a specific event. Let’s say you’d like a different registration confirmation email  to be sent to members after registering that has a completely different design template, that’s where you would do that. Or if you have specific copy you want to include specific to the event that’s just not relevant across other events.", "Click into", ", then", "Give them email a name, add the subject, choose your design template and then select the Email to Override. Here you’ll see all the Platform Level emails to choose from. In our example of overriding the the registration confirmation email, you’d simply select the Registration Receipt from the drop down.", "Click to expand", "Then go to the Email Content tab below and begin typing your email content and you’re ready to go. Remember to use the personalisation tags too – it’s a great opportunity to be really relevant and personal to your fundraisers.", "Click to expand", "Who doesn’t love a good trigger. We sure do.  So much so", ".", "Give that a read as it covers off everything about Triggers.", "Here’s where you can customise the social sharing options for the specific event. This will override the Platform Level social sharing. Customise the copy you’d like people to share through", "Facebook, Twitter, SMS and Email.", "You can also customise the copy for team invites (when a captain invites someone to join their team).", "You’ll see the blue text link for", ". This will allow you to pull in things such as the member name, team name, and much more. We especially like the short URL options. Use these on email and SMS and you’ll start to build up a picture of the number of people converting to donation and even registration arising from clicking through on someones shared link. Now you can start to identify fundraisers who are influencers on your event.", "Custom navigation allows you to turn off the platform wide primary nav and add your own event level navigation. This means you can essentially create microsites within your platform. Go nuts! But please be kind to the user experience?", "Add your own event level sponsored donation amounts and personal donation amounts. This will override the Platform Level dollar handles.", "When you’ve got an event up and running and are happy with the style, automated email, triggers and more, rather than having to set it up all over again for your next online event, you can simply", ". Head back to", "tab when editing your Event and from the little", "in the top right, choose the", "option. This will take a copy of the event excluding any donations and members associated to that event.", "For further guidance, our", "has created a quick walk through guide to talk you through the steps."]},
{"title": "Ticketing - Ticketed Events Overview", "post": ["Ticketing - Ticketed Events Overview", "Ticketed events are different from Registration events, as they allow the ticket purchaser to buy a variety of different tickets at different price points. The tickets can also be set to capture different information about the ticket holders, depending on the requirements of the ticket.", "The building blocks used to create ticket packages. Define what information you want to collect about each individual ticket holder, whether they create a fundraising page and if their account is managed by someone else.", "The tickets your entrants can choose to purchase, which can be individual tickets or bundles of two or more. Entry types are assigned to ticket packages to define what details are collected about each ticket holder.", "The record created on the platform for each of your ticket holders. This contains details inputted by the ticket purchaser.", "This article provides an overview of how to set your event to ticketed and how it works. We’ll also define the difference between a Ticketholder record and a Member record.", "We have additional ticketing support articles on the following:", "Online events on your platform can either be classed as", "or", ".", "A", "is one whereby a single entrant registers and (most commonly) lands on their fundraising page or dashboard. You can add in the option for them to invite friends and even pay for them if they wish. However, an invited entrant is still required to follow an invite email and complete their own registration.", "A", "allows entrants to purchase various tickets, e.g. Adult, Child, and Family. They’re required to enter some details about each of the ticket holders, and depending on the settings you choose, the other ticket holders may or may not be required to complete the sign-up process to create a fundraising page. The ticket purchaser must pay for all the tickets to complete the transaction.", "An example of a ticketed event would be a Family Fun Run where you can purchase individual tickets at different price points depending on age, and also purchase group tickets. The adults would likely create fundraising pages whereas the children may have a fundraising page, but this would be managed by the adult ticket purchaser.", "Once you have created a new online event within the admin, by default it will be a Registration event.", "To update this:", "Edit the event > Entries and Fees > Highlight", "> Save", "Click to expand", "When running a ticketed event, each of your ticket holders will have a", "on your platform. The ticketholder record only contains the data entered by the ticket purchaser on the Multi-Entry step of the registration flow.", "Once bought, this record cannot be edited by any of the ticket holders, and the ticket purchaser cannot log in and ever see this data. A ticket record is primarily used for reporting purposes, so you know who each of the ticket holders are that are attending your event.", "You can view your ticket records by navigating to:", "Entrants > All Ticketholders > Click into a ticket record", "If your ticket holders have a fundraising page, then they will also have a member record. (This is why they’re interchangeably called members or fundraisers.) A member record not only creates a fundraising page, but also a logged-in area for that member where they can edit their personal details and fundraising page/s. Member records use email as the unique identifier, so if you’re running multiple events on your platform, including a Registration Online event, then your fundraisers may already have a Member record. This Member record will collate together their history of events in one place.", "You can see how many Ticket Holders and Fundraisers you have in the white central navigation of your event.", "Click to expand", "When you click into your Ticket holders, you will have a list of tickets like the below image. The ticket holders name will be in the left column, whereas the name of the ticket purchaser will be in the third column.", "If you’ve chosen not to collect the email of the ticket holder, (most commonly for children), then a dummy email address will be allocated which you can see below.", "Click to expand", "You can click into any of the ticket records to view the details, using the pen and paper icon on the left. If the ticket holder has a fundraising page (Member record), then this will be shown in a red bar at the top of the page. You can also click on", "in the left hand side to be taken to the Member record.", "The ticket record will always contain the details of the ticket purchaser in the", "section. You can also toggle to", "to see the other ticket holders names from the same transaction.", "Click to expand", "Now that we've gone through the basics, check out our support articles on how to set up your", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Event Setup: Get Started", "post": ["Event Setup", "Discover how to bring your community together with a", ". Learn more about the key features and benefits and see it in action from the Funraisin community.", "There’s a style for every event, such as virtual challenges, community fundraisers, ticketed events and more. Learn about your options.", "Create online events for your peer to peer fundraising, so you can collect sign ups and fundraisers all in one place.", "Create custom reports to keep track of how your events are performing, from your acquisition to highest fundraisers."]},
{"title": "Ticketing - Entry Types & Ticket Packages", "post": ["Ticketing - Entry Types & Ticket Packages", "Ticket packages are the tickets your entrants can purchase. These could be individual tickets, such as Adult and Child, or bundles, such as Family or Teams. We use entry types to build up these packages and define the information to be collected about each ticket holder.", "The building blocks used to create ticket packages. Define what information you want to collect about each individual ticket holder, whether they create a fundraising page and if their account is managed by someone else.", "The tickets your entrants can choose to purchase, which can be individual tickets or bundles of two or more. Entry types are assigned to ticket packages to define what details are collected about each ticket holder.", "The record created on the platform for each of your ticket holders. This contains details inputted by the ticket purchaser.", "This article will take you through the steps on how to set up your", "and", "and then assign them to display within your", ".", "We have additional ticketing support articles on the following:", "Once you’ve set your event as ticketed, you will have a new option, within your white middle navigation,", ". Click here to begin setting up your ticket packages.", "Details on how to set your event to ticketed are found", ".", "Click to expand", "Ticket packages are what your entrants will choose from when signing up to register.", "Click to expand", "Entry Types are the building blocks of your ticket packages. For example, a Family", "may be built up using Adult and Children", ".", "They are where you define the data that you want to collect on each of your ticket holders, and you’d likely want to collect different details for adult ticket holders compared to child ticket holders. This data will be collected on the", "of the registration flow.", "Click on", "to begin, which will bring up the below pop-up.", "(Don't want to collect information about each ticket holder?", ".)", "Click to expand", "Let’s go through the settings in detail:", "If you have a", "with multiple", ", (e.g Family ticket), then when you get to the Multi-Entry step within the reg flow, you will need to input the details of each ticket holder. Defining the order here will allow you to choose how they appear on this page. So, your Adult tickets can appear first on the list, followed by the children.", "This is the name of the Entry Type. E.g. Adult or Two Children. This name is just for admin use.", "These are the data fields you wish to capture for each ticket holder.", "For your reporting, this defines what entrant type the ticket relates to. E.g. Adult, Child, Student.", "When you get to your Multi-Entry step of reg, if not set to Not Mandatory, then the ticket purchaser can tick a box,", ", and not enter the details of the ticket holder. If Mandatory, then they will need to enter unique details for each ticket holder. We would always suggest you set this to Mandatory.", "Click to expand", "Define whether the ticket holders will get a fundraising page. If they do, then they’ll also create a Member record. (", ")", "If set to", ", this allows the ticket holder to use their own details for any of the tickets they are purchasing. So whilst they may purchase four tickets, they may put their name against all four ticket records.", "If set to Yes, this allows the ticket purchaser to manage the person they are registering. This is most commonly set to Yes on child or pet entry types. It allows the ticket purchaser to create a fundraising page for the child/pet, but they are in control of the page, and no email address is supplied.", "This defines how many entries are associated with the particular Entry Type. If your Entry Type was Two Adults, then you’d set this to 2.", "If the entry type is going to create a fundraising page, then by default, they will receive the Multi-Entry invite email. However, by changing this option to Yes, the Override Email option will become available.", "If sending an invite email, by default the Multi-Entry Invite email will trigger. However, you can create an email at event level and then choose it from the dropdown to be the email sent to invite ticket holders to complete their registration when a ticket has been purchased for them.", "When invited ticket holders receive an email to sign up and create their fundraising page, the invite email will send them to the Default Registration Form, which is always the first reg form in your list. This setting allows you to choose a different reg form from your list within Entry Forms that they will be directed to, to complete their registration.", "When creating your Entry Type, you choose the fields of data you want to collect, and this allows you to set which are mandatory.", "Now you’ve created your", ", you can use these to build up your", ".", "Click on", "to begin, and the below popup will appear.", "Click to expand", "Let’s go through the settings:", "Open or Closed will determine if the Ticket Package is open to be purchased.", "Define the cost for this Ticket Package.", "This defines how many tickets are in the Ticket Package. For example, an Adult ticket would be 1 ticket. Whereas a Family ticket comprising of two adults and two children, may be set as 4 tickets per purchase.", "Set a capacity for how many of this Ticket Package you have available. This would count a Family ticket as 1, as it is counting the Ticket Package as a whole. If you do not add a value here, then there will be no limit.", "Entering a number allows you to limit the number of each Ticket Package that can be purchased. You may want entrants to only be able to buy a maximum of four adult tickets for example.", "You can also set a minimum buy limit. You may want to make it mandatory to purchase at least one adult ticket to progress through the registration flow.", "You can create a code that will be applied to the Ticket Package that can be pulled into reports.", "This is not essential, but if set, Ticket Packages with the same category will appear behind an accordion header. The below image shows an Adult and Senior Adult Ticket Package both within the Adult category.", "Click to expand", "This is the name of your Ticket Package, and can be pulled into your reports using the field", ". If you have mutiple 'Adult' tickets for example, it can be useful to call them 'Saturday Adult', and 'Sunday Adult' so they can be differentiated in a report.", "You can add more information about the Ticket Package. For example, you may want to clarify that a Family ticket is two adults and two children.", "Define how each ticket will be labeled within the receipt the purchaser receives. If nothing is added then each ticket line will default to the name of the event.", "Click to expand", "You can upload an image or logo to appear against the ticket package when choosing tickets. An example is in the image at the", ", where the Adult ticket has an image.", "Within the Ticket Package popup, you’ll notice", "to the left hand side. This is where you select and highlight the Entry Types that are going to be used to build up your Ticket Package. It’s essential at least one Entry Type is selected in order for a ticket record to be created on the Multi Entry step of the registration flow. If no Entry types are selected then no details will be collected on the Multi Entry step and no ticket records will be created.", "Click to expand", "Now you’ve created your ticket packages, they need to be added to the registration flow.", "Within your event, navigate to Entry Forms, where you will have your default registration flow, and any others you’ve set up. Click the pen and paper icon to edit a paticular reg flow. Here you can edit each of the entry steps that the entrant will go through. Click the edit icon to the right of each step to customise that step.", "This is the first step within your registration process. Under Ticket Options, the tickets you want available to purchase need to be highlighted and then saved. Once done, they will appear on the first step of registration.", "Click to expand", "This is where the ticket purchaser creates their Member record. If they’ve registered for a previous event on your site, then they’ll be prompted to login.", "If the event has fundraising, then this is where your ticket purchaser will set up their fundraising page.", "This step needs to be enabled and set to mandatory. On this step, the ticket purchaser will enter the details of all the ticket holders. If it is not mandatory, then the ticket purchaser will be able to skip the step, resulting in ticket records not being created.", "Define the settings for optional donation and payment.", "Once set up, we always advise running some test entries through your event so you can experience the user journey. You can delete these once you’re ready to go live.", "If you don't want to collect information about each ticket holder, then you can skip setting up Entry Types. Instead, set up your", "as normal, but don't assign Entry Types.", "When setting up the", ", do not enable the Multi-Entry step.", "This means when purchasing tickets, the main ticket purchaser can choose their tickets and go through the registration flow, but will not fill in any details about the individual ticket holders.", "No ticketholder records will be created. The ticket purchaser will have a member record, and against their member record will be the number of the tickets they've purchased, e.g. 2 x Adult and 1 x Child.", "Check out our support articles on", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Events Overview", "post": ["Events Overview", "These are peer-to-peer (P2P) events that you as an administrator create with supporters being able to join. Whether you’re using Funraisin to power a single flagship event or as a multi-event hub, Online Events are where you create, edit and maintain your event information.  Within the settings, you can choose whether fundraisers who register for an Online Event will have a fundraising profile page.", "Offline Events allow you to sell tickets to physical events. Funraisin enables you to set various different entry methods for Offline Events including Registration, RSVP and Buy Tickets. Entrants do not get a fundraising page.", "Examples:", "These are events that a fundraiser creates on your site themselves, using a theme that you've created. As an administrator you’re not able to create a DIY Fundraising event that a fundraiser can join (that would be an Online Event), you’re simply able to keep a track of all DIY Events that fundraisers have created to support them along their journey."]},
{"title": "Creating a Custom Donation Report", "post": ["Creating a Custom Donation Report", "A donation report pulls the raw data collected relating to your donations.", "Your events team to keep track of donors.", "A donation report can pull the data relating to donations made on your platform. This includes the details captured about the donor from the donation form, e.g. name, email, address, and also details of who was sponsored, such as the fundraiser's personal details, team details, page or event.", "The report will pull in donations both transacted through your platform and those added manually as offline donations. More information on how to add an offline donation can be found", ".", "To create a new Donation report, navigate to your Data Exports module and select +New Export.", "Choose Donations as your data source and give your report a name. For ease, you can also utilise one of our pre-built report templates, by clicking the tab", "and then highlighting Donations. Once done, hit Save.", "Click to expand", "Now you've created your report, if you hit the green", "button it will want to download all donations made on your platform. However, it may be that this report is for a specific event, so you only want it to export details on donations relating to this event. Scroll down to the", "section and choose the event you want data from and hit Save. Now when you download the report it will only pull data on donations made to that event. Likewise, you can choose to filter to a specific appeals page, DIY theme, event type, or even multiple events to pull data on.", "Whilst you may want donations specific to an event, you may only want to download those made in the first month of the campaign. You can apply a date range and then save your report. When you next download, it will only download those donations made in that time frame.", "If you'd like the report emailed to you on a regular basis then you can set it to Active, choose your frequency and then set the email address for it to send to at the bottom of the page.", "More information on filtering and scheduling can be found in this support article", ".", "As you chose a template when creating your report, when you move over to your", "tab, you'll notice there are already a large number of fields already set up. We've chosen the most common fields you're likely to use to save you time when creating your report.", "Clicking the + icon to the right of each field will expand it. Once expanded, you can rename it, choose a different Field Value and even remove it altogether. You can also drag and drop the fields to re-order them as you require.", "When you choose a Field Value, you'll notice that First Name, Last Name etc appear more than once in the list. The Field Values all come under subheadings which define what the data relates to.", "This information relates to the donor who made the donation. This includes personal information you requested from them when making the donation and also details around the actual donation, such as amount, date and payment method.", "If the donation is related to an event, such as a donation to a fundraiser or team in an event, or to the event as a whole, then you can pull in details such as the name of the event and total amount currently raised.", "If the donation was made to a fundraiser's page, then you can pull in fields relating to that member. These include their personal details, whether they're in a team, and what their fundraising target is.", "If the donation went to a fundraiser in a team, or was made on a team's fundraising page, then you can pull in details on the team sponsored.", "Similar to the team info, you can pull in an Organisations details if the donation sits on their page.", "The donation may not be related to the event at all, and may be a donation made to a specific appeal. You can pull in details on that page such as the page name and ID.", "If you have the charities module enabled and are using multi-charity, then you can pull in fields to identify which charity the donation went towards.", "This information relates to the payout, which is when Stripe makes a payment from your Stripe account into your bank account.", "Click to expand", "For reconciliation purposes, we'd always advise using a report that uses", "as the data source and not your Donations report. This is because your donation report will pull in the details of all the donations on your platform, including those that you have manually added and marked as paid.", "It will not include other transactions, such as registration fees, and merchandise which you'll also require for reconciliation."]},
{"title": "Creating Custom Reports", "post": ["Creating Custom Reports", "The Data Exports module allows you to create multiple reports to pull data on your fundraisers, donations, transactions, teams and more.", "This article will run through:", "The Data Exports module on your platform allows you to create multiple customised reports that can be downloaded at any time, or sent to you on a specified schedule.", "To create a new report, navigate to", "in the black left-hand navigation, and click on", "to begin. Give your report a name, choose a data source and save. You can then make edits within your", "tab to refine the data you receive.", "Click to expand", "The first thing you need to choose is your data source. Each data source has differing fields available, relevant to that data source. For example, the Shop Sales data source will have products, costs and stock quantity relating to the products available for purchase within your Shop module. Whereas the Fundraisers data source contains fundraising specific information relating to your entrants.", "There are thirteen data sources to choose from. Fundraisers, donations and transactions are the most commonly required.", "This will pull data relating to transactions that have been processed through your platform. This could include registration fees, donations, and merchandise.", "This will provide data on your entrants registered in your events, such as their personal details, fundraising target, and amount raised.", "This will pull data relating to your donations, including donor info and the member/team/event that was sponsored.", "This provides a topline overview of your teams such as captain, the total amount raised, and number of members.", "This details out information collected for shop sales such as the purchaser, shipping details and costs.", "This provides an overview of shop product stock levels.", "This lists out purchases of raffle tickets and the numbers of tickets per purchase. Within your Raffle module you can download a detailed report of one ticket number per line.", "This provides a top line overview of your events, such as date, time, number of entrants, amount raised in donations and amount in registration fees.", "This is used for ticketed events and captures the details of the ticket purchaser and the details of the ticket holders entered on the multi-entry step of registration.", "After the first donation of a scheduled donation has been made, the subsequent scheduled donations will appear in this report once paid.", "This will list out any errors (if any) when a scheduled donation is processed.", "This provides a topline overview of your organisations such as captain, the total amount raised, and number of members.", "If a report is set to", ", then you can specify it to send to certain email addresses on a set schedule. Simply choose the", "radio button and save. If set to", "it simply means it's not being emailed directly to you.", "Once set to Active, you can choose your", "and", ".", "You can also choose your", ":", "Note - when you download a report directly from the platform using the green Download button, this will always download all records.", "Scroll down to the bottom of the page, and you can then specify who receives the report. Multiple emails can be added, a time of day chosen, a subject line for the email and password protection added to the report.", "Click to expand", "Depending on the data source, your reports can be filtered by:", "For example, you may want to download donations, but only between two specific date ranges. These can be set, the report saved and then downloaded.", "Or, you may want details of your fundraisers, but only from two events. You can choose these events using the Event filter.", "Once saved, you can move to your", "tab. Here you can select the fields you'd like to pull, name, and order them.", "Select +Additional Field to add as many fields to your report as you wish. Specify the field name, then select the data this should correspond to from the Field Value drop-down. If importing the data into a CRM we don't integrate with, you can name your Field Names to match your CRM, such as", "for First Name.", "Please note there are some data sources with multiple field values with similar names, make sure you are selecting the right field value for what you require by selecting the field value under the appropriate heading.", "For example, In a donations report, there is First Name under Donor Info, this will collect the first name of the donor. Under Member Info is First Name but this will collect the name of the person the donation is sponsoring.", "When naming your fields, it's important to ensure they are unique. You cannot have two fields with the same name. However, you can have two fields pulling the same data.", "Click to expand", "For import purposed into external tools, if your report must contain fields not captured by your platform, simply add the field name and then select Custom from the top of the Field Value drop-down. This will create a field within your report, but it will be blank. If this field needs to be populated with something specific, add a value into the Default Value field.", "If your report is set to Active, then the", "tab will detail out all the times it has been sent. Who it was sent to, the date and time and the number of records.", "The", "tab will record each time a report is saved and edited and by which admin.", "The reports created within your Data Exports module can provide you with a wealth of data about your events, fundraisers, and transactions. Once downloaded, they can be analyzed and manipulated to review insights and trends to better understand your data.", "If you'd like further support, please pop in a support ticket from your platform and our team will assist you."]},
{"title": "Copy content from one page to another", "post": ["Copy content from one page to another", "The ability to duplicate content across a multitude of pages.", "This is most useful for charities that wish to create several pages using the same layout which only require minor edits to the end product.", "This allows the ability to completely make your content page your own, and be confident you're going to be able to replicate this result throughout your event and other pages.", "Sometimes you will create a great section of content that you just want to be able to replicate on other pages without starting from scratch. All our content pages have the ability to copy over sections of content and clone them onto another page in just a few clicks. Once copied over, you can position on the new page, make any edits and you’re ready to go live!", "Click to expand", "Click to expand", "Click to expand", "Click to expand", "Click to expand", "Go to advanced options > copy to page/event.", "Click to expand", "From here you can either choose a platform page to copy the section to or select an event and then choose a page from the event to copy the section to.", "Click to expand"]},
{"title": "Reports & Data Exports: Get Started", "post": ["Reports & Data Exports", "Discover how to get all the data you need from your site by attending our Custom Reports & Data Exports training session.", "or"]},
{"title": "Connecting to Double the Donation", "post": ["Connecting to Double the Donation", "360MatchPro by Double the Donation is the industry-leading automated matching gift solution designed to streamline your matching gift fundraising. With 360MatchPro’s intuitive autocomplete search field, donors can effortlessly locate their employer in the extensive Double the Donation database. This integration enables you to identify match-eligible donors, drive matches to completion, and gain actionable insights.", "In the article learn about:", "Folow the steps below to enter your Double the Donation API keys", "360MatchPro is available within event fundraising pages, donation blocks and legacy donation forms. The next steps to activate the integration for each form type are below:", "To enable Double the Donation on a donation block", "To enable Double the Donation on legacy donation templates", "To enable Double the Donation within an event", "And that's it! By following these steps,", "If you’d like further help please pop in a support ticket from your admin and our team will assist you."]},
{"title": "Creating Donation and Appeal Pages", "post": ["Creating Donation and Appeal Pages", "New Visual Builder updates means you can now drop a donation block into any content page. This allows more flexibility when creating the layout of your page.", "To create a donation or appeal page with the latest donation block module, please review this", "Donation and crowdfunding pages can still be created following the steps below.", "When creating your donation page or appeal, head to:", "Pages", ">", "Page button in the middle white menu", "From the Page Template & Page Assignment options, select the", "or", "template, enter the name of the page, and assign the page to a parent page (most donation and appeal pages will be standalone so there's no need to assign a new donation page but can be if desired). Once done, save your page.", "One-off, in memory, and regular giving donations are handled in your Pages module. You can create as many donation pages as you need for your seasonal appeals, always-on donation pages and more.", "Continue on as you normally would with setting up your page with all the elements and styling you'd like (the header image, SEO metadata, the content itself which can appear above the donation form, etc).", "You can edit your page using either", "or", ". The settings available are the same, but this guide will take you through both methods, starting with Visual Builder. If you'd rather use Classic Builder,", "to jump down to the instructions.", "When you first land on your page, you will only see a payment form and no placeholder dollar handles. Hover over the payment step, and click on the green pencil in the right-hand corner to open up your options to customise the page.", "This section allows you to set your", ",", "and", ". Each sub-heading can be expanded and the settings changed.", "Define if you'd like donors to be able to make one off, weekly, monthly, or yearly donations. You can also pre-select the chosen frequency for when donors land on the page.", "Add in suggested donation amounts along with an image and information to explain what that amount will go towards supporting. If you've selected more than one donation frequency, e.g. one off and weekly, then you'll have the option to add different dollar handles for each frequency. You may want to suggest higher dollar handles for a yearly recurring donation, vs a weekly recurring donation.", "If enabled, you can choose your matched giver, define the receiver name on the page and add a countdown clock. More information on how to set up Matched Giving can be found in this", ".", "Click expand", "This section is where you can choose your accepted", ", define", ", customise the", "and add in", ".", "Use the toggles to decide if credit card and/or PayPal is an accepted payment method. You can also update the section heading, which by default is called Payment Details.", "Add in a receipt prefix which will ensure donations to this specific page are easily identifiable by their PO number. If you're using multi charity, you can also choose a charity from the drop down that donations will be assigned to.", "Enable or disable receipts and update the primary descriptor if you'd rather it not to be defined as a Donation. You can also add four additional lines of personalised copy to the receipt.", "If using GL codes, you can add in two.", "Click to expand", "This section is where you can choose what data is captured when a donation is made. Some of the settings here will vary, depending on whether you're creating a", "page or", "page.", "On a Donation page, you'll have the option to choose whether your form sits above or below the other content of your page. You can also add in a", "function, so potential donors can find their friend's specific fundraising page.", "Next, you can define the personal data fields captured when making the donation and whether or not their mandatory, and also add in a marketing optin. The section heading defaults to Your Details, but can be updated.", "A Donation page also allows you to add in", "options, and the ability to send a card.", "If you have", "enabled on your platform, you can toggle security on.", "And finally, you can pull in webforms from the", "drop down.", "Click to expand", "If creating a Donation page, you'll have an additional option whereby you can define the layout of the page. Examples of these layouts can be found in the", "section.", "This section is where you can customise your confirmation page, thank you email and add in tracking to the page.", "When a donation has been made, donors will land on a platform standard page. You have the option to either redirect them to another page, or customise the page they land on with copy and personalisation tags. E.g 'Thank you Tom for your donation of $20.'", "By default, donors will receive the email, Receipt to Generic Donor, (ID 31) which is set within Platform Setup > Automated Emails. However, you can create a custom email to trigger when a donation is made to this specific page.", "Click to expand", "As you're using a", ", when editing the page you'll now see the", "option in your middle navigation. Click this and you'll see all the options within a donation page.", "Add in your preferred dollar handles for one-off, weekly, monthly and yearly. If you're using regular giving and don't want different suggested dollar handles, then just add in amounts for one-off.", "Click to Expand", "This section is where you can choose your accepted", ", define", ", customise the", "and add in", ".", "Add in a receipt prefix which will ensure donations to this specific page are easily identifiable by their PO number. If you're using multi charity, you can also choose a charity from the drop down that donations will be assigned to.", "Disable dollar handles if you'd rather no suggested amounts appear.", "Choose whether to display one-off and/or recurring donations.", "Tick the methods you'd like to accept. More information on supported payment methods can be found", ".", "Enable or disable receipts and update the primary descriptor if you'd rather it not to be defined as a Donation. You can also add four additional lines of personalised copy to the receipt.", "If using GL codes, you can add in two.", "Click to expand", "This section is where you can choose what data is captured when a donation is made. Some of the settings here will vary, depending on whether you're creating a", "page or", "page.", "On a Donation page, you'll have the option to choose whether your form sits above or below the other content of your page. You can also add in a", "function, so potential donors can find their friend's specific fundraising page.", "Next, you can define the personal data fields captured when making the donation and whether or not their mandatory, and also add in a marketing optin. The section heading defaults to Your Details, but can be updated.", "A Donation page also allows you to add in", "options, and the ability to send a card.", "If you have", "enabled on your platform, you can toggle security on.", "And finally, you can pull in webforms from the", "drop down.", "Click to Expand", "When a donation has been made, donors will land on a platform standard page. You have the option to either redirect them to another page, or customise the page they land on with copy and personalisation tags. E.g 'Thank you Tom for your donation of $20.'", "Click to Expand", "By default, donors will receive the email, Receipt to Generic Donor, (ID 31) which is set within Platform Setup > Automated Emails. However, here's where you can customise the thank you email donors will receive specific to the donation page they made their donation on. For example, if you're creating an end of financial year appeal, you may wish to style the email template and/or use specific copy relating to the end of financial year appeal in the confirmation email the donor receives. Choose the template you'd like to use and then edit the copy through the editor - remembering to use the", "as needed such as sponsor name and sponsor amount to personalise the email.", "Click to Expand", "allows you to choose from the various donation template layouts we have available. There are examples of how the layouts look", ".", "Click to Expand"]},
{"title": "Full page templates", "post": ["Visual Builder - Full page templates", "In the article learn about:", "There are two ways to access the template library, by navigating to Pages > + New Page, or via the pages module in the Visual Builder. To create a new page in the Visual Builder select the page name in the top toolbar on any page, this will open the pages module, then click + New Page.", "Once you have selected a template that works for you can start to fine-tune that template with your own images, messaging and any other blocks you feel are needed. You can learn more about", "We hope that this article has helped you to understand how to use full page templates.", "When you're ready, we encourage you to continue your journey learning more about the many features within Visual Builder. Here are few links to keep you moving and kicking goals:", "If you have any questions and are unable to find the answers through our Visual Builder Support Articles, then please reach out to our amazing Support Team who will be happy to help you out!"]}
]